kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f427xx.h
/* Legacy define */
#define  HASH_RNG_IRQn      RNG_IRQn

/**
  * @}
  */

#include "core_cm4.h"             /* Cortex-M4 processor and core peripherals */
#include "system_apm32f4xx.h"
#include <stdint.h>

/** @addtogroup Peripheral_registers_structures
  * @{
  */

/**
  * @brief Analog to Digital Converter
  */

typedef struct
{
  __IO uint32_t STS;        /*!< ADC status register,                         Address offset: 0x00 */
  __IO uint32_t CTRL1;      /*!< ADC control register 1,                      Address offset: 0x04 */
  __IO uint32_t CTRL2;      /*!< ADC control register 2,                      Address offset: 0x08 */
  __IO uint32_t SMPTIM1;    /*!< ADC sample time register 1,                  Address offset: 0x0C */
  __IO uint32_t SMPTIM2;    /*!< ADC sample time register 2,                  Address offset: 0x10 */
  __IO uint32_t INJDOF1;    /*!< ADC injected channel data offset register 1, Address offset: 0x14 */
  __IO uint32_t INJDOF2;    /*!< ADC injected channel data offset register 2, Address offset: 0x18 */
  __IO uint32_t INJDOF3;    /*!< ADC injected channel data offset register 3, Address offset: 0x1C */
  __IO uint32_t INJDOF4;    /*!< ADC injected channel data offset register 4, Address offset: 0x20 */
  __IO uint32_t AWDHT;      /*!< ADC watchdog higher threshold register,      Address offset: 0x24 */
  __IO uint32_t AWDLT;      /*!< ADC watchdog lower threshold register,       Address offset: 0x28 */
  __IO uint32_t REGSEQ1;    /*!< ADC regular sequence register 1,             Address offset: 0x2C */
  __IO uint32_t REGSEQ2;    /*!< ADC regular sequence register 2,             Address offset: 0x30 */
  __IO uint32_t REGSEQ3;    /*!< ADC regular sequence register 3,             Address offset: 0x34 */
  __IO uint32_t INJSEQ;     /*!< ADC injected sequence register,              Address offset: 0x38 */
  __IO uint32_t INJDATA1;   /*!< ADC injected data register 1,                Address offset: 0x3C */
  __IO uint32_t INJDATA2;   /*!< ADC injected data register 2,                Address offset: 0x40 */
  __IO uint32_t INJDATA3;   /*!< ADC injected data register 3,                Address offset: 0x44 */
  __IO uint32_t INJDATA4;   /*!< ADC injected data register 4,                Address offset: 0x48 */
  __IO uint32_t REGDATA;    /*!< ADC regular data register,                   Address offset: 0x4C */
  __IO uint32_t OSAMPCTRL;  /*!< ADC oversampling control register,           Address offset: 0x50 */
} ADC_TypeDef;

typedef struct
{
  __IO uint32_t CSTS;   /*!< ADC Common status register,                  Address offset: ADC1 base address + 0x300 */
  __IO uint32_t CCTRL;  /*!< ADC common control register,                 Address offset: ADC1 base address + 0x304 */
  __IO uint32_t CDATA;  /*!< ADC common regular data register for dual
                             AND triple modes,                            Address offset: ADC1 base address + 0x308 */
} ADC_Common_TypeDef;


/**
  * @brief Controller Area Network TxMailBox
  */

typedef struct
{
  __IO uint32_t TXMID;  /*!< CAN TX mailbox identifier register */
  __IO uint32_t TXDLEN; /*!< CAN mailbox data length control and time stamp register */
  __IO uint32_t TXMDL;  /*!< CAN mailbox data low register */
  __IO uint32_t TXMDH;  /*!< CAN mailbox data high register */
} CAN_TxMailBox_TypeDef;

/**
  * @brief Controller Area Network FIFOMailBox
  */

typedef struct
{
  __IO uint32_t RXMID;  /*!< CAN receive FIFO mailbox identifier register */
  __IO uint32_t RXDLEN; /*!< CAN receive FIFO mailbox data length control and time stamp register */
  __IO uint32_t RXMDL;  /*!< CAN receive FIFO mailbox data low register */
  __IO uint32_t RXMDH;  /*!< CAN receive FIFO mailbox data high register */
} CAN_FIFOMailBox_TypeDef;

/**
  * @brief Controller Area Network FilterRegister
  */

typedef struct
{
  __IO uint32_t FBANK1; /*!< CAN Filter bank register 1 */
  __IO uint32_t FBANK2; /*!< CAN Filter bank register 1 */
} CAN_FilterRegister_TypeDef;

/**
  * @brief Controller Area Network
  */

typedef struct
{
  __IO uint32_t              MCTRL;               /*!< CAN master control register,         Address offset: 0x00          */
  __IO uint32_t              MSTS;                /*!< CAN master status register,          Address offset: 0x04          */
  __IO uint32_t              TXSTS;               /*!< CAN transmit status register,        Address offset: 0x08          */
  __IO uint32_t              RXF0;                /*!< CAN receive FIFO 0 register,         Address offset: 0x0C          */
  __IO uint32_t              RXF1;                /*!< CAN receive FIFO 1 register,         Address offset: 0x10          */
  __IO uint32_t              INTEN;               /*!< CAN interrupt enable register,       Address offset: 0x14          */
  __IO uint32_t              ERRSTS;              /*!< CAN error status register,           Address offset: 0x18          */
  __IO uint32_t              BITTIM;              /*!< CAN bit timing register,             Address offset: 0x1C          */
  uint32_t                   RESERVED0[88];       /*!< Reserved, 0x020 - 0x17F                                            */
  CAN_TxMailBox_TypeDef      sTxMailBox[3];       /*!< CAN Tx MailBox,                      Address offset: 0x180 - 0x1AC */
  CAN_FIFOMailBox_TypeDef    sFIFOMailBox[2];     /*!< CAN FIFO MailBox,                    Address offset: 0x1B0 - 0x1CC */
  uint32_t                   RESERVED1[12];       /*!< Reserved, 0x1D0 - 0x1FF                                            */
  __IO uint32_t              FCTRL;               /*!< CAN filter master register,          Address offset: 0x200         */
  __IO uint32_t              FMCFG;               /*!< CAN filter mode register,            Address offset: 0x204         */
  uint32_t                   RESERVED2;           /*!< Reserved, 0x208                                                    */
  __IO uint32_t              FSCFG;               /*!< CAN filter scale register,           Address offset: 0x20C         */
  uint32_t                   RESERVED3;           /*!< Reserved, 0x210                                                    */
  __IO uint32_t              FFASS;               /*!< CAN filter FIFO assignment register, Address offset: 0x214         */
  uint32_t                   RESERVED4;           /*!< Reserved, 0x218                                                    */
  __IO uint32_t              FACT;                /*!< CAN filter activation register,      Address offset: 0x21C         */
  uint32_t                   RESERVED5[8];        /*!< Reserved, 0x220-0x23F                                              */
  CAN_FilterRegister_TypeDef sFilterRegister[28]; /*!< CAN Filter Register,                 Address offset: 0x240-0x31C   */
} CAN_TypeDef;

/**
  * @brief CRC calculation unit
  */

typedef struct
{
  __IO uint32_t DATA;       /*!< CRC Data register,             Address offset: 0x00 */
  __IO uint8_t  INDATA;     /*!< CRC Independent data register, Address offset: 0x04 */
  uint8_t       RESERVED0;  /*!< Reserved, 0x05                                      */
  uint16_t      RESERVED1;  /*!< Reserved, 0x06                                      */
  __IO uint32_t CTRL;       /*!< CRC Control register,          Address offset: 0x08 */
} CRC_TypeDef;

/**
  * @brief Digital to Analog Converter
  */

typedef struct
{
  __IO uint32_t CTRL;       /*!< DAC control register,                                    Address offset: 0x00 */
  __IO uint32_t SWTRG;      /*!< DAC software trigger register,                           Address offset: 0x04 */
  __IO uint32_t DH12R1;     /*!< DAC channel1 12-bit right-aligned data holding register, Address offset: 0x08 */
  __IO uint32_t DH12L1;     /*!< DAC channel1 12-bit left aligned data holding register,  Address offset: 0x0C */
  __IO uint32_t DH8R1;      /*!< DAC channel1 8-bit right aligned data holding register,  Address offset: 0x10 */
  __IO uint32_t DH12R2;     /*!< DAC channel2 12-bit right aligned data holding register, Address offset: 0x14 */
  __IO uint32_t DH12L2;     /*!< DAC channel2 12-bit left aligned data holding register,  Address offset: 0x18 */
  __IO uint32_t DH8R2;      /*!< DAC channel2 8-bit right-aligned data holding register,  Address offset: 0x1C */
  __IO uint32_t DH12RDUAL;  /*!< Dual DAC 12-bit right-aligned data holding register,     Address offset: 0x20 */
  __IO uint32_t DH12LDUAL;  /*!< DUAL DAC 12-bit left aligned data holding register,      Address offset: 0x24 */
  __IO uint32_t DH8RDUAL;   /*!< DUAL DAC 8-bit right aligned data holding register,      Address offset: 0x28 */
  __IO uint32_t DATAOCH1;   /*!< DAC channel1 data output register,                       Address offset: 0x2C */
  __IO uint32_t DATAOCH2;   /*!< DAC channel2 data output register,                       Address offset: 0x30 */
  __IO uint32_t STS;        /*!< DAC status register,                                     Address offset: 0x34 */
} DAC_TypeDef;

/**
  * @brief Debug MCU
  */

typedef struct
{
  __IO uint32_t IDCODE;   /*!< MCU device ID code,               Address offset: 0x00 */
  __IO uint32_t CFG;      /*!< Debug MCU configuration register, Address offset: 0x04 */
  __IO uint32_t APB1F;    /*!< Debug MCU APB1 freeze register,   Address offset: 0x08 */
  __IO uint32_t APB2F;    /*!< Debug MCU APB2 freeze register,   Address offset: 0x0C */
} DBGMCU_TypeDef;

/**
  * @brief DMA Controller
  */

typedef struct
{
  __IO uint32_t SCFG;   /*!< DMA stream x configuration register      */
  __IO uint32_t NDATA;  /*!< DMA stream x number of data register     */
  __IO uint32_t PADDR;  /*!< DMA stream x peripheral address register */
  __IO uint32_t M0ADDR; /*!< DMA stream x memory 0 address register   */
  __IO uint32_t M1ADDR; /*!< DMA stream x memory 1 address register   */
  __IO uint32_t FCTRL;  /*!< DMA stream x FIFO control register       */
} DMA_Stream_TypeDef;

typedef struct
{
  __IO uint32_t LINTSTS;  /*!< DMA low interrupt status register,      Address offset: 0x00 */
  __IO uint32_t HINTSTS;  /*!< DMA high interrupt status register,     Address offset: 0x04 */
  __IO uint32_t LIFCLR;   /*!< DMA low interrupt flag clear register,  Address offset: 0x08 */
  __IO uint32_t HIFCLR;   /*!< DMA high interrupt flag clear register, Address offset: 0x0C */
} DMA_TypeDef;

/**
  * @brief Ethernet MAC
  */

typedef struct
{
  __IO uint32_t MACCFG;
  __IO uint32_t MACFRAF;
  __IO uint32_t MACHTH;
  __IO uint32_t MACHTL;
  __IO uint32_t MACADDR;
  __IO uint32_t MACDATA;
  __IO uint32_t MACFCTRL;
  __IO uint32_t MACVLANT;              /*    8 */
  uint32_t      RESERVED0[2];
  __IO uint32_t MACREMWKUPFFL;         /*   11 */
  __IO uint32_t MACPMTCTRLSTS;
  uint32_t      RESERVED1;
  __IO uint32_t MACDBG;
  __IO uint32_t MACISTS;               /*   15 */
  __IO uint32_t MACIMASK;
  __IO uint32_t MACADDR0H;
  __IO uint32_t MACADDR0L;
  __IO uint32_t MACADDR1H;
  __IO uint32_t MACADDR1L;
  __IO uint32_t MACADDR2H;
  __IO uint32_t MACADDR2L;
  __IO uint32_t MACADDR3H;
  __IO uint32_t MACADDR3L;            /*   24 */
  uint32_t      RESERVED2[40];
  __IO uint32_t MMCCTRL;              /*   65 */
  __IO uint32_t MMCRXINT;
  __IO uint32_t MMCTXINT;
  __IO uint32_t MMCRXINTMASK;
  __IO uint32_t MMCTXINTMASK;         /*   69 */
  uint32_t      RESERVED3[14];
  __IO uint32_t MMCTXGFSCCNT;         /*   84 */
  __IO uint32_t MMCTXGFMCCNT;
  uint32_t      RESERVED4[5];
  __IO uint32_t MMCTXGFCNT;
  uint32_t      RESERVED5[10];
  __IO uint32_t MMCRXFCECNT;
  __IO uint32_t MMCRXFAECNT;
  uint32_t      RESERVED6[10];
  __IO uint32_t MMCRXGUNCNT;
  uint32_t      RESERVED7[334];
  __IO uint32_t PTPTSCTRL;
  __IO uint32_t PTPSUBSECI;
  __IO uint32_t PTPTSH;
  __IO uint32_t PTPTSL;
  __IO uint32_t PTPTSHUD;
  __IO uint32_t PTPTSLUD;
  __IO uint32_t PTPTSA;
  __IO uint32_t PTPTTSH;
  __IO uint32_t PTPTTSL;
  __IO uint32_t RESERVED8;
  __IO uint32_t PTPTSSTS;
  uint32_t      RESERVED9[565];
  __IO uint32_t DMABMOD;
  __IO uint32_t DMATXPD;
  __IO uint32_t DMARXPD;
  __IO uint32_t DMARXDLADDR;
  __IO uint32_t DMATXDLADDR;
  __IO uint32_t DMASTS;
  __IO uint32_t DMAOPMOD;
  __IO uint32_t DMAINTEN;
  __IO uint32_t DMAMFABOCNT;
  __IO uint32_t DMARXFLGWDT;
  uint32_t      RESERVED10[8];
  __IO uint32_t DMAHTXD;
  __IO uint32_t DMAHRXD;
  __IO uint32_t DMAHTXBADDR;
  __IO uint32_t DMAHRXBADDR;
} ETH_TypeDef;

/**
  * @brief External Interrupt/Event Controller
  */

typedef struct
{
  __IO uint32_t IMASK;    /*!< EINT Interrupt mask register,            Address offset: 0x00 */
  __IO uint32_t EMASK;    /*!< EINT Event mask register,                Address offset: 0x04 */
  __IO uint32_t RTEN;     /*!< EINT Rising trigger selection register,  Address offset: 0x08 */
  __IO uint32_t FTEN;     /*!< EINT Falling trigger selection register, Address offset: 0x0C */
  __IO uint32_t SWINTE;   /*!< EINT Software interrupt event register,  Address offset: 0x10 */
  __IO uint32_t IPEND;    /*!< EINT Pending register,                   Address offset: 0x14 */
} EINT_TypeDef;

/**
  * @brief FLASH Registers
  */

typedef struct
{
  __IO uint32_t ACCTRL;   /*!< FLASH access control register,   Address offset: 0x00 */
  __IO uint32_t KEY;      /*!< FLASH key register,              Address offset: 0x04 */
  __IO uint32_t OPTKEY;   /*!< FLASH option key register,       Address offset: 0x08 */
  __IO uint32_t STS;      /*!< FLASH status register,           Address offset: 0x0C */
  __IO uint32_t CTRL;     /*!< FLASH control register,          Address offset: 0x10 */
  __IO uint32_t OPTCTRL;  /*!< FLASH option control register ,  Address offset: 0x14 */
} FLASH_TypeDef;

/**
  * @brief Dynamic memory controler (DMC)
  */
typedef struct
{
  __IO uint32_t CFG;            /*!< Configuraion register,    Address offset: 0x00 */
  __IO uint32_t TIM0;           /*!< Timing register 0,        Address offset: 0x04 */
  __IO uint32_t TIM1;           /*!< Timing register 1,        Address offset: 0x08 */
  __IO uint32_t CTRL1;          /*!< Control register 1,       Address offset: 0x0C */
  __IO uint32_t REF;            /*!< refresh register,         Address offset: 0x10 */
  uint32_t      RESERVED[251];
  __IO uint32_t SW;             /*!< switch register,          Address offset: 0x400 */
  __IO uint32_t CTRL2;          /*!< Control register 2,       Address offset: 0x404 */
} DMC_TypeDef;

/**
  * @brief Flexible Static Memory Controller
  */

typedef struct
{
  __IO uint32_t CSTR[8];    /*!< NOR/PSRAM chip-select control register(CSCTRL) and chip-select timing register(CSTIM), Address offset: 0x00-1C */
} SMC_Bank1_TypeDef;

/**
  * @brief Flexible Static Memory Controller Bank1E
  */

typedef struct
{
  __IO uint32_t WRTTIM[7];    /*!< NOR/PSRAM write timing registers, Address offset: 0x104-0x11C */
} SMC_Bank1E_TypeDef;

/**
  * @brief Flexible Static Memory Controller Bank2
  */

typedef struct
{
  __IO uint32_t CTRL2;        /*!< NAND Flash control register 2,                       Address offset: 0x60 */
  __IO uint32_t STSINT2;      /*!< NAND Flash FIFO status and interrupt register 2,     Address offset: 0x64 */
  __IO uint32_t CMSTIM2;      /*!< NAND Flash Common memory space timing register 2,    Address offset: 0x68 */
  __IO uint32_t AMSTIM2;      /*!< NAND Flash Attribute memory space timing register 2, Address offset: 0x6C */
  uint32_t      RESERVED0;    /*!< Reserved, 0x70                                                            */
  __IO uint32_t ECCRS2;       /*!< NAND Flash ECC result registers 2,                   Address offset: 0x74 */
  uint32_t      RESERVED1;    /*!< Reserved, 0x78                                                            */
  uint32_t      RESERVED2;    /*!< Reserved, 0x7C                                                            */
  __IO uint32_t CTRL3;        /*!< NAND Flash control register 3,                       Address offset: 0x80 */
  __IO uint32_t STSINT3;      /*!< NAND Flash FIFO status and interrupt register 3,     Address offset: 0x84 */
  __IO uint32_t CMSTIM3;      /*!< NAND Flash Common memory space timing register 3,    Address offset: 0x88 */
  __IO uint32_t AMSTIM3;      /*!< NAND Flash Attribute memory space timing register 3, Address offset: 0x8C */
  uint32_t      RESERVED3;    /*!< Reserved, 0x90                                                            */
  __IO uint32_t ECCRS3;       /*!< NAND Flash ECC result registers 3,                   Address offset: 0x94 */
} SMC_Bank2_3_TypeDef;

/**
  * @brief Flexible Static Memory Controller Bank4
  */

typedef struct
{
  __IO uint32_t CTRL4;        /*!< PC Card  control register 4,                       Address offset: 0xA0 */
  __IO uint32_t STSINT4;      /*!< PC Card  FIFO status and interrupt register 4,     Address offset: 0xA4 */
  __IO uint32_t CMSTIM4;      /*!< PC Card  Common memory space timing register 4,    Address offset: 0xA8 */
  __IO uint32_t AMSTIM4;      /*!< PC Card  Attribute memory space timing register 4, Address offset: 0xAC */
  __IO uint32_t IOSTIM4;      /*!< PC Card  I/O space timing register 4,              Address offset: 0xB0 */
} SMC_Bank4_TypeDef;

/**
  * @brief General Purpose I/O
  */

typedef struct
{
  __IO uint32_t MODE;     /*!< GPIO port mode register,               Address offset: 0x00      */
  __IO uint32_t OMODE;    /*!< GPIO port output type register,        Address offset: 0x04      */
  __IO uint32_t OSSEL;    /*!< GPIO port output speed register,       Address offset: 0x08      */
  __IO uint32_t PUPD;     /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */
  __IO uint32_t IDATA;    /*!< GPIO port input data register,         Address offset: 0x10      */
  __IO uint32_t ODATA;    /*!< GPIO port output data register,        Address offset: 0x14      */
  __IO uint32_t BSC;      /*!< GPIO port bit set/reset register,      Address offset: 0x18      */
  __IO uint32_t LOCK;     /*!< GPIO port configuration lock register, Address offset: 0x1C      */
  __IO uint32_t ALF[2];   /*!< GPIO alternate function registers,     Address offset: 0x20-0x24 */
} GPIO_TypeDef;

/**
  * @brief System configuration controller
  */

typedef struct
{
  __IO uint32_t MMSEL;        /*!< SYSCFG memory remap register,                      Address offset: 0x00      */
  __IO uint32_t PMCFG;        /*!< SYSCFG peripheral mode configuration register,     Address offset: 0x04      */
  __IO uint32_t EINTCFG[4];   /*!< SYSCFG external interrupt configuration registers, Address offset: 0x08-0x14 */
  uint32_t      RESERVED[2];  /*!< Reserved, 0x18-0x1C                                                          */
  __IO uint32_t CCCTRL;       /*!< SYSCFG Compensation cell control register,         Address offset: 0x20      */
} SYSCFG_TypeDef;

/**
  * @brief Inter-integrated Circuit Interface
  */

typedef struct
{
  __IO uint32_t CTRL1;      /*!< I2C Control register 1,     Address offset: 0x00 */
  __IO uint32_t CTRL2;      /*!< I2C Control register 2,     Address offset: 0x04 */
  __IO uint32_t SADDR1;     /*!< I2C Own address register 1, Address offset: 0x08 */
  __IO uint32_t SADDR2;     /*!< I2C Own address register 2, Address offset: 0x0C */
  __IO uint32_t DATA;       /*!< I2C Data register,          Address offset: 0x10 */
  __IO uint32_t STS1;       /*!< I2C Status register 1,      Address offset: 0x14 */
  __IO uint32_t STS2;       /*!< I2C Status register 2,      Address offset: 0x18 */
  __IO uint32_t CLKCTRL;    /*!< I2C Clock control register, Address offset: 0x1C */
  __IO uint32_t RISETMAX;   /*!< I2C RISETMAX register,      Address offset: 0x20 */
} I2C_TypeDef;

/**
  * @brief Independent WATCHDOG
  */

typedef struct
{
  __IO uint32_t KEY;    /*!< IWDT Key register,       Address offset: 0x00 */
  __IO uint32_t PSC;    /*!< IWDT Prescaler register, Address offset: 0x04 */
  __IO uint32_t CNTRLD; /*!< IWDT Reload register,    Address offset: 0x08 */
  __IO uint32_t STS;    /*!< IWDT Status register,    Address offset: 0x0C */
} IWDT_TypeDef;


/**
  * @brief Power Control
  */

typedef struct
{
  __IO uint32_t CTRL; /*!< PMU power control register,        Address offset: 0x00 */
  __IO uint32_t CSTS; /*!< PMU power control/status register, Address offset: 0x04 */
} PMU_TypeDef;

/**
  * @brief Reset and Clock Control
  */

typedef struct
{
  __IO uint32_t CTRL;           /*!< RCM clock control register,                                  Address offset: 0x00 */
  __IO uint32_t PLL1CFG;        /*!< RCM PLL configuration register,                              Address offset: 0x04 */
  __IO uint32_t CFG;            /*!< RCM clock configuration register,                            Address offset: 0x08 */
  __IO uint32_t INT;            /*!< RCM clock interrupt register,                                Address offset: 0x0C */
  __IO uint32_t AHB1RST;        /*!< RCM AHB1 peripheral reset register,                          Address offset: 0x10 */
  __IO uint32_t AHB2RST;        /*!< RCM AHB2 peripheral reset register,                          Address offset: 0x14 */
  __IO uint32_t AHB3RST;        /*!< RCM AHB3 peripheral reset register,                          Address offset: 0x18 */
  uint32_t      RESERVED0;      /*!< Reserved, 0x1C                                                                    */
  __IO uint32_t APB1RST;        /*!< RCM APB1 peripheral reset register,                          Address offset: 0x20 */
  __IO uint32_t APB2RST;        /*!< RCM APB2 peripheral reset register,                          Address offset: 0x24 */
  uint32_t      RESERVED1[2];   /*!< Reserved, 0x28-0x2C                                                               */
  __IO uint32_t AHB1CLKEN;      /*!< RCM AHB1 peripheral clock register,                          Address offset: 0x30 */
  __IO uint32_t AHB2CLKEN;      /*!< RCM AHB2 peripheral clock register,                          Address offset: 0x34 */
  __IO uint32_t AHB3CLKEN;      /*!< RCM AHB3 peripheral clock register,                          Address offset: 0x38 */
  uint32_t      RESERVED2;      /*!< Reserved, 0x3C                                                                    */
  __IO uint32_t APB1CLKEN;      /*!< RCM APB1 peripheral clock enable register,                   Address offset: 0x40 */
  __IO uint32_t APB2CLKEN;      /*!< RCM APB2 peripheral clock enable register,                   Address offset: 0x44 */
  uint32_t      RESERVED3[2];   /*!< Reserved, 0x48-0x4C                                                               */
  __IO uint32_t LPAHB1CLKEN;    /*!< RCM AHB1 peripheral clock enable in low power mode register, Address offset: 0x50 */
  __IO uint32_t LPAHB2CLKEN;    /*!< RCM AHB2 peripheral clock enable in low power mode register, Address offset: 0x54 */
  __IO uint32_t LPAHB3CLKEN;    /*!< RCM AHB3 peripheral clock enable in low power mode register, Address offset: 0x58 */
  uint32_t      RESERVED4;      /*!< Reserved, 0x5C                                                                    */
  __IO uint32_t LPAPB1CLKEN;    /*!< RCM APB1 peripheral clock enable in low power mode register, Address offset: 0x60 */
  __IO uint32_t LPAPB2CLKEN;    /*!< RCM APB2 peripheral clock enable in low power mode register, Address offset: 0x64 */
  uint32_t      RESERVED5[2];   /*!< Reserved, 0x68-0x6C                                                               */
  __IO uint32_t BDCTRL;         /*!< RCM Backup domain control register,                          Address offset: 0x70 */
  __IO uint32_t CSTS;           /*!< RCM clock control & status register,                         Address offset: 0x74 */
  uint32_t      RESERVED6[2];   /*!< Reserved, 0x78-0x7C                                                               */
  __IO uint32_t SSCCFG;         /*!< RCM spread spectrum clock generation register,               Address offset: 0x80 */
} RCM_TypeDef;

/**
  * @brief Real-Time Clock
  */

