kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f427xx.h
/********************  Bit definition for CRC_CTRL register  ********************/
#define CRC_CTRL_RST_Pos                                            (0U)
#define CRC_CTRL_RST_Msk                                            (0x1UL << CRC_CTRL_RST_Pos)                                    /*!< 0x00000001 */
#define CRC_CTRL_RST                                                CRC_CTRL_RST_Msk                                               /*!< RESET bit */

/******************************************************************************/
/*                                                                            */
/*                      Digital to Analog Converter                           */
/*                                                                            */
/******************************************************************************/
/*
 * @brief Specific device feature definitions (not present on all devices in the APM32F4 serie)
 */
#define DAC_CHANNEL2_SUPPORT                                                                                                       /*!< DAC feature available only on specific devices: availability of DAC channel 2 */
/********************  Bit definition for DAC_CTRL register  ********************/
#define DAC_CTRL_ENCH1_Pos                                          (0U)
#define DAC_CTRL_ENCH1_Msk                                          (0x1UL << DAC_CTRL_ENCH1_Pos)                                  /*!< 0x00000001 */
#define DAC_CTRL_ENCH1                                              DAC_CTRL_ENCH1_Msk                                             /*!<DAC channel1 enable */
#define DAC_CTRL_BUFFDCH1_Pos                                       (1U)
#define DAC_CTRL_BUFFDCH1_Msk                                       (0x1UL << DAC_CTRL_BUFFDCH1_Pos)                               /*!< 0x00000002 */
#define DAC_CTRL_BUFFDCH1                                           DAC_CTRL_BUFFDCH1_Msk                                          /*!<DAC channel1 output buffer disable */
#define DAC_CTRL_TRGENCH1_Pos                                       (2U)
#define DAC_CTRL_TRGENCH1_Msk                                       (0x1UL << DAC_CTRL_TRGENCH1_Pos)                               /*!< 0x00000004 */
#define DAC_CTRL_TRGENCH1                                           DAC_CTRL_TRGENCH1_Msk                                          /*!<DAC channel1 Trigger enable */

#define DAC_CTRL_TRGSELCH1_Pos                                      (3U)
#define DAC_CTRL_TRGSELCH1_Msk                                      (0x7UL << DAC_CTRL_TRGSELCH1_Pos)                              /*!< 0x00000038 */
#define DAC_CTRL_TRGSELCH1                                          DAC_CTRL_TRGSELCH1_Msk                                         /*!<TSEL1[2:0] (DAC channel1 Trigger selection) */
#define DAC_CTRL_TRGSELCH1_0                                        (0x1UL << DAC_CTRL_TRGSELCH1_Pos)                              /*!< 0x00000008 */
#define DAC_CTRL_TRGSELCH1_1                                        (0x2UL << DAC_CTRL_TRGSELCH1_Pos)                              /*!< 0x00000010 */
#define DAC_CTRL_TRGSELCH1_2                                        (0x4UL << DAC_CTRL_TRGSELCH1_Pos)                              /*!< 0x00000020 */

#define DAC_CTRL_WAVENCH1_Pos                                       (6U)
#define DAC_CTRL_WAVENCH1_Msk                                       (0x3UL << DAC_CTRL_WAVENCH1_Pos)                               /*!< 0x000000C0 */
#define DAC_CTRL_WAVENCH1                                           DAC_CTRL_WAVENCH1_Msk                                          /*!<WAVE1[1:0] (DAC channel1 noise/triangle wave generation enable) */
#define DAC_CTRL_WAVENCH1_0                                         (0x1UL << DAC_CTRL_WAVENCH1_Pos)                               /*!< 0x00000040 */
#define DAC_CTRL_WAVENCH1_1                                         (0x2UL << DAC_CTRL_WAVENCH1_Pos)                               /*!< 0x00000080 */

#define DAC_CTRL_MAMPSELCH1_Pos                                     (8U)
#define DAC_CTRL_MAMPSELCH1_Msk                                     (0xFUL << DAC_CTRL_MAMPSELCH1_Pos)                             /*!< 0x00000F00 */
#define DAC_CTRL_MAMPSELCH1                                         DAC_CTRL_MAMPSELCH1_Msk                                        /*!<MAMP1[3:0] (DAC channel1 Mask/Amplitude selector) */
#define DAC_CTRL_MAMPSELCH1_0                                       (0x1UL << DAC_CTRL_MAMPSELCH1_Pos)                             /*!< 0x00000100 */
#define DAC_CTRL_MAMPSELCH1_1                                       (0x2UL << DAC_CTRL_MAMPSELCH1_Pos)                             /*!< 0x00000200 */
#define DAC_CTRL_MAMPSELCH1_2                                       (0x4UL << DAC_CTRL_MAMPSELCH1_Pos)                             /*!< 0x00000400 */
#define DAC_CTRL_MAMPSELCH1_3                                       (0x8UL << DAC_CTRL_MAMPSELCH1_Pos)                             /*!< 0x00000800 */

#define DAC_CTRL_DMAENCH1_Pos                                       (12U)
#define DAC_CTRL_DMAENCH1_Msk                                       (0x1UL << DAC_CTRL_DMAENCH1_Pos)                               /*!< 0x00001000 */
#define DAC_CTRL_DMAENCH1                                           DAC_CTRL_DMAENCH1_Msk                                          /*!<DAC channel1 DMA enable */
#define DAC_CTRL_DMAUDIEN1_Pos                                      (13U)
#define DAC_CTRL_DMAUDIEN1_Msk                                      (0x1UL << DAC_CTRL_DMAUDIEN1_Pos)                              /*!< 0x00002000 */
#define DAC_CTRL_DMAUDIEN1                                          DAC_CTRL_DMAUDIEN1_Msk                                         /*!<DAC channel1 DMA underrun interrupt enable*/
#define DAC_CTRL_ENCH2_Pos                                          (16U)
#define DAC_CTRL_ENCH2_Msk                                          (0x1UL << DAC_CTRL_ENCH2_Pos)                                  /*!< 0x00010000 */
#define DAC_CTRL_ENCH2                                              DAC_CTRL_ENCH2_Msk                                             /*!<DAC channel2 enable */
#define DAC_CTRL_BUFFDCH2_Pos                                       (17U)
#define DAC_CTRL_BUFFDCH2_Msk                                       (0x1UL << DAC_CTRL_BUFFDCH2_Pos)                               /*!< 0x00020000 */
#define DAC_CTRL_BUFFDCH2                                           DAC_CTRL_BUFFDCH2_Msk                                          /*!<DAC channel2 output buffer disable */
#define DAC_CTRL_TRGENCH2_Pos                                       (18U)
#define DAC_CTRL_TRGENCH2_Msk                                       (0x1UL << DAC_CTRL_TRGENCH2_Pos)                               /*!< 0x00040000 */
#define DAC_CTRL_TRGENCH2                                           DAC_CTRL_TRGENCH2_Msk                                          /*!<DAC channel2 Trigger enable */

