kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f427xx.h
/*******************  Bits definition for FMC_STS register  ******************/
#define FLASH_STS_OPRCMP_Pos                                        (0U)
#define FLASH_STS_OPRCMP_Msk                                        (0x1UL << FLASH_STS_OPRCMP_Pos)                                /*!< 0x00000001 */
#define FLASH_STS_OPRCMP                                            FLASH_STS_OPRCMP_Msk
#define FLASH_STS_OPRERR_Pos                                        (1U)
#define FLASH_STS_OPRERR_Msk                                        (0x1UL << FLASH_STS_OPRERR_Pos)                                /*!< 0x00000002 */
#define FLASH_STS_OPRERR                                            FLASH_STS_OPRERR_Msk
#define FLASH_STS_WPROTERR_Pos                                      (4U)
#define FLASH_STS_WPROTERR_Msk                                      (0x1UL << FLASH_STS_WPROTERR_Pos)                              /*!< 0x00000010 */
#define FLASH_STS_WPROTERR                                          FLASH_STS_WPROTERR_Msk
#define FLASH_STS_PGALGERR_Pos                                      (5U)
#define FLASH_STS_PGALGERR_Msk                                      (0x1UL << FLASH_STS_PGALGERR_Pos)                              /*!< 0x00000020 */
#define FLASH_STS_PGALGERR                                          FLASH_STS_PGALGERR_Msk
#define FLASH_STS_PGPRLERR_Pos                                      (6U)
#define FLASH_STS_PGPRLERR_Msk                                      (0x1UL << FLASH_STS_PGPRLERR_Pos)                              /*!< 0x00000040 */
#define FLASH_STS_PGPRLERR                                          FLASH_STS_PGPRLERR_Msk
#define FLASH_STS_PGSEQERR_Pos                                      (7U)
#define FLASH_STS_PGSEQERR_Msk                                      (0x1UL << FLASH_STS_PGSEQERR_Pos)                              /*!< 0x00000080 */
#define FLASH_STS_PGSEQERR                                          FLASH_STS_PGSEQERR_Msk
#define FLASH_STS_BUSY_Pos                                          (16U)
#define FLASH_STS_BUSY_Msk                                          (0x1UL << FLASH_STS_BUSY_Pos)                                  /*!< 0x00010000 */
#define FLASH_STS_BUSY                                              FLASH_STS_BUSY_Msk

/*******************  Bits definition for FMC_CTRL register  ******************/
#define FLASH_CTRL_PG_Pos                                           (0U)
#define FLASH_CTRL_PG_Msk                                           (0x1UL << FLASH_CTRL_PG_Pos)                                   /*!< 0x00000001 */
#define FLASH_CTRL_PG                                               FLASH_CTRL_PG_Msk
#define FLASH_CTRL_SERS_Pos                                         (1U)
#define FLASH_CTRL_SERS_Msk                                         (0x1UL << FLASH_CTRL_SERS_Pos)                                 /*!< 0x00000002 */
#define FLASH_CTRL_SERS                                             FLASH_CTRL_SERS_Msk
#define FLASH_CTRL_MERS_Pos                                         (2U)
#define FLASH_CTRL_MERS_Msk                                         (0x1UL << FLASH_CTRL_MERS_Pos)                                 /*!< 0x00000004 */
#define FLASH_CTRL_MERS                                             FLASH_CTRL_MERS_Msk
#define FLASH_CTRL_SNUM_Pos                                         (3U)
#define FLASH_CTRL_SNUM_Msk                                         (0x1FUL << FLASH_CTRL_SNUM_Pos)                                /*!< 0x000000F8 */
#define FLASH_CTRL_SNUM                                             FLASH_CTRL_SNUM_Msk
#define FLASH_CTRL_SNUM_0                                           (0x01UL << FLASH_CTRL_SNUM_Pos)                                /*!< 0x00000008 */
#define FLASH_CTRL_SNUM_1                                           (0x02UL << FLASH_CTRL_SNUM_Pos)                                /*!< 0x00000010 */
#define FLASH_CTRL_SNUM_2                                           (0x04UL << FLASH_CTRL_SNUM_Pos)                                /*!< 0x00000020 */
#define FLASH_CTRL_SNUM_3                                           (0x08UL << FLASH_CTRL_SNUM_Pos)                                /*!< 0x00000040 */
#define FLASH_CTRL_SNUM_4                                           (0x10UL << FLASH_CTRL_SNUM_Pos)                                /*!< 0x00000080 */
#define FLASH_CTRL_PGSIZE_Pos                                       (8U)
#define FLASH_CTRL_PGSIZE_Msk                                       (0xFUL << FLASH_CTRL_PGSIZE_Pos)                               /*!< 0x00000F00 */
#define FLASH_CTRL_PGSIZE                                           FLASH_CTRL_PGSIZE_Msk
#define FLASH_CTRL_PGSIZE_0                                         (0x1UL << FLASH_CTRL_PGSIZE_Pos)                               /*!< 0x00000100 */
#define FLASH_CTRL_PGSIZE_1                                         (0x2UL << FLASH_CTRL_PGSIZE_Pos)                               /*!< 0x00000200 */
#define FLASH_CTRL_PGSIZE_2                                         (0x4UL << FLASH_CTRL_PGSIZE_Pos)                               /*!< 0x00000400 */
#define FLASH_CTRL_START_Pos                                        (16U)
#define FLASH_CTRL_START_Msk                                        (0x1UL << FLASH_CTRL_START_Pos)                                /*!< 0x00010000 */
#define FLASH_CTRL_START                                            FLASH_CTRL_START_Msk
#define FLASH_CTRL_OPCINTEN_Pos                                     (24U)
#define FLASH_CTRL_OPCINTEN_Msk                                     (0x1UL << FLASH_CTRL_OPCINTEN_Pos)                             /*!< 0x01000000 */
#define FLASH_CTRL_OPCINTEN                                         FLASH_CTRL_OPCINTEN_Msk
#define FLASH_CTRL_ERRINTEN_Pos                                     (25U)
#define FLASH_CTRL_ERRINTEN_Msk                                     (0x1UL << FLASH_CTRL_ERRINTEN_Pos)
#define FLASH_CTRL_ERRINTEN                                         FLASH_CTRL_ERRINTEN_Msk
#define FLASH_CTRL_LOCK_Pos                                         (31U)
#define FLASH_CTRL_LOCK_Msk                                         (0x1UL << FLASH_CTRL_LOCK_Pos)                                 /*!< 0x80000000 */
#define FLASH_CTRL_LOCK                                             FLASH_CTRL_LOCK_Msk

