kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f427xx.h
/*******************  Bit definition for SMC_STSINT3 register  *******************/
#define SMC_STSINT3_IREFLG_Pos                                      (0U)
#define SMC_STSINT3_IREFLG_Msk                                      (0x1UL << SMC_STSINT3_IREFLG_Pos)                              /*!< 0x00000001 */
#define SMC_STSINT3_IREFLG                                          SMC_STSINT3_IREFLG_Msk                                         /*!<Interrupt Rising Edge status                */
#define SMC_STSINT3_IHLFLG_Pos                                      (1U)
#define SMC_STSINT3_IHLFLG_Msk                                      (0x1UL << SMC_STSINT3_IHLFLG_Pos)                              /*!< 0x00000002 */
#define SMC_STSINT3_IHLFLG                                          SMC_STSINT3_IHLFLG_Msk                                         /*!<Interrupt Level status                      */
#define SMC_STSINT3_IFEFLG_Pos                                      (2U)
#define SMC_STSINT3_IFEFLG_Msk                                      (0x1UL << SMC_STSINT3_IFEFLG_Pos)                              /*!< 0x00000004 */
#define SMC_STSINT3_IFEFLG                                          SMC_STSINT3_IFEFLG_Msk                                         /*!<Interrupt Falling Edge status               */
#define SMC_STSINT3_IREDEN_Pos                                      (3U)
#define SMC_STSINT3_IREDEN_Msk                                      (0x1UL << SMC_STSINT3_IREDEN_Pos)                              /*!< 0x00000008 */
#define SMC_STSINT3_IREDEN                                          SMC_STSINT3_IREDEN_Msk                                         /*!<Interrupt Rising Edge detection Enable bit  */
#define SMC_STSINT3_IHLDEN_Pos                                      (4U)
#define SMC_STSINT3_IHLDEN_Msk                                      (0x1UL << SMC_STSINT3_IHLDEN_Pos)                              /*!< 0x00000010 */
#define SMC_STSINT3_IHLDEN                                          SMC_STSINT3_IHLDEN_Msk                                         /*!<Interrupt Level detection Enable bit        */
#define SMC_STSINT3_IFEDEN_Pos                                      (5U)
#define SMC_STSINT3_IFEDEN_Msk                                      (0x1UL << SMC_STSINT3_IFEDEN_Pos)                              /*!< 0x00000020 */
#define SMC_STSINT3_IFEDEN                                          SMC_STSINT3_IFEDEN_Msk                                         /*!<Interrupt Falling Edge detection Enable bit */
#define SMC_STSINT3_FEFLG_Pos                                       (6U)
#define SMC_STSINT3_FEFLG_Msk                                       (0x1UL << SMC_STSINT3_FEFLG_Pos)                               /*!< 0x00000040 */
#define SMC_STSINT3_FEFLG                                           SMC_STSINT3_FEFLG_Msk                                          /*!<FIFO empty */

/*******************  Bit definition for SMC_STSINT4 register  *******************/
#define SMC_STSINT4_IREFLG_Pos                                      (0U)
#define SMC_STSINT4_IREFLG_Msk                                      (0x1UL << SMC_STSINT4_IREFLG_Pos)                              /*!< 0x00000001 */
#define SMC_STSINT4_IREFLG                                          SMC_STSINT4_IREFLG_Msk                                         /*!<Interrupt Rising Edge status                 */
#define SMC_STSINT4_IHLFLG_Pos                                      (1U)
#define SMC_STSINT4_IHLFLG_Msk                                      (0x1UL << SMC_STSINT4_IHLFLG_Pos)                              /*!< 0x00000002 */
#define SMC_STSINT4_IHLFLG                                          SMC_STSINT4_IHLFLG_Msk                                         /*!<Interrupt Level status                       */
#define SMC_STSINT4_IFEFLG_Pos                                      (2U)
#define SMC_STSINT4_IFEFLG_Msk                                      (0x1UL << SMC_STSINT4_IFEFLG_Pos)                              /*!< 0x00000004 */
#define SMC_STSINT4_IFEFLG                                          SMC_STSINT4_IFEFLG_Msk                                         /*!<Interrupt Falling Edge status                */
#define SMC_STSINT4_IREDEN_Pos                                      (3U)
#define SMC_STSINT4_IREDEN_Msk                                      (0x1UL << SMC_STSINT4_IREDEN_Pos)                              /*!< 0x00000008 */
#define SMC_STSINT4_IREDEN                                          SMC_STSINT4_IREDEN_Msk                                         /*!<Interrupt Rising Edge detection Enable bit   */
#define SMC_STSINT4_IHLDEN_Pos                                      (4U)
#define SMC_STSINT4_IHLDEN_Msk                                      (0x1UL << SMC_STSINT4_IHLDEN_Pos)                              /*!< 0x00000010 */
#define SMC_STSINT4_IHLDEN                                          SMC_STSINT4_IHLDEN_Msk                                         /*!<Interrupt Level detection Enable bit         */
#define SMC_STSINT4_IFEDEN_Pos                                      (5U)
#define SMC_STSINT4_IFEDEN_Msk                                      (0x1UL << SMC_STSINT4_IFEDEN_Pos)                              /*!< 0x00000020 */
#define SMC_STSINT4_IFEDEN                                          SMC_STSINT4_IFEDEN_Msk                                         /*!<Interrupt Falling Edge detection Enable bit  */
#define SMC_STSINT4_FEFLG_Pos                                       (6U)
#define SMC_STSINT4_FEFLG_Msk                                       (0x1UL << SMC_STSINT4_FEFLG_Pos)                               /*!< 0x00000040 */
#define SMC_STSINT4_FEFLG                                           SMC_STSINT4_FEFLG_Msk                                          /*!<FIFO empty */

/******************  Bit definition for SMC_CMSTIM2 register  ******************/
#define SMC_CMSTIM2_SET2_Pos                                        (0U)
#define SMC_CMSTIM2_SET2_Msk                                        (0xFFUL << SMC_CMSTIM2_SET2_Pos)                               /*!< 0x000000FF */
#define SMC_CMSTIM2_SET2                                            SMC_CMSTIM2_SET2_Msk                                           /*!<MEMSET2[7:0] bits (Common memory 2 setup time) */
#define SMC_CMSTIM2_SET2_0                                          (0x01UL << SMC_CMSTIM2_SET2_Pos)                               /*!< 0x00000001 */
#define SMC_CMSTIM2_SET2_1                                          (0x02UL << SMC_CMSTIM2_SET2_Pos)                               /*!< 0x00000002 */
#define SMC_CMSTIM2_SET2_2                                          (0x04UL << SMC_CMSTIM2_SET2_Pos)                               /*!< 0x00000004 */
#define SMC_CMSTIM2_SET2_3                                          (0x08UL << SMC_CMSTIM2_SET2_Pos)                               /*!< 0x00000008 */
#define SMC_CMSTIM2_SET2_4                                          (0x10UL << SMC_CMSTIM2_SET2_Pos)                               /*!< 0x00000010 */
#define SMC_CMSTIM2_SET2_5                                          (0x20UL << SMC_CMSTIM2_SET2_Pos)                               /*!< 0x00000020 */
#define SMC_CMSTIM2_SET2_6                                          (0x40UL << SMC_CMSTIM2_SET2_Pos)                               /*!< 0x00000040 */
#define SMC_CMSTIM2_SET2_7                                          (0x80UL << SMC_CMSTIM2_SET2_Pos)                               /*!< 0x00000080 */

