kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f427xx.h
/********************  Bits definition for RTC_CTRL register  *******************/
#define RTC_CTRL_CALOEN_Pos                                         (23U)
#define RTC_CTRL_CALOEN_Msk                                         (0x1UL << RTC_CTRL_CALOEN_Pos)                                 /*!< 0x00800000 */
#define RTC_CTRL_CALOEN                                             RTC_CTRL_CALOEN_Msk
#define RTC_CTRL_OUTSEL_Pos                                         (21U)
#define RTC_CTRL_OUTSEL_Msk                                         (0x3UL << RTC_CTRL_OUTSEL_Pos)                                 /*!< 0x00600000 */
#define RTC_CTRL_OUTSEL                                             RTC_CTRL_OUTSEL_Msk
#define RTC_CTRL_OUTSEL_0                                           (0x1UL << RTC_CTRL_OUTSEL_Pos)                                 /*!< 0x00200000 */
#define RTC_CTRL_OUTSEL_1                                           (0x2UL << RTC_CTRL_OUTSEL_Pos)                                 /*!< 0x00400000 */
#define RTC_CTRL_POLCFG_Pos                                         (20U)
#define RTC_CTRL_POLCFG_Msk                                         (0x1UL << RTC_CTRL_POLCFG_Pos)                                 /*!< 0x00100000 */
#define RTC_CTRL_POLCFG                                             RTC_CTRL_POLCFG_Msk
#define RTC_CTRL_CALOSEL_Pos                                        (19U)
#define RTC_CTRL_CALOSEL_Msk                                        (0x1UL << RTC_CTRL_CALOSEL_Pos)                                /*!< 0x00080000 */
#define RTC_CTRL_CALOSEL                                            RTC_CTRL_CALOSEL_Msk
#define RTC_CTRL_BAKP_Pos                                           (18U)
#define RTC_CTRL_BAKP_Msk                                           (0x1UL << RTC_CTRL_BAKP_Pos)                                   /*!< 0x00040000 */
#define RTC_CTRL_BAKP                                               RTC_CTRL_BAKP_Msk
#define RTC_CTRL_WTCCFG_Pos                                         (17U)
#define RTC_CTRL_WTCCFG_Msk                                         (0x1UL << RTC_CTRL_WTCCFG_Pos)                                 /*!< 0x00020000 */
#define RTC_CTRL_WTCCFG                                             RTC_CTRL_WTCCFG_Msk
#define RTC_CTRL_STCCFG_Pos                                         (16U)
#define RTC_CTRL_STCCFG_Msk                                         (0x1UL << RTC_CTRL_STCCFG_Pos)                                 /*!< 0x00010000 */
#define RTC_CTRL_STCCFG                                             RTC_CTRL_STCCFG_Msk
#define RTC_CTRL_TSIEN_Pos                                          (15U)
#define RTC_CTRL_TSIEN_Msk                                          (0x1UL << RTC_CTRL_TSIEN_Pos)                                  /*!< 0x00008000 */
#define RTC_CTRL_TSIEN                                              RTC_CTRL_TSIEN_Msk
#define RTC_CTRL_WUTIEN_Pos                                         (14U)
#define RTC_CTRL_WUTIEN_Msk                                         (0x1UL << RTC_CTRL_WUTIEN_Pos)                                 /*!< 0x00004000 */
#define RTC_CTRL_WUTIEN                                             RTC_CTRL_WUTIEN_Msk
#define RTC_CTRL_ALRBIEN_Pos                                        (13U)
#define RTC_CTRL_ALRBIEN_Msk                                        (0x1UL << RTC_CTRL_ALRBIEN_Pos)                                /*!< 0x00002000 */
#define RTC_CTRL_ALRBIEN                                            RTC_CTRL_ALRBIEN_Msk
#define RTC_CTRL_ALRAIEN_Pos                                        (12U)
#define RTC_CTRL_ALRAIEN_Msk                                        (0x1UL << RTC_CTRL_ALRAIEN_Pos)                                /*!< 0x00001000 */
#define RTC_CTRL_ALRAIEN                                            RTC_CTRL_ALRAIEN_Msk
#define RTC_CTRL_TSEN_Pos                                           (11U)
#define RTC_CTRL_TSEN_Msk                                           (0x1UL << RTC_CTRL_TSEN_Pos)                                   /*!< 0x00000800 */
#define RTC_CTRL_TSEN                                               RTC_CTRL_TSEN_Msk
#define RTC_CTRL_WUTEN_Pos                                          (10U)
#define RTC_CTRL_WUTEN_Msk                                          (0x1UL << RTC_CTRL_WUTEN_Pos)                                  /*!< 0x00000400 */
#define RTC_CTRL_WUTEN                                              RTC_CTRL_WUTEN_Msk
#define RTC_CTRL_ALRBEN_Pos                                         (9U)
#define RTC_CTRL_ALRBEN_Msk                                         (0x1UL << RTC_CTRL_ALRBEN_Pos)                                 /*!< 0x00000200 */
#define RTC_CTRL_ALRBEN                                             RTC_CTRL_ALRBEN_Msk
#define RTC_CTRL_ALRAEN_Pos                                         (8U)
#define RTC_CTRL_ALRAEN_Msk                                         (0x1UL << RTC_CTRL_ALRAEN_Pos)                                 /*!< 0x00000100 */
#define RTC_CTRL_ALRAEN                                             RTC_CTRL_ALRAEN_Msk
#define RTC_CTRL_DCALEN_Pos                                         (7U)
#define RTC_CTRL_DCALEN_Msk                                         (0x1UL << RTC_CTRL_DCALEN_Pos)                                 /*!< 0x00000080 */
#define RTC_CTRL_DCALEN                                             RTC_CTRL_DCALEN_Msk
#define RTC_CTRL_TIMEFCFG_Pos                                       (6U)
#define RTC_CTRL_TIMEFCFG_Msk                                       (0x1UL << RTC_CTRL_TIMEFCFG_Pos)                               /*!< 0x00000040 */
#define RTC_CTRL_TIMEFCFG                                           RTC_CTRL_TIMEFCFG_Msk
#define RTC_CTRL_RCMCFG_Pos                                         (5U)
#define RTC_CTRL_RCMCFG_Msk                                         (0x1UL << RTC_CTRL_RCMCFG_Pos)                                 /*!< 0x00000020 */
#define RTC_CTRL_RCMCFG                                             RTC_CTRL_RCMCFG_Msk
#define RTC_CTRL_RCLKDEN_Pos                                        (4U)
#define RTC_CTRL_RCLKDEN_Msk                                        (0x1UL << RTC_CTRL_RCLKDEN_Pos)                                /*!< 0x00000010 */
#define RTC_CTRL_RCLKDEN                                            RTC_CTRL_RCLKDEN_Msk
#define RTC_CTRL_TSETECFG_Pos                                       (3U)
#define RTC_CTRL_TSETECFG_Msk                                       (0x1UL << RTC_CTRL_TSETECFG_Pos)                               /*!< 0x00000008 */
#define RTC_CTRL_TSETECFG                                           RTC_CTRL_TSETECFG_Msk
#define RTC_CTRL_WUCLKSEL_Pos                                       (0U)
#define RTC_CTRL_WUCLKSEL_Msk                                       (0x7UL << RTC_CTRL_WUCLKSEL_Pos)                               /*!< 0x00000007 */
#define RTC_CTRL_WUCLKSEL                                           RTC_CTRL_WUCLKSEL_Msk
#define RTC_CTRL_WUCLKSEL_0                                         (0x1UL << RTC_CTRL_WUCLKSEL_Pos)                               /*!< 0x00000001 */
#define RTC_CTRL_WUCLKSEL_1                                         (0x2UL << RTC_CTRL_WUCLKSEL_Pos)                               /*!< 0x00000002 */
#define RTC_CTRL_WUCLKSEL_2                                         (0x4UL << RTC_CTRL_WUCLKSEL_Pos)                               /*!< 0x00000004 */

