kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f427xx.h
/* Legacy defines */
#define RTC_CTRL_BCK                                                RTC_CTRL_BAKP

/********************  Bits definition for RTC_STS register  ******************/
#define RTC_STS_RCALPFLG_Pos                                        (16U)
#define RTC_STS_RCALPFLG_Msk                                        (0x1UL << RTC_STS_RCALPFLG_Pos)                                /*!< 0x00010000 */
#define RTC_STS_RCALPFLG                                            RTC_STS_RCALPFLG_Msk
#define RTC_STS_TP1FLG_Pos                                          (13U)
#define RTC_STS_TP1FLG_Msk                                          (0x1UL << RTC_STS_TP1FLG_Pos)                                  /*!< 0x00002000 */
#define RTC_STS_TP1FLG                                              RTC_STS_TP1FLG_Msk
#define RTC_STS_TSOVRFLG_Pos                                        (12U)
#define RTC_STS_TSOVRFLG_Msk                                        (0x1UL << RTC_STS_TSOVRFLG_Pos)                                /*!< 0x00001000 */
#define RTC_STS_TSOVRFLG                                            RTC_STS_TSOVRFLG_Msk
#define RTC_STS_TSFLG_Pos                                           (11U)
#define RTC_STS_TSFLG_Msk                                           (0x1UL << RTC_STS_TSFLG_Pos)                                   /*!< 0x00000800 */
#define RTC_STS_TSFLG                                               RTC_STS_TSFLG_Msk
#define RTC_STS_WUTFLG_Pos                                          (10U)
#define RTC_STS_WUTFLG_Msk                                          (0x1UL << RTC_STS_WUTFLG_Pos)                                  /*!< 0x00000400 */
#define RTC_STS_WUTFLG                                              RTC_STS_WUTFLG_Msk
#define RTC_STS_ALRBFLG_Pos                                         (9U)
#define RTC_STS_ALRBFLG_Msk                                         (0x1UL << RTC_STS_ALRBFLG_Pos)                                 /*!< 0x00000200 */
#define RTC_STS_ALRBFLG                                             RTC_STS_ALRBFLG_Msk
#define RTC_STS_ALRAFLG_Pos                                         (8U)
#define RTC_STS_ALRAFLG_Msk                                         (0x1UL << RTC_STS_ALRAFLG_Pos)                                 /*!< 0x00000100 */
#define RTC_STS_ALRAFLG                                             RTC_STS_ALRAFLG_Msk
#define RTC_STS_INITEN_Pos                                          (7U)
#define RTC_STS_INITEN_Msk                                          (0x1UL << RTC_STS_INITEN_Pos)                                  /*!< 0x00000080 */
#define RTC_STS_INITEN                                              RTC_STS_INITEN_Msk
#define RTC_STS_RINITFLG_Pos                                        (6U)
#define RTC_STS_RINITFLG_Msk                                        (0x1UL << RTC_STS_RINITFLG_Pos)                                /*!< 0x00000040 */
#define RTC_STS_RINITFLG                                            RTC_STS_RINITFLG_Msk
#define RTC_STS_RSFLG_Pos                                           (5U)
#define RTC_STS_RSFLG_Msk                                           (0x1UL << RTC_STS_RSFLG_Pos)                                   /*!< 0x00000020 */
#define RTC_STS_RSFLG                                               RTC_STS_RSFLG_Msk
#define RTC_STS_INITSFLG_Pos                                        (4U)
#define RTC_STS_INITSFLG_Msk                                        (0x1UL << RTC_STS_INITSFLG_Pos)                                /*!< 0x00000010 */
#define RTC_STS_INITSFLG                                            RTC_STS_INITSFLG_Msk
#define RTC_STS_SOPFLG_Pos                                          (3U)
#define RTC_STS_SOPFLG_Msk                                          (0x1UL << RTC_STS_SOPFLG_Pos)                                  /*!< 0x00000008 */
#define RTC_STS_SOPFLG                                              RTC_STS_SOPFLG_Msk
#define RTC_STS_WUTWFLG_Pos                                         (2U)
#define RTC_STS_WUTWFLG_Msk                                         (0x1UL << RTC_STS_WUTWFLG_Pos)                                 /*!< 0x00000004 */
#define RTC_STS_WUTWFLG                                             RTC_STS_WUTWFLG_Msk
#define RTC_STS_ALRBWFLG_Pos                                        (1U)
#define RTC_STS_ALRBWFLG_Msk                                        (0x1UL << RTC_STS_ALRBWFLG_Pos)                                /*!< 0x00000002 */
#define RTC_STS_ALRBWFLG                                            RTC_STS_ALRBWFLG_Msk
#define RTC_STS_ALRAWFLG_Pos                                        (0U)
#define RTC_STS_ALRAWFLG_Msk                                        (0x1UL << RTC_STS_ALRAWFLG_Pos)                                /*!< 0x00000001 */
#define RTC_STS_ALRAWFLG                                            RTC_STS_ALRAWFLG_Msk

/********************  Bits definition for RTC_PSC register  *****************/
#define RTC_PSC_APSC_Pos                                            (16U)
#define RTC_PSC_APSC_Msk                                            (0x7FUL << RTC_PSC_APSC_Pos)                                   /*!< 0x007F0000 */
#define RTC_PSC_APSC                                                RTC_PSC_APSC_Msk
#define RTC_PSC_SPSC_Pos                                            (0U)
#define RTC_PSC_SPSC_Msk                                            (0x7FFFUL << RTC_PSC_SPSC_Pos)                                 /*!< 0x00007FFF */
#define RTC_PSC_SPSC                                                RTC_PSC_SPSC_Msk

/********************  Bits definition for RTC_AUTORLD register  *****************/
#define RTC_AUTORLD_WUAUTORE_Pos                                    (0U)
#define RTC_AUTORLD_WUAUTORE_Msk                                    (0xFFFFUL << RTC_AUTORLD_WUAUTORE_Pos)                         /*!< 0x0000FFFF */
#define RTC_AUTORLD_WUAUTORE                                        RTC_AUTORLD_WUAUTORE_Msk

/********************  Bits definition for RTC_DCAL register  ***************/
#define RTC_DCAL_DCALCFG_Pos                                        (7U)
#define RTC_DCAL_DCALCFG_Msk                                        (0x1UL << RTC_DCAL_DCALCFG_Pos)                                /*!< 0x00000080 */
#define RTC_DCAL_DCALCFG                                            RTC_DCAL_DCALCFG_Msk
#define RTC_DCAL_DCAL_Pos                                           (0U)
#define RTC_DCAL_DCAL_Msk                                           (0x1FUL << RTC_DCAL_DCAL_Pos)                                  /*!< 0x0000001F */
#define RTC_DCAL_DCAL                                               RTC_DCAL_DCAL_Msk

/********************  Bits definition for RTC_ALRMA register  ***************/
#define RTC_ALRMA_DATEMEN_Pos                                       (31U)
#define RTC_ALRMA_DATEMEN_Msk                                       (0x1UL << RTC_ALRMA_DATEMEN_Pos)                               /*!< 0x80000000 */
#define RTC_ALRMA_DATEMEN                                           RTC_ALRMA_DATEMEN_Msk
#define RTC_ALRMA_WEEKSEL_Pos                                       (30U)
#define RTC_ALRMA_WEEKSEL_Msk                                       (0x1UL << RTC_ALRMA_WEEKSEL_Pos)                               /*!< 0x40000000 */
#define RTC_ALRMA_WEEKSEL                                           RTC_ALRMA_WEEKSEL_Msk
#define RTC_ALRMA_DAYT_Pos                                          (28U)
#define RTC_ALRMA_DAYT_Msk                                          (0x3UL << RTC_ALRMA_DAYT_Pos)                                  /*!< 0x30000000 */
#define RTC_ALRMA_DAYT                                              RTC_ALRMA_DAYT_Msk
#define RTC_ALRMA_DAYT_0                                            (0x1UL << RTC_ALRMA_DAYT_Pos)                                  /*!< 0x10000000 */
#define RTC_ALRMA_DAYT_1                                            (0x2UL << RTC_ALRMA_DAYT_Pos)                                  /*!< 0x20000000 */
#define RTC_ALRMA_DAYU_Pos                                          (24U)
#define RTC_ALRMA_DAYU_Msk                                          (0xFUL << RTC_ALRMA_DAYU_Pos)                                  /*!< 0x0F000000 */
#define RTC_ALRMA_DAYU                                              RTC_ALRMA_DAYU_Msk
#define RTC_ALRMA_DAYU_0                                            (0x1UL << RTC_ALRMA_DAYU_Pos)                                  /*!< 0x01000000 */
#define RTC_ALRMA_DAYU_1                                            (0x2UL << RTC_ALRMA_DAYU_Pos)                                  /*!< 0x02000000 */
#define RTC_ALRMA_DAYU_2                                            (0x4UL << RTC_ALRMA_DAYU_Pos)                                  /*!< 0x04000000 */
#define RTC_ALRMA_DAYU_3                                            (0x8UL << RTC_ALRMA_DAYU_Pos)                                  /*!< 0x08000000 */
#define RTC_ALRMA_HRMEN_Pos                                         (23U)
#define RTC_ALRMA_HRMEN_Msk                                         (0x1UL << RTC_ALRMA_HRMEN_Pos)                                 /*!< 0x00800000 */
#define RTC_ALRMA_HRMEN                                             RTC_ALRMA_HRMEN_Msk
#define RTC_ALRMA_TIMEFCFG_Pos                                      (22U)
#define RTC_ALRMA_TIMEFCFG_Msk                                      (0x1UL << RTC_ALRMA_TIMEFCFG_Pos)                              /*!< 0x00400000 */
#define RTC_ALRMA_TIMEFCFG                                          RTC_ALRMA_TIMEFCFG_Msk
#define RTC_ALRMA_HRT_Pos                                           (20U)
#define RTC_ALRMA_HRT_Msk                                           (0x3UL << RTC_ALRMA_HRT_Pos)                                   /*!< 0x00300000 */
#define RTC_ALRMA_HRT                                               RTC_ALRMA_HRT_Msk
#define RTC_ALRMA_HRT_0                                             (0x1UL << RTC_ALRMA_HRT_Pos)                                   /*!< 0x00100000 */
#define RTC_ALRMA_HRT_1                                             (0x2UL << RTC_ALRMA_HRT_Pos)                                   /*!< 0x00200000 */
#define RTC_ALRMA_HRU_Pos                                           (16U)
#define RTC_ALRMA_HRU_Msk                                           (0xFUL << RTC_ALRMA_HRU_Pos)                                   /*!< 0x000F0000 */
#define RTC_ALRMA_HRU                                               RTC_ALRMA_HRU_Msk
#define RTC_ALRMA_HRU_0                                             (0x1UL << RTC_ALRMA_HRU_Pos)                                   /*!< 0x00010000 */
#define RTC_ALRMA_HRU_1                                             (0x2UL << RTC_ALRMA_HRU_Pos)                                   /*!< 0x00020000 */
#define RTC_ALRMA_HRU_2                                             (0x4UL << RTC_ALRMA_HRU_Pos)                                   /*!< 0x00040000 */
#define RTC_ALRMA_HRU_3                                             (0x8UL << RTC_ALRMA_HRU_Pos)                                   /*!< 0x00080000 */
#define RTC_ALRMA_MINMEN_Pos                                        (15U)
#define RTC_ALRMA_MINMEN_Msk                                        (0x1UL << RTC_ALRMA_MINMEN_Pos)                                /*!< 0x00008000 */
#define RTC_ALRMA_MINMEN                                            RTC_ALRMA_MINMEN_Msk
#define RTC_ALRMA_MINT_Pos                                          (12U)
#define RTC_ALRMA_MINT_Msk                                          (0x7UL << RTC_ALRMA_MINT_Pos)                                  /*!< 0x00007000 */
#define RTC_ALRMA_MINT                                              RTC_ALRMA_MINT_Msk
#define RTC_ALRMA_MINT_0                                            (0x1UL << RTC_ALRMA_MINT_Pos)                                  /*!< 0x00001000 */
#define RTC_ALRMA_MINT_1                                            (0x2UL << RTC_ALRMA_MINT_Pos)                                  /*!< 0x00002000 */
#define RTC_ALRMA_MINT_2                                            (0x4UL << RTC_ALRMA_MINT_Pos)                                  /*!< 0x00004000 */
#define RTC_ALRMA_MINU_Pos                                          (8U)
#define RTC_ALRMA_MINU_Msk                                          (0xFUL << RTC_ALRMA_MINU_Pos)                                  /*!< 0x00000F00 */
#define RTC_ALRMA_MINU                                              RTC_ALRMA_MINU_Msk
#define RTC_ALRMA_MINU_0                                            (0x1UL << RTC_ALRMA_MINU_Pos)                                  /*!< 0x00000100 */
#define RTC_ALRMA_MINU_1                                            (0x2UL << RTC_ALRMA_MINU_Pos)                                  /*!< 0x00000200 */
#define RTC_ALRMA_MINU_2                                            (0x4UL << RTC_ALRMA_MINU_Pos)                                  /*!< 0x00000400 */
#define RTC_ALRMA_MINU_3                                            (0x8UL << RTC_ALRMA_MINU_Pos)                                  /*!< 0x00000800 */
#define RTC_ALRMA_SECMEN_Pos                                        (7U)
#define RTC_ALRMA_SECMEN_Msk                                        (0x1UL << RTC_ALRMA_SECMEN_Pos)                                /*!< 0x00000080 */
#define RTC_ALRMA_SECMEN                                            RTC_ALRMA_SECMEN_Msk
#define RTC_ALRMA_SECT_Pos                                          (4U)
#define RTC_ALRMA_SECT_Msk                                          (0x7UL << RTC_ALRMA_SECT_Pos)                                  /*!< 0x00000070 */
#define RTC_ALRMA_SECT                                              RTC_ALRMA_SECT_Msk
#define RTC_ALRMA_SECT_0                                            (0x1UL << RTC_ALRMA_SECT_Pos)                                  /*!< 0x00000010 */
#define RTC_ALRMA_SECT_1                                            (0x2UL << RTC_ALRMA_SECT_Pos)                                  /*!< 0x00000020 */
#define RTC_ALRMA_SECT_2                                            (0x4UL << RTC_ALRMA_SECT_Pos)                                  /*!< 0x00000040 */
#define RTC_ALRMA_SECU_Pos                                          (0U)
#define RTC_ALRMA_SECU_Msk                                          (0xFUL << RTC_ALRMA_SECU_Pos)                                  /*!< 0x0000000F */
#define RTC_ALRMA_SECU                                              RTC_ALRMA_SECU_Msk
#define RTC_ALRMA_SECU_0                                            (0x1UL << RTC_ALRMA_SECU_Pos)                                  /*!< 0x00000001 */
#define RTC_ALRMA_SECU_1                                            (0x2UL << RTC_ALRMA_SECU_Pos)                                  /*!< 0x00000002 */
#define RTC_ALRMA_SECU_2                                            (0x4UL << RTC_ALRMA_SECU_Pos)                                  /*!< 0x00000004 */
#define RTC_ALRMA_SECU_3                                            (0x8UL << RTC_ALRMA_SECU_Pos)                                  /*!< 0x00000008 */

/********************  Bits definition for RTC_ALRMB register  ***************/
#define RTC_ALRMB_DATEMEN_Pos                                       (31U)
#define RTC_ALRMB_DATEMEN_Msk                                       (0x1UL << RTC_ALRMB_DATEMEN_Pos)                               /*!< 0x80000000 */
#define RTC_ALRMB_DATEMEN                                           RTC_ALRMB_DATEMEN_Msk
#define RTC_ALRMB_WEEKSEL_Pos                                       (30U)
#define RTC_ALRMB_WEEKSEL_Msk                                       (0x1UL << RTC_ALRMB_WEEKSEL_Pos)                               /*!< 0x40000000 */
#define RTC_ALRMB_WEEKSEL                                           RTC_ALRMB_WEEKSEL_Msk
#define RTC_ALRMB_DAYT_Pos                                          (28U)
#define RTC_ALRMB_DAYT_Msk                                          (0x3UL << RTC_ALRMB_DAYT_Pos)                                  /*!< 0x30000000 */
#define RTC_ALRMB_DAYT                                              RTC_ALRMB_DAYT_Msk
#define RTC_ALRMB_DAYT_0                                            (0x1UL << RTC_ALRMB_DAYT_Pos)                                  /*!< 0x10000000 */
#define RTC_ALRMB_DAYT_1                                            (0x2UL << RTC_ALRMB_DAYT_Pos)                                  /*!< 0x20000000 */
#define RTC_ALRMB_DAYU_Pos                                          (24U)
#define RTC_ALRMB_DAYU_Msk                                          (0xFUL << RTC_ALRMB_DAYU_Pos)                                  /*!< 0x0F000000 */
#define RTC_ALRMB_DAYU                                              RTC_ALRMB_DAYU_Msk
#define RTC_ALRMB_DAYU_0                                            (0x1UL << RTC_ALRMB_DAYU_Pos)                                  /*!< 0x01000000 */
#define RTC_ALRMB_DAYU_1                                            (0x2UL << RTC_ALRMB_DAYU_Pos)                                  /*!< 0x02000000 */
#define RTC_ALRMB_DAYU_2                                            (0x4UL << RTC_ALRMB_DAYU_Pos)                                  /*!< 0x04000000 */
#define RTC_ALRMB_DAYU_3                                            (0x8UL << RTC_ALRMB_DAYU_Pos)                                  /*!< 0x08000000 */
#define RTC_ALRMB_HRMEN_Pos                                         (23U)
#define RTC_ALRMB_HRMEN_Msk                                         (0x1UL << RTC_ALRMB_HRMEN_Pos)                                 /*!< 0x00800000 */
#define RTC_ALRMB_HRMEN                                             RTC_ALRMB_HRMEN_Msk
#define RTC_ALRMB_TIMEFCFG_Pos                                      (22U)
#define RTC_ALRMB_TIMEFCFG_Msk                                      (0x1UL << RTC_ALRMB_TIMEFCFG_Pos)                              /*!< 0x00400000 */
#define RTC_ALRMB_TIMEFCFG                                          RTC_ALRMB_TIMEFCFG_Msk
#define RTC_ALRMB_HRT_Pos                                           (20U)
#define RTC_ALRMB_HRT_Msk                                           (0x3UL << RTC_ALRMB_HRT_Pos)                                   /*!< 0x00300000 */
#define RTC_ALRMB_HRT                                               RTC_ALRMB_HRT_Msk
#define RTC_ALRMB_HRT_0                                             (0x1UL << RTC_ALRMB_HRT_Pos)                                   /*!< 0x00100000 */
#define RTC_ALRMB_HRT_1                                             (0x2UL << RTC_ALRMB_HRT_Pos)                                   /*!< 0x00200000 */
#define RTC_ALRMB_HRU_Pos                                           (16U)
#define RTC_ALRMB_HRU_Msk                                           (0xFUL << RTC_ALRMB_HRU_Pos)                                   /*!< 0x000F0000 */
#define RTC_ALRMB_HRU                                               RTC_ALRMB_HRU_Msk
#define RTC_ALRMB_HRU_0                                             (0x1UL << RTC_ALRMB_HRU_Pos)                                   /*!< 0x00010000 */
#define RTC_ALRMB_HRU_1                                             (0x2UL << RTC_ALRMB_HRU_Pos)                                   /*!< 0x00020000 */
#define RTC_ALRMB_HRU_2                                             (0x4UL << RTC_ALRMB_HRU_Pos)                                   /*!< 0x00040000 */
#define RTC_ALRMB_HRU_3                                             (0x8UL << RTC_ALRMB_HRU_Pos)                                   /*!< 0x00080000 */
#define RTC_ALRMB_MINMEN_Pos                                        (15U)
#define RTC_ALRMB_MINMEN_Msk                                        (0x1UL << RTC_ALRMB_MINMEN_Pos)                                /*!< 0x00008000 */
#define RTC_ALRMB_MINMEN                                            RTC_ALRMB_MINMEN_Msk
#define RTC_ALRMB_MINT_Pos                                          (12U)
#define RTC_ALRMB_MINT_Msk                                          (0x7UL << RTC_ALRMB_MINT_Pos)                                  /*!< 0x00007000 */
#define RTC_ALRMB_MINT                                              RTC_ALRMB_MINT_Msk
#define RTC_ALRMB_MINT_0                                            (0x1UL << RTC_ALRMB_MINT_Pos)                                  /*!< 0x00001000 */
#define RTC_ALRMB_MINT_1                                            (0x2UL << RTC_ALRMB_MINT_Pos)                                  /*!< 0x00002000 */
#define RTC_ALRMB_MINT_2                                            (0x4UL << RTC_ALRMB_MINT_Pos)                                  /*!< 0x00004000 */
#define RTC_ALRMB_MINU_Pos                                          (8U)
#define RTC_ALRMB_MINU_Msk                                          (0xFUL << RTC_ALRMB_MINU_Pos)                                  /*!< 0x00000F00 */
#define RTC_ALRMB_MINU                                              RTC_ALRMB_MINU_Msk
#define RTC_ALRMB_MINU_0                                            (0x1UL << RTC_ALRMB_MINU_Pos)                                  /*!< 0x00000100 */
#define RTC_ALRMB_MINU_1                                            (0x2UL << RTC_ALRMB_MINU_Pos)                                  /*!< 0x00000200 */
#define RTC_ALRMB_MINU_2                                            (0x4UL << RTC_ALRMB_MINU_Pos)                                  /*!< 0x00000400 */
#define RTC_ALRMB_MINU_3                                            (0x8UL << RTC_ALRMB_MINU_Pos)                                  /*!< 0x00000800 */
#define RTC_ALRMB_SECMEN_Pos                                        (7U)
#define RTC_ALRMB_SECMEN_Msk                                        (0x1UL << RTC_ALRMB_SECMEN_Pos)                                /*!< 0x00000080 */
#define RTC_ALRMB_SECMEN                                            RTC_ALRMB_SECMEN_Msk
#define RTC_ALRMB_SECT_Pos                                          (4U)
#define RTC_ALRMB_SECT_Msk                                          (0x7UL << RTC_ALRMB_SECT_Pos)                                  /*!< 0x00000070 */
#define RTC_ALRMB_SECT                                              RTC_ALRMB_SECT_Msk
#define RTC_ALRMB_SECT_0                                            (0x1UL << RTC_ALRMB_SECT_Pos)                                  /*!< 0x00000010 */
#define RTC_ALRMB_SECT_1                                            (0x2UL << RTC_ALRMB_SECT_Pos)                                  /*!< 0x00000020 */
#define RTC_ALRMB_SECT_2                                            (0x4UL << RTC_ALRMB_SECT_Pos)                                  /*!< 0x00000040 */
#define RTC_ALRMB_SECU_Pos                                          (0U)
#define RTC_ALRMB_SECU_Msk                                          (0xFUL << RTC_ALRMB_SECU_Pos)                                  /*!< 0x0000000F */
#define RTC_ALRMB_SECU                                              RTC_ALRMB_SECU_Msk
#define RTC_ALRMB_SECU_0                                            (0x1UL << RTC_ALRMB_SECU_Pos)                                  /*!< 0x00000001 */
#define RTC_ALRMB_SECU_1                                            (0x2UL << RTC_ALRMB_SECU_Pos)                                  /*!< 0x00000002 */
#define RTC_ALRMB_SECU_2                                            (0x4UL << RTC_ALRMB_SECU_Pos)                                  /*!< 0x00000004 */
#define RTC_ALRMB_SECU_3                                            (0x8UL << RTC_ALRMB_SECU_Pos)                                  /*!< 0x00000008 */

