kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f427xx.h
/********************  Bits definition for RTC_TSDATE register  *****************/
#define RTC_TSDATE_WEEKSEL_Pos                                      (13U)
#define RTC_TSDATE_WEEKSEL_Msk                                      (0x7UL << RTC_TSDATE_WEEKSEL_Pos)                              /*!< 0x0000E000 */
#define RTC_TSDATE_WEEKSEL                                          RTC_TSDATE_WEEKSEL_Msk
#define RTC_TSDATE_WEEKSEL_0                                        (0x1UL << RTC_TSDATE_WEEKSEL_Pos)                              /*!< 0x00002000 */
#define RTC_TSDATE_WEEKSEL_1                                        (0x2UL << RTC_TSDATE_WEEKSEL_Pos)                              /*!< 0x00004000 */
#define RTC_TSDATE_WEEKSEL_2                                        (0x4UL << RTC_TSDATE_WEEKSEL_Pos)                              /*!< 0x00008000 */
#define RTC_TSDATE_MONT_Pos                                         (12U)
#define RTC_TSDATE_MONT_Msk                                         (0x1UL << RTC_TSDATE_MONT_Pos)                                 /*!< 0x00001000 */
#define RTC_TSDATE_MONT                                             RTC_TSDATE_MONT_Msk
#define RTC_TSDATE_MONU_Pos                                         (8U)
#define RTC_TSDATE_MONU_Msk                                         (0xFUL << RTC_TSDATE_MONU_Pos)                                 /*!< 0x00000F00 */
#define RTC_TSDATE_MONU                                             RTC_TSDATE_MONU_Msk
#define RTC_TSDATE_MONU_0                                           (0x1UL << RTC_TSDATE_MONU_Pos)                                 /*!< 0x00000100 */
#define RTC_TSDATE_MONU_1                                           (0x2UL << RTC_TSDATE_MONU_Pos)                                 /*!< 0x00000200 */
#define RTC_TSDATE_MONU_2                                           (0x4UL << RTC_TSDATE_MONU_Pos)                                 /*!< 0x00000400 */
#define RTC_TSDATE_MONU_3                                           (0x8UL << RTC_TSDATE_MONU_Pos)                                 /*!< 0x00000800 */
#define RTC_TSDATE_DAYT_Pos                                         (4U)
#define RTC_TSDATE_DAYT_Msk                                         (0x3UL << RTC_TSDATE_DAYT_Pos)                                 /*!< 0x00000030 */
#define RTC_TSDATE_DAYT                                             RTC_TSDATE_DAYT_Msk
#define RTC_TSDATE_DAYT_0                                           (0x1UL << RTC_TSDATE_DAYT_Pos)                                 /*!< 0x00000010 */
#define RTC_TSDATE_DAYT_1                                           (0x2UL << RTC_TSDATE_DAYT_Pos)                                 /*!< 0x00000020 */
#define RTC_TSDATE_DAYU_Pos                                         (0U)
#define RTC_TSDATE_DAYU_Msk                                         (0xFUL << RTC_TSDATE_DAYU_Pos)                                 /*!< 0x0000000F */
#define RTC_TSDATE_DAYU                                             RTC_TSDATE_DAYU_Msk
#define RTC_TSDATE_DAYU_0                                           (0x1UL << RTC_TSDATE_DAYU_Pos)                                 /*!< 0x00000001 */
#define RTC_TSDATE_DAYU_1                                           (0x2UL << RTC_TSDATE_DAYU_Pos)                                 /*!< 0x00000002 */
#define RTC_TSDATE_DAYU_2                                           (0x4UL << RTC_TSDATE_DAYU_Pos)                                 /*!< 0x00000004 */
#define RTC_TSDATE_DAYU_3                                           (0x8UL << RTC_TSDATE_DAYU_Pos)                                 /*!< 0x00000008 */

/********************  Bits definition for RTC_TSSUBSEC register  ****************/
#define RTC_TSSUBSEC_SUBSE_Pos                                      (0U)
#define RTC_TSSUBSEC_SUBSE_Msk                                      (0xFFFFUL << RTC_TSSUBSEC_SUBSE_Pos)                           /*!< 0x0000FFFF */
#define RTC_TSSUBSEC_SUBSE                                          RTC_TSSUBSEC_SUBSE_Msk

/********************  Bits definition for RTC_CAL register  *****************/
#define RTC_CAL_ICALFEN_Pos                                         (15U)
#define RTC_CAL_ICALFEN_Msk                                         (0x1UL << RTC_CAL_ICALFEN_Pos)                                 /*!< 0x00008000 */
#define RTC_CAL_ICALFEN                                             RTC_CAL_ICALFEN_Msk
#define RTC_CAL_CAL8CFG_Pos                                         (14U)
#define RTC_CAL_CAL8CFG_Msk                                         (0x1UL << RTC_CAL_CAL8CFG_Pos)                                 /*!< 0x00004000 */
#define RTC_CAL_CAL8CFG                                             RTC_CAL_CAL8CFG_Msk
#define RTC_CAL_CAL16CFG_Pos                                        (13U)
#define RTC_CAL_CAL16CFG_Msk                                        (0x1UL << RTC_CAL_CAL16CFG_Pos)                                /*!< 0x00002000 */
#define RTC_CAL_CAL16CFG                                            RTC_CAL_CAL16CFG_Msk
#define RTC_CAL_RECALF_Pos                                          (0U)
#define RTC_CAL_RECALF_Msk                                          (0x1FFUL << RTC_CAL_RECALF_Pos)                                /*!< 0x000001FF */
#define RTC_CAL_RECALF                                              RTC_CAL_RECALF_Msk
#define RTC_CAL_RECALF_0                                            (0x001UL << RTC_CAL_RECALF_Pos)                                /*!< 0x00000001 */
#define RTC_CAL_RECALF_1                                            (0x002UL << RTC_CAL_RECALF_Pos)                                /*!< 0x00000002 */
#define RTC_CAL_RECALF_2                                            (0x004UL << RTC_CAL_RECALF_Pos)                                /*!< 0x00000004 */
#define RTC_CAL_RECALF_3                                            (0x008UL << RTC_CAL_RECALF_Pos)                                /*!< 0x00000008 */
#define RTC_CAL_RECALF_4                                            (0x010UL << RTC_CAL_RECALF_Pos)                                /*!< 0x00000010 */
#define RTC_CAL_RECALF_5                                            (0x020UL << RTC_CAL_RECALF_Pos)                                /*!< 0x00000020 */
#define RTC_CAL_RECALF_6                                            (0x040UL << RTC_CAL_RECALF_Pos)                                /*!< 0x00000040 */
#define RTC_CAL_RECALF_7                                            (0x080UL << RTC_CAL_RECALF_Pos)                                /*!< 0x00000080 */
#define RTC_CAL_RECALF_8                                            (0x100UL << RTC_CAL_RECALF_Pos)                                /*!< 0x00000100 */

/********************  Bits definition for RTC_TACFG register  ****************/
#define RTC_TACFG_ALRMOT_Pos                                        (18U)
#define RTC_TACFG_ALRMOT_Msk                                        (0x1UL << RTC_TACFG_ALRMOT_Pos)                                /*!< 0x00040000 */
#define RTC_TACFG_ALRMOT                                            RTC_TACFG_ALRMOT_Msk
#define RTC_TACFG_TSMSEL_Pos                                        (17U)
#define RTC_TACFG_TSMSEL_Msk                                        (0x1UL << RTC_TACFG_TSMSEL_Pos)                                /*!< 0x00020000 */
#define RTC_TACFG_TSMSEL                                            RTC_TACFG_TSMSEL_Msk
#define RTC_TACFG_TP1MSEL_Pos                                       (16U)
#define RTC_TACFG_TP1MSEL_Msk                                       (0x1UL << RTC_TACFG_TP1MSEL_Pos)                               /*!< 0x00010000 */
#define RTC_TACFG_TP1MSEL                                           RTC_TACFG_TP1MSEL_Msk
#define RTC_TACFG_TPPUDIS_Pos                                       (15U)
#define RTC_TACFG_TPPUDIS_Msk                                       (0x1UL << RTC_TACFG_TPPUDIS_Pos)                               /*!< 0x00008000 */
#define RTC_TACFG_TPPUDIS                                           RTC_TACFG_TPPUDIS_Msk
#define RTC_TACFG_TPPRDUSEL_Pos                                     (13U)
#define RTC_TACFG_TPPRDUSEL_Msk                                     (0x3UL << RTC_TACFG_TPPRDUSEL_Pos)                             /*!< 0x00006000 */
#define RTC_TACFG_TPPRDUSEL                                         RTC_TACFG_TPPRDUSEL_Msk
#define RTC_TACFG_TPPRDUSEL_0                                       (0x1UL << RTC_TACFG_TPPRDUSEL_Pos)                             /*!< 0x00002000 */
#define RTC_TACFG_TPPRDUSEL_1                                       (0x2UL << RTC_TACFG_TPPRDUSEL_Pos)                             /*!< 0x00004000 */
#define RTC_TACFG_TPFCSEL_Pos                                       (11U)
#define RTC_TACFG_TPFCSEL_Msk                                       (0x3UL << RTC_TACFG_TPFCSEL_Pos)                               /*!< 0x00001800 */
#define RTC_TACFG_TPFCSEL                                           RTC_TACFG_TPFCSEL_Msk
#define RTC_TACFG_TPFCSEL_0                                         (0x1UL << RTC_TACFG_TPFCSEL_Pos)                               /*!< 0x00000800 */
#define RTC_TACFG_TPFCSEL_1                                         (0x2UL << RTC_TACFG_TPFCSEL_Pos)                               /*!< 0x00001000 */
#define RTC_TACFG_TPSFSEL_Pos                                       (8U)
#define RTC_TACFG_TPSFSEL_Msk                                       (0x7UL << RTC_TACFG_TPSFSEL_Pos)                               /*!< 0x00000700 */
#define RTC_TACFG_TPSFSEL                                           RTC_TACFG_TPSFSEL_Msk
#define RTC_TACFG_TPSFSEL_0                                         (0x1UL << RTC_TACFG_TPSFSEL_Pos)                               /*!< 0x00000100 */
#define RTC_TACFG_TPSFSEL_1                                         (0x2UL << RTC_TACFG_TPSFSEL_Pos)                               /*!< 0x00000200 */
#define RTC_TACFG_TPSFSEL_2                                         (0x4UL << RTC_TACFG_TPSFSEL_Pos)                               /*!< 0x00000400 */
#define RTC_TACFG_TPTSEN_Pos                                        (7U)
#define RTC_TACFG_TPTSEN_Msk                                        (0x1UL << RTC_TACFG_TPTSEN_Pos)                                /*!< 0x00000080 */
#define RTC_TACFG_TPTSEN                                            RTC_TACFG_TPTSEN_Msk
#define RTC_TACFG_TPIEN_Pos                                         (2U)
#define RTC_TACFG_TPIEN_Msk                                         (0x1UL << RTC_TACFG_TPIEN_Pos)                                 /*!< 0x00000004 */
#define RTC_TACFG_TPIEN                                             RTC_TACFG_TPIEN_Msk
#define RTC_TACFG_TP1ALCFG_Pos                                      (1U)
#define RTC_TACFG_TP1ALCFG_Msk                                      (0x1UL << RTC_TACFG_TP1ALCFG_Pos)                              /*!< 0x00000002 */
#define RTC_TACFG_TP1ALCFG                                          RTC_TACFG_TP1ALCFG_Msk
#define RTC_TACFG_TP1EN_Pos                                         (0U)
#define RTC_TACFG_TP1EN_Msk                                         (0x1UL << RTC_TACFG_TP1EN_Pos)                                 /*!< 0x00000001 */
#define RTC_TACFG_TP1EN                                             RTC_TACFG_TP1EN_Msk

