kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f427xx.h
/*******************  Bit definition for TMR_CNT register  ********************/
#define TMR_CNT_CNT_Pos                                             (0U)
#define TMR_CNT_CNT_Msk                                             (0xFFFFFFFFUL << TMR_CNT_CNT_Pos)                              /*!< 0xFFFFFFFF */
#define TMR_CNT_CNT                                                 TMR_CNT_CNT_Msk                                                /*!<Counter Value            */

/*******************  Bit definition for TMR_PSC register  ********************/
#define TMR_PSC_PSC_Pos                                             (0U)
#define TMR_PSC_PSC_Msk                                             (0xFFFFUL << TMR_PSC_PSC_Pos)                                  /*!< 0x0000FFFF */
#define TMR_PSC_PSC                                                 TMR_PSC_PSC_Msk                                                /*!<Prescaler Value          */

/*******************  Bit definition for TMR_AUTORLD register  ********************/
#define TMR_AUTORLD_AUTORLD_Pos                                     (0U)
#define TMR_AUTORLD_AUTORLD_Msk                                     (0xFFFFFFFFUL << TMR_AUTORLD_AUTORLD_Pos)                      /*!< 0xFFFFFFFF */
#define TMR_AUTORLD_AUTORLD                                         TMR_AUTORLD_AUTORLD_Msk                                        /*!<actual auto-reload Value */

/*******************  Bit definition for TMR_REPCNT register  ********************/
#define TMR_REPCNT_REPCNT_Pos                                       (0U)
#define TMR_REPCNT_REPCNT_Msk                                       (0xFFUL << TMR_REPCNT_REPCNT_Pos)                              /*!< 0x000000FF */
#define TMR_REPCNT_REPCNT                                           TMR_REPCNT_REPCNT_Msk                                          /*!<Repetition Counter Value */

/*******************  Bit definition for TMR_CC1 register  *******************/
#define TMR_CC1_CC1_Pos                                             (0U)
#define TMR_CC1_CC1_Msk                                             (0xFFFFUL << TMR_CC1_CC1_Pos)                                  /*!< 0x0000FFFF */
#define TMR_CC1_CC1                                                 TMR_CC1_CC1_Msk                                                /*!<Capture/Compare 1 Value  */

/*******************  Bit definition for TMR_CC2 register  *******************/
#define TMR_CC2_CC2_Pos                                             (0U)
#define TMR_CC2_CC2_Msk                                             (0xFFFFUL << TMR_CC2_CC2_Pos)                                  /*!< 0x0000FFFF */
#define TMR_CC2_CC2                                                 TMR_CC2_CC2_Msk                                                /*!<Capture/Compare 2 Value  */

/*******************  Bit definition for TMR_CC3 register  *******************/
#define TMR_CC3_CC3_Pos                                             (0U)
#define TMR_CC3_CC3_Msk                                             (0xFFFFUL << TMR_CC3_CC3_Pos)                                  /*!< 0x0000FFFF */
#define TMR_CC3_CC3                                                 TMR_CC3_CC3_Msk                                                /*!<Capture/Compare 3 Value  */

/*******************  Bit definition for TMR_CC4 register  *******************/
#define TMR_CC4_CC4_Pos                                             (0U)
#define TMR_CC4_CC4_Msk                                             (0xFFFFUL << TMR_CC4_CC4_Pos)                                  /*!< 0x0000FFFF */
#define TMR_CC4_CC4                                                 TMR_CC4_CC4_Msk                                                /*!<Capture/Compare 4 Value  */

/*******************  Bit definition for TMR_BDT register  *******************/
#define TMR_BDT_DTS_Pos                                             (0U)
#define TMR_BDT_DTS_Msk                                             (0xFFUL << TMR_BDT_DTS_Pos)                                    /*!< 0x000000FF */
#define TMR_BDT_DTS                                                 TMR_BDT_DTS_Msk                                                /*!<DTG[0:7] bits (Dead-Time Generator set-up) */
#define TMR_BDT_DTS_0                                               (0x01UL << TMR_BDT_DTS_Pos)                                    /*!< 0x0001 */
#define TMR_BDT_DTS_1                                               (0x02UL << TMR_BDT_DTS_Pos)                                    /*!< 0x0002 */
#define TMR_BDT_DTS_2                                               (0x04UL << TMR_BDT_DTS_Pos)                                    /*!< 0x0004 */
#define TMR_BDT_DTS_3                                               (0x08UL << TMR_BDT_DTS_Pos)                                    /*!< 0x0008 */
#define TMR_BDT_DTS_4                                               (0x10UL << TMR_BDT_DTS_Pos)                                    /*!< 0x0010 */
#define TMR_BDT_DTS_5                                               (0x20UL << TMR_BDT_DTS_Pos)                                    /*!< 0x0020 */
#define TMR_BDT_DTS_6                                               (0x40UL << TMR_BDT_DTS_Pos)                                    /*!< 0x0040 */
#define TMR_BDT_DTS_7                                               (0x80UL << TMR_BDT_DTS_Pos)                                    /*!< 0x0080 */

#define TMR_BDT_LOCKCFG_Pos                                         (8U)
#define TMR_BDT_LOCKCFG_Msk                                         (0x3UL << TMR_BDT_LOCKCFG_Pos)                                 /*!< 0x00000300 */
#define TMR_BDT_LOCKCFG                                             TMR_BDT_LOCKCFG_Msk                                            /*!<LOCK[1:0] bits (Lock Configuration) */
#define TMR_BDT_LOCKCFG_0                                           (0x1UL << TMR_BDT_LOCKCFG_Pos)                                 /*!< 0x0100 */
#define TMR_BDT_LOCKCFG_1                                           (0x2UL << TMR_BDT_LOCKCFG_Pos)                                 /*!< 0x0200 */

#define TMR_BDT_IMOS_Pos                                            (10U)
#define TMR_BDT_IMOS_Msk                                            (0x1UL << TMR_BDT_IMOS_Pos)                                    /*!< 0x00000400 */
#define TMR_BDT_IMOS                                                TMR_BDT_IMOS_Msk                                               /*!<Off-State Selection for Idle mode */
#define TMR_BDT_RMOS_Pos                                            (11U)
#define TMR_BDT_RMOS_Msk                                            (0x1UL << TMR_BDT_RMOS_Pos)                                    /*!< 0x00000800 */
#define TMR_BDT_RMOS                                                TMR_BDT_RMOS_Msk                                               /*!<Off-State Selection for Run mode  */
#define TMR_BDT_BRKEN_Pos                                           (12U)
#define TMR_BDT_BRKEN_Msk                                           (0x1UL << TMR_BDT_BRKEN_Pos)                                   /*!< 0x00001000 */
#define TMR_BDT_BRKEN                                               TMR_BDT_BRKEN_Msk                                              /*!<Break enable                      */
#define TMR_BDT_BRKPOL_Pos                                          (13U)
#define TMR_BDT_BRKPOL_Msk                                          (0x1UL << TMR_BDT_BRKPOL_Pos)                                  /*!< 0x00002000 */
#define TMR_BDT_BRKPOL                                              TMR_BDT_BRKPOL_Msk                                             /*!<Break Polarity                    */
#define TMR_BDT_AOEN_Pos                                            (14U)
#define TMR_BDT_AOEN_Msk                                            (0x1UL << TMR_BDT_AOEN_Pos)                                    /*!< 0x00004000 */
#define TMR_BDT_AOEN                                                TMR_BDT_AOEN_Msk                                               /*!<Automatic Output enable           */
#define TMR_BDT_MOEN_Pos                                            (15U)
#define TMR_BDT_MOEN_Msk                                            (0x1UL << TMR_BDT_MOEN_Pos)                                    /*!< 0x00008000 */
#define TMR_BDT_MOEN                                                TMR_BDT_MOEN_Msk                                               /*!<Main Output enable                */

/*******************  Bit definition for TMR_DCTRL register  ********************/
#define TMR_DCTRL_DBADDR_Pos                                        (0U)
#define TMR_DCTRL_DBADDR_Msk                                        (0x1FUL << TMR_DCTRL_DBADDR_Pos)                               /*!< 0x0000001F */
#define TMR_DCTRL_DBADDR                                            TMR_DCTRL_DBADDR_Msk                                           /*!<DBA[4:0] bits (DMA Base Address) */
#define TMR_DCTRL_DBADDR_0                                          (0x01UL << TMR_DCTRL_DBADDR_Pos)                               /*!< 0x0001 */
#define TMR_DCTRL_DBADDR_1                                          (0x02UL << TMR_DCTRL_DBADDR_Pos)                               /*!< 0x0002 */
#define TMR_DCTRL_DBADDR_2                                          (0x04UL << TMR_DCTRL_DBADDR_Pos)                               /*!< 0x0004 */
#define TMR_DCTRL_DBADDR_3                                          (0x08UL << TMR_DCTRL_DBADDR_Pos)                               /*!< 0x0008 */
#define TMR_DCTRL_DBADDR_4                                          (0x10UL << TMR_DCTRL_DBADDR_Pos)                               /*!< 0x0010 */

#define TMR_DCTRL_DBLEN_Pos                                         (8U)
#define TMR_DCTRL_DBLEN_Msk                                         (0x1FUL << TMR_DCTRL_DBLEN_Pos)                                /*!< 0x00001F00 */
#define TMR_DCTRL_DBLEN                                             TMR_DCTRL_DBLEN_Msk                                            /*!<DBL[4:0] bits (DMA Burst Length) */
#define TMR_DCTRL_DBLEN_0                                           (0x01UL << TMR_DCTRL_DBLEN_Pos)                                /*!< 0x0100 */
#define TMR_DCTRL_DBLEN_1                                           (0x02UL << TMR_DCTRL_DBLEN_Pos)                                /*!< 0x0200 */
#define TMR_DCTRL_DBLEN_2                                           (0x04UL << TMR_DCTRL_DBLEN_Pos)                                /*!< 0x0400 */
#define TMR_DCTRL_DBLEN_3                                           (0x08UL << TMR_DCTRL_DBLEN_Pos)                                /*!< 0x0800 */
#define TMR_DCTRL_DBLEN_4                                           (0x10UL << TMR_DCTRL_DBLEN_Pos)                                /*!< 0x1000 */

/*******************  Bit definition for TMR_DMADDR register  *******************/
#define TMR_DMADDR_DMADDR_Pos                                       (0U)
#define TMR_DMADDR_DMADDR_Msk                                       (0xFFFFUL << TMR_DMADDR_DMADDR_Pos)                            /*!< 0x0000FFFF */
#define TMR_DMADDR_DMADDR                                           TMR_DMADDR_DMADDR_Msk                                          /*!<DMA register for burst accesses                    */

/*******************  Bit definition for TMR_OR register  *********************/
#define TMR_OPT_TI1_RMPSEL_Pos                                       (0U)
#define TMR_OPT_TI1_RMPSEL_Msk                                       (0x3UL << TMR_OPT_TI1_RMPSEL_Pos)                               /*!< 0x00000003 */
#define TMR_OPT_TI1_RMPSEL                                           TMR_OPT_TI1_RMPSEL_Msk                                          /*!< TI1_RMP[1:0] bits (TMR11 Input Capture 1 remap) */
#define TMR_OPT_TI1_RMPSEL_0                                         (0x1UL << TMR_OPT_TI1_RMPSEL_Pos)                               /*!< 0x00000001 */
#define TMR_OPT_TI1_RMPSEL_1                                         (0x2UL << TMR_OPT_TI1_RMPSEL_Pos)                               /*!< 0x00000002 */

