kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f427xx.h
/********************  Bit definition for DBGMCU_APB2_FZ register  ************/
#define DBGMCU_APB2F_TMR1_STS_Pos                                   (0U)
#define DBGMCU_APB2F_TMR1_STS_Msk                                   (0x1UL << DBGMCU_APB2F_TMR1_STS_Pos)                           /*!< 0x00000001 */
#define DBGMCU_APB2F_TMR1_STS                                       DBGMCU_APB2F_TMR1_STS_Msk
#define DBGMCU_APB2F_TMR8_STS_Pos                                   (1U)
#define DBGMCU_APB2F_TMR8_STS_Msk                                   (0x1UL << DBGMCU_APB2F_TMR8_STS_Pos)                           /*!< 0x00000002 */
#define DBGMCU_APB2F_TMR8_STS                                       DBGMCU_APB2F_TMR8_STS_Msk
#define DBGMCU_APB2F_TMR9_STS_Pos                                   (16U)
#define DBGMCU_APB2F_TMR9_STS_Msk                                   (0x1UL << DBGMCU_APB2F_TMR9_STS_Pos)                           /*!< 0x00010000 */
#define DBGMCU_APB2F_TMR9_STS                                       DBGMCU_APB2F_TMR9_STS_Msk
#define DBGMCU_APB2F_TMR10_STS_Pos                                  (17U)
#define DBGMCU_APB2F_TMR10_STS_Msk                                  (0x1UL << DBGMCU_APB2F_TMR10_STS_Pos)                          /*!< 0x00020000 */
#define DBGMCU_APB2F_TMR10_STS                                      DBGMCU_APB2F_TMR10_STS_Msk
#define DBGMCU_APB2F_TMR11_STS_Pos                                  (18U)
#define DBGMCU_APB2F_TMR11_STS_Msk                                  (0x1UL << DBGMCU_APB2F_TMR11_STS_Pos)                          /*!< 0x00040000 */
#define DBGMCU_APB2F_TMR11_STS                                      DBGMCU_APB2F_TMR11_STS_Msk

/******************************************************************************/
/*                                                                            */
/*                                    QSPI                                    */
/*                                                                            */
/******************************************************************************/
/*****************  Bit definition for QSPI_CTRL1 register  *******************/
#define QSPI_CTRL1_DFS_Pos                                          (0U)
#define QSPI_CTRL1_DFS_Msk                                          (0x1FUL << QSPI_CTRL1_DFS_Pos)                                 /*!< 0x0000001F */
#define QSPI_CTRL1_DFS                                              QSPI_CTRL1_DFS_Msk                                             /*!< DFS[4:0] bits (Data Frame Size) */
#define QSPI_CTRL1_DFS_0                                            (0x01UL << QSPI_CTRL1_DFS_Pos)                                 /*!< 0x00000001 */
#define QSPI_CTRL1_DFS_1                                            (0x02UL << QSPI_CTRL1_DFS_Pos)                                 /*!< 0x00000002 */
#define QSPI_CTRL1_DFS_2                                            (0x04UL << QSPI_CTRL1_DFS_Pos)                                 /*!< 0x00000004 */
#define QSPI_CTRL1_DFS_3                                            (0x08UL << QSPI_CTRL1_DFS_Pos)                                 /*!< 0x00000008 */
#define QSPI_CTRL1_DFS_4                                            (0x10UL << QSPI_CTRL1_DFS_Pos)                                 /*!< 0x00000010 */
#define QSPI_CTRL1_TXMODE_Pos                                       (10U)
#define QSPI_CTRL1_TXMODE_Msk                                       (0x3UL << QSPI_CTRL1_TXMODE_Pos)                               /*!< 0x00000C00 */
#define QSPI_CTRL1_TXMODE                                           QSPI_CTRL1_TXMODE_Msk                                          /*!< Transmit Mode */
#define QSPI_CTRL1_TXMODE_0                                         (0x1UL << QSPI_CTRL1_TXMODE_Pos)                               /*!< 0x00000400 */
#define QSPI_CTRL1_TXMODE_1                                         (0x2UL << QSPI_CTRL1_TXMODE_Pos)                               /*!< 0x00000800 */
#define QSPI_CTRL1_SSTEN_Pos                                        (14U)
#define QSPI_CTRL1_SSTEN_Msk                                        (0x1UL << QSPI_CTRL1_SSTEN_Pos)                                /*!< 0x00004000 */
#define QSPI_CTRL1_SSTEN                                            QSPI_CTRL1_SSTEN_Msk                                           /*!< Slave Select Toggle Enable */
#define QSPI_CTRL1_FRF_Pos                                          (22U)
#define QSPI_CTRL1_FRF_Msk                                          (0x3UL << QSPI_CTRL1_FRF_Pos)                                  /*!< 0x00C00000 */
#define QSPI_CTRL1_FRF                                              QSPI_CTRL1_FRF_Msk                                             /*!< FRF[1:0] bits (Frame Format) */
#define QSPI_CTRL1_FRF_0                                            (0x1UL << QSPI_CTRL1_FRF_Pos)                                  /*!< 0x00400000 */
#define QSPI_CTRL1_FRF_1                                            (0x2UL << QSPI_CTRL1_FRF_Pos)                                  /*!< 0x00800000 */

/*****************  Bit definition for QSPI_CTRL2 register  ********************/
#define QSPI_CTRL2_NDF_Pos                                          (0U)
#define QSPI_CTRL2_NDF_Msk                                          (0xFFFFUL << QSPI_CTRL2_NDF_Pos)                               /*!< 0x0000FFFF */
#define QSPI_CTRL2_NDF                                              QSPI_CTRL2_NDF_Msk                                             /*!< NDF[15:0] bits (Number of Data Frames) */

/*****************  Bit definition for QSPI_SSIEN register  ********************/
#define QSPI_SSIEN_EN_Pos                                           (0U)
#define QSPI_SSIEN_EN_Msk                                           (0x1UL << QSPI_SSIEN_EN_Pos)                                   /*!< 0x00000001 */
#define QSPI_SSIEN_EN                                               QSPI_SSIEN_EN_Msk                                              /*!< Enable bit */

/*****************  Bit definition for QSPI_SLAEN register  ********************/
#define QSPI_SLAEN_SLAEN_Pos                                        (0U)
#define QSPI_SLAEN_SLAEN_Msk                                        (0x1UL << QSPI_SLAEN_SLAEN_Pos)                                /*!< 0x00000001 */
#define QSPI_SLAEN_SLAEN                                            QSPI_SLAEN_SLAEN_Msk                                           /*!< Slave Select Enable */

