kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f427xx.h
/*****************  Bit definition for QSPI_BR register  ***********************/
#define QSPI_BR_CLKDIV_Pos                                          (0U)
#define QSPI_BR_CLKDIV_Msk                                          (0xFFFFUL << QSPI_BR_CLKDIV_Pos)                               /*!< 0x0000FFFF */
#define QSPI_BR_CLKDIV                                              QSPI_BR_CLKDIV_Msk                                             /*!< CLKDIV[15:0] bits (Serial Clock Divider) */

/*****************  Bit definition for QSPI_TFTL register  ********************/
#define QSPI_TFTL_TFT_Pos                                           (0U)
#define QSPI_TFTL_TFT_Msk                                           (0x7UL << QSPI_TFTL_TFT_Pos)                                   /*!< 0x00000007 */
#define QSPI_TFTL_TFT                                               QSPI_TFTL_TFT_Msk                                              /*!< TFT[2:0] bits (Transfer FIFO Threshold Level) */
#define QSPI_TFTL_TFTH_Pos                                          (16U)
#define QSPI_TFTL_TFTH_Msk                                          (0x7UL << QSPI_TFTL_TFTH_Pos)                                  /*!< 0x00070000 */
#define QSPI_TFTL_TFTH                                              QSPI_TFTL_TFTH_Msk                                             /*!< TFTH[2:0] bits (Transfer FIFO Launch Level) */

/*****************  Bit definition for QSPI_RFTL register  ********************/
#define QSPI_RFTL_RFT_Pos                                           (0U)
#define QSPI_RFTL_RFT_Msk                                           (0x7UL << QSPI_RFTL_RFT_Pos)                                   /*!< 0x00000007 */
#define QSPI_RFTL_RFT                                               QSPI_RFTL_RFT_Msk                                              /*!< RFT[2:0] bits (Receive FIFO Threshold Level) */

/*****************  Bit definition for QSPI_TFL register  *********************/
#define QSPI_TFL_TFL_Pos                                            (0U)
#define QSPI_TFL_TFL_Msk                                            (0xFUL << QSPI_TFL_TFL_Pos)                                    /*!< 0x0000000F */
#define QSPI_TFL_TFL                                                QSPI_TFL_TFL_Msk                                               /*!< TFL[3:0] bits (Transmit FIFO Level) */

/*****************  Bit definition for QSPI_RFL register  *********************/
#define QSPI_RFL_RFL_Pos                                            (0U)
#define QSPI_RFL_RFL_Msk                                            (0xFUL << QSPI_RFL_RFL_Pos)                                    /*!< 0x0000000F */
#define QSPI_RFL_RFL                                                QSPI_RFL_RFL_Msk                                               /*!< RFL[3:0] bits (Receive FIFO Level) */

/*****************  Bit definition for QSPI_STS register  *********************/
#define QSPI_STS_BUSYF_Pos                                          (0U)
#define QSPI_STS_BUSYF_Msk                                          (0x1UL << QSPI_STS_BUSYF_Pos)                                  /*!< 0x00000001 */
#define QSPI_STS_BUSYF                                              QSPI_STS_BUSYF_Msk                                             /*!< Busy Flag */
#define QSPI_STS_TFNF_Pos                                           (1U)
#define QSPI_STS_TFNF_Msk                                           (0x1UL << QSPI_STS_TFNF_Pos)                                   /*!< 0x00000002 */
#define QSPI_STS_TFNF                                               QSPI_STS_TFNF_Msk                                              /*!< Transmit FIFO Not Full */
#define QSPI_STS_TFEF_Pos                                           (2U)
#define QSPI_STS_TFEF_Msk                                           (0x1UL << QSPI_STS_TFEF_Pos)                                   /*!< 0x00000004 */
#define QSPI_STS_TFEF                                               QSPI_STS_TFEF_Msk                                              /*!< Transmit FIFO Empty */
#define QSPI_STS_RFNEF_Pos                                          (3U)
#define QSPI_STS_RFNEF_Msk                                          (0x1UL << QSPI_STS_RFNEF_Pos)                                  /*!< 0x00000008 */
#define QSPI_STS_RFNEF                                              QSPI_STS_RFNEF_Msk                                             /*!< Receive FIFO Not Empty */
#define QSPI_STS_RFFF_Pos                                           (4U)
#define QSPI_STS_RFFF_Msk                                           (0x1UL << QSPI_STS_RFFF_Pos)                                   /*!< 0x00000010 */
#define QSPI_STS_RFFF                                               QSPI_STS_RFFF_Msk                                              /*!< Receive FIFO Full */

/*****************  Bit definition for QSPI_INTEN register  *******************/
#define QSPI_INTEN_TFEIE_Pos                                        (0U)
#define QSPI_INTEN_TFEIE_Msk                                        (0x1UL << QSPI_INTEN_TFEIE_Pos)                                /*!< 0x00000001 */
#define QSPI_INTEN_TFEIE                                            QSPI_INTEN_TFEIE_Msk                                           /*!< Transmit FIFO Interrupt Enable */
#define QSPI_INTEN_TFOIE_Pos                                        (1U)
#define QSPI_INTEN_TFOIE_Msk                                        (0x1UL << QSPI_INTEN_TFOIE_Pos)                                /*!< 0x00000002 */
#define QSPI_INTEN_TFOIE                                            QSPI_INTEN_TFOIE_Msk                                           /*!< Transmit FIFO Overflow Interrupt Enable */
#define QSPI_INTEN_RFUIE_Pos                                        (2U)
#define QSPI_INTEN_RFUIE_Msk                                        (0x1UL << QSPI_INTEN_RFUIE_Pos)                                /*!< 0x00000004 */
#define QSPI_INTEN_RFUIE                                            QSPI_INTEN_RFUIE_Msk                                           /*!< Receive FIFO Underflow Interrupt Enable */
#define QSPI_INTEN_RFOIE_Pos                                        (3U)
#define QSPI_INTEN_RFOIE_Msk                                        (0x1UL << QSPI_INTEN_RFOIE_Pos)                                /*!< 0x00000008 */
#define QSPI_INTEN_RFOIE                                            QSPI_INTEN_RFOIE_Msk                                           /*!< Receive FIFO Overflow Interrupt Enable */
#define QSPI_INTEN_RFFIE_Pos                                        (4U)
#define QSPI_INTEN_RFFIE_Msk                                        (0x1UL << QSPI_INTEN_RFFIE_Pos)                                /*!< 0x00000010 */
#define QSPI_INTEN_RFFIE                                            QSPI_INTEN_RFFIE_Msk                                           /*!< Receive FIFO Full Interrupt Enable */

/*****************  Bit definition for QSPI_ISTS register  *******************/
#define QSPI_ISTS_TFEIF_Pos                                         (0U)
#define QSPI_ISTS_TFEIF_Msk                                         (0x1UL << QSPI_ISTS_TFEIF_Pos)                                 /*!< 0x00000001 */
#define QSPI_ISTS_TFEIF                                             QSPI_ISTS_TFEIF_Msk                                            /*!< Transmit FIFO Empty Interrupt Status Flag */
#define QSPI_ISTS_TFOIF_Pos                                         (1U)
#define QSPI_ISTS_TFOIF_Msk                                         (0x1UL << QSPI_ISTS_TFOIF_Pos)                                 /*!< 0x00000002 */
#define QSPI_ISTS_TFOIF                                             QSPI_ISTS_TFOIF_Msk                                            /*!< Transmit FIFO Overflow Interrupt Status Flag */
#define QSPI_ISTS_RFUIF_Pos                                         (2U)
#define QSPI_ISTS_RFUIF_Msk                                         (0x1UL << QSPI_ISTS_RFUIF_Pos)                                 /*!< 0x00000004 */
#define QSPI_ISTS_RFUIF                                             QSPI_ISTS_RFUIF_Msk                                            /*!< Receive FIFO Underflow Interrupt Status Flag */
#define QSPI_ISTS_RFOIF_Pos                                         (3U)
#define QSPI_ISTS_RFOIF_Msk                                         (0x1UL << QSPI_ISTS_RFOIF_Pos)                                 /*!< 0x00000008 */
#define QSPI_ISTS_RFOIF                                             QSPI_ISTS_RFOIF_Msk                                            /*!< Receive FIFO Overflow Interrupt Status Flag */
#define QSPI_ISTS_RFFIF_Pos                                         (4U)
#define QSPI_ISTS_RFFIF_Msk                                         (0x1UL << QSPI_ISTS_RFFIF_Pos)                                 /*!< 0x00000010 */
#define QSPI_ISTS_RFFIF                                             QSPI_ISTS_RFFIF_Msk                                            /*!< Receive FIFO Full Interrupt Status Flag */

/*****************  Bit definition for QSPI_RIS register  ********************/
#define QSPI_RIS_TFEIF_Pos                                          (0U)
#define QSPI_RIS_TFEIF_Msk                                          (0x1UL << QSPI_RIS_TFEIF_Pos)                                  /*!< 0x00000001 */
#define QSPI_RIS_TFEIF                                              QSPI_RIS_TFEIF_Msk                                             /*!< Transmit FIFO Empty Origin Interrupt Status */
#define QSPI_RIS_TFOIF_Pos                                          (1U)
#define QSPI_RIS_TFOIF_Msk                                          (0x1UL << QSPI_RIS_TFOIF_Pos)                                  /*!< 0x00000002 */
#define QSPI_RIS_TFOIF                                              QSPI_RIS_TFOIF_Msk                                             /*!< Transmit FIFO Overflow Origin Interrupt Status */
#define QSPI_RIS_RFUIF_Pos                                          (2U)
#define QSPI_RIS_RFUIF_Msk                                          (0x1UL << QSPI_RIS_RFUIF_Pos)                                  /*!< 0x00000004 */
#define QSPI_RIS_RFUIF                                              QSPI_RIS_RFUIF_Msk                                             /*!< Receive FIFO Underflow Origin Interrupt Status */
#define QSPI_RIS_RXOIR_Pos                                          (3U)
#define QSPI_RIS_RXOIR_Msk                                          (0x1UL << QSPI_RIS_RXOIR_Pos)                                  /*!< 0x00000008 */
#define QSPI_RIS_RXOIR                                              QSPI_RIS_RXOIR_Msk                                             /*!< Receive FIFO Overflow Origin Interrupt Status */
#define QSPI_RIS_RXFIR_Pos                                          (4U)
#define QSPI_RIS_RXFIR_Msk                                          (0x1UL << QSPI_RIS_RXFIR_Pos)                                  /*!< 0x00000010 */
#define QSPI_RIS_RXFIR                                              QSPI_RIS_RXFIR_Msk                                             /*!< Receive FIFO Full Origin Interrupt Status */

/*****************  Bit definition for QSPI_TFOIC register  ******************/
#define QSPI_TFOIC_TFOIC_Pos                                        (0U)
#define QSPI_TFOIC_TFOIC_Msk                                        (0x1UL << QSPI_TFOIC_TFOIC_Pos)                                /*!< 0x00000001 */
#define QSPI_TFOIC_TFOIC                                            QSPI_TFOIC_TFOIC_Msk                                           /*!< Transmit FIFO Overflow Interrupt Clear */

/*****************  Bit definition for QSPI_RFOIC register  ******************/
#define QSPI_RFOIC_RFOIC_Pos                                        (0U)
#define QSPI_RFOIC_RFOIC_Msk                                        (0x1UL << QSPI_RFOIC_RFOIC_Pos)                                /*!< 0x00000001 */
#define QSPI_RFOIC_RFOIC                                            QSPI_RFOIC_RFOIC_Msk                                           /*!< Receive FIFO Overflow Interrupt Clear */

