kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f427xx.h
/*****************  Bit definition for QSPI_RFUIC register  ******************/
#define QSPI_RFUIC_RFUIC_Pos                                        (0U)
#define QSPI_RFUIC_RFUIC_Msk                                        (0x1UL << QSPI_RFUIC_RFUIC_Pos)                                /*!< 0x00000001 */
#define QSPI_RFUIC_RFUIC                                            QSPI_RFUIC_RFUIC_Msk                                           /*!< Receive FIFO Underflow Interrupt Clear */

/*****************  Bit definition for QSPI_ICF register  ********************/
#define QSPI_ICF_ICF_Pos                                            (0U)
#define QSPI_ICF_ICF_Msk                                            (0x1UL << QSPI_ICF_ICF_Pos)                                    /*!< 0x00000001 */
#define QSPI_ICF_ICF                                                QSPI_ICF_ICF_Msk                                               /*!< Data Collision Error Interrupt Clear */

/*****************  Bit definition for QSPI_DMACTRL register  ****************/
#define QSPI_DMACTRL_RDMAEN_Pos                                     (0U)
#define QSPI_DMACTRL_RDMAEN_Msk                                     (0x1UL << QSPI_DMACTRL_RDMAEN_Pos)                             /*!< 0x00000001 */
#define QSPI_DMACTRL_RDMAEN                                         QSPI_DMACTRL_RDMAEN_Msk                                        /*!< Receive DMA Enable */
#define QSPI_DMACTRL_TDMAEN_Pos                                     (1U)
#define QSPI_DMACTRL_TDMAEN_Msk                                     (0x1UL << QSPI_DMACTRL_TDMAEN_Pos)                             /*!< 0x00000002 */
#define QSPI_DMACTRL_TDMAEN                                         QSPI_DMACTRL_TDMAEN_Msk                                        /*!< Transmit DMA Enable */

/*****************  Bit definition for QSPI_DMATDL register  *****************/
#define QSPI_DMATDL_DMATDL_Pos                                      (0U)
#define QSPI_DMATDL_DMATDL_Msk                                      (0x7UL << QSPI_DMATDL_DMATDL_Pos)                              /*!< 0x00000007 */
#define QSPI_DMATDL_DMATDL                                          QSPI_DMATDL_DMATDL_Msk                                         /*!< DMATDL[2:0] bits (DMA Transmit Data Level) */

/*****************  Bit definition for QSPI_DMARDL register  *****************/
#define QSPI_DMARDL_DMARDL_Pos                                      (0U)
#define QSPI_DMARDL_DMARDL_Msk                                      (0x7UL << QSPI_DMARDL_DMARDL_Pos)                              /*!< 0x00000007 */
#define QSPI_DMARDL_DMARDL                                          QSPI_DMARDL_DMARDL_Msk                                         /*!< DMARDL[2:0] bits (DMA Receive Data Level) */

/*****************  Bit definition for QSPI_DATA register  *******************/
#define QSPI_DATA_DATA_Pos                                          (0U)
#define QSPI_DATA_DATA_Msk                                          (0xFFFFFFFFUL << QSPI_DATA_DATA_Pos)                           /*!< 0xFFFFFFFF */
#define QSPI_DATA_DATA                                              QSPI_DATA_DATA_Msk                                             /*!< Transmit/Receive Data */

/*****************  Bit definition for QSPI_RSD register  ********************/
#define QSPI_RSD_RSD_Pos                                            (0U)
#define QSPI_RSD_RSD_Msk                                            (0xFFUL << QSPI_RSD_RSD_Pos)                                   /*!< 0x000000FF */
#define QSPI_RSD_RSD                                                QSPI_RSD_RSD_Msk                                               /*!< Receive Sample Delay */
#define QSPI_RSD_RSE_Pos                                            (16U)
#define QSPI_RSD_RSE_Msk                                            (0x1UL << QSPI_RSD_RSE_Pos)                                    /*!< 0x00010000 */
#define QSPI_RSD_RSE                                                QSPI_RSD_RSE_Msk                                               /*!< Receive Sample Enable */

/*****************  Bit definition for QSPI_CTRL3 register  ******************/
#define QSPI_CTRL3_IAT_Pos                                          (0U)
#define QSPI_CTRL3_IAT_Msk                                          (0x3UL << QSPI_CTRL3_IAT_Pos)                                  /*!< 0x00000003 */
#define QSPI_CTRL3_IAT                                              QSPI_CTRL3_IAT_Msk                                             /*!< IAT[1:0] bits (Transfer Instruction Address Mode) */
#define QSPI_CTRL3_IAT_0                                            (0x1UL << QSPI_CTRL3_IAT_Pos)                                  /*!< 0x00000001 */
#define QSPI_CTRL3_IAT_1                                            (0x2UL << QSPI_CTRL3_IAT_Pos)                                  /*!< 0x00000002 */
#define QSPI_CTRL3_ADDRLEN_Pos                                      (2U)
#define QSPI_CTRL3_ADDRLEN_Msk                                      (0xFUL << QSPI_CTRL3_ADDRLEN_Pos)                              /*!< 0x0000003C */
#define QSPI_CTRL3_ADDRLEN                                          QSPI_CTRL3_ADDRLEN_Msk                                         /*!< ADDRLEN[3:0] bits (Transfer Address Length) */
#define QSPI_CTRL3_ADDRLEN_0                                        (0x1UL << QSPI_CTRL3_ADDRLEN_Pos)                              /*!< 0x00000004 */
#define QSPI_CTRL3_ADDRLEN_1                                        (0x2UL << QSPI_CTRL3_ADDRLEN_Pos)                              /*!< 0x00000008 */
#define QSPI_CTRL3_ADDRLEN_2                                        (0x4UL << QSPI_CTRL3_ADDRLEN_Pos)                              /*!< 0x00000010 */
#define QSPI_CTRL3_ADDRLEN_3                                        (0x8UL << QSPI_CTRL3_ADDRLEN_Pos)                              /*!< 0x00000020 */
#define QSPI_CTRL3_INSLEN_Pos                                       (8U)
#define QSPI_CTRL3_INSLEN_Msk                                       (0x3UL << QSPI_CTRL3_INSLEN_Pos)                               /*!< 0x00000300 */
#define QSPI_CTRL3_INSLEN                                           QSPI_CTRL3_INSLEN_Msk                                          /*!< INSLEN[1:0] bits (Transfer Instruction Length) */
#define QSPI_CTRL3_INSLEN_0                                         (0x1UL << QSPI_CTRL3_INSLEN_Pos)                               /*!< 0x00000100 */
#define QSPI_CTRL3_INSLEN_1                                         (0x2UL << QSPI_CTRL3_INSLEN_Pos)                               /*!< 0x00000200 */
#define QSPI_CTRL3_WAITCYC_Pos                                      (11U)
#define QSPI_CTRL3_WAITCYC_Msk                                      (0x1FUL << QSPI_CTRL3_WAITCYC_Pos)                             /*!< 0x0000F800 */
#define QSPI_CTRL3_WAITCYC                                          QSPI_CTRL3_WAITCYC_Msk                                         /*!< WAITCYC[4:0] bits (Wait Cycle Number) */
#define QSPI_CTRL3_CSEN_Pos                                         (30U)
#define QSPI_CTRL3_CSEN_Msk                                         (0x1UL << QSPI_CTRL3_CSEN_Pos)                                 /*!< 0x40000000 */
#define QSPI_CTRL3_CSEN                                             QSPI_CTRL3_CSEN_Msk                                            /*!< Clock Stretch Enable */

/*****************  Bit definition for QSPI_XIP_INCR_INST register  ***********/
#define QSPI_XIP_INCR_INST_INCR_INST_Pos                            (0U)
#define QSPI_XIP_INCR_INST_INCR_INST_Msk                            (0xFFFFUL << QSPI_XIP_INCR_INST_INCR_INST_Pos)                 /*!< 0xFFFF */
#define QSPI_XIP_INCR_INST_INCR_INST                                QSPI_XIP_INCR_INST_INCR_INST_Msk                               /*!< INCR_INST[15:0] bits (Instruction Increment) */

/*****************  Bit definition for QSPI_XIP_WRAP_INST register  ***********/
#define QSPI_XIP_WRAP_INST_WRAP_INST_Pos                            (0U)
#define QSPI_XIP_WRAP_INST_WRAP_INST_Msk                            (0xFFFFUL << QSPI_XIP_WRAP_INST_WRAP_INST_Pos)                 /*!< 0xFFFF */
#define QSPI_XIP_WRAP_INST_WRAP_INST                                QSPI_XIP_WRAP_INST_WRAP_INST_Msk                               /*!< WRAP_INST[15:0] bits (Instruction Wrap) */

/*****************  Bit definition for QSPI_XIP_CTRL register  ****************/
#define QSPI_XIP_CTRL_FRF_Pos                                        (0U)
#define QSPI_XIP_CTRL_FRF_Msk                                        (0x3UL << QSPI_XIP_CTRL_FRF_Pos)                              /*!< 0x00000003 */
#define QSPI_XIP_CTRL_FRF                                            QSPI_XIP_CTRL_FRF_Msk                                         /*!< FRF[1:0] bits (Flash Read Format) */
#define QSPI_XIP_CTRL_FRF_0                                          (0x1UL << QSPI_XIP_CTRL_FRF_Pos)                              /*!< 0x00000001 */
#define QSPI_XIP_CTRL_FRF_1                                          (0x2UL << QSPI_XIP_CTRL_FRF_Pos)                              /*!< 0x00000002 */
#define QSPI_XIP_CTRL_TRANS_TYPE_Pos                                 (2U)
#define QSPI_XIP_CTRL_TRANS_TYPE_Msk                                 (0x3UL << QSPI_XIP_CTRL_TRANS_TYPE_Pos)                       /*!< 0x0000000C */
#define QSPI_XIP_CTRL_TRANS_TYPE                                     QSPI_XIP_CTRL_TRANS_TYPE_Msk                                  /*!< TRANS_TYPE[1:0] bits (Transfer Type) */
#define QSPI_XIP_CTRL_TRANS_TYPE_0                                   (0x1UL << QSPI_XIP_CTRL_TRANS_TYPE_Pos)                       /*!< 0x00000004 */
#define QSPI_XIP_CTRL_TRANS_TYPE_1                                   (0x2UL << QSPI_XIP_CTRL_TRANS_TYPE_Pos)                       /*!< 0x00000008 */
#define QSPI_XIP_CTRL_ADDR_L_Pos                                     (4U)
#define QSPI_XIP_CTRL_ADDR_L_Msk                                     (0xFUL << QSPI_XIP_CTRL_ADDR_L_Pos)                           /*!< 0x000000F0 */
#define QSPI_XIP_CTRL_ADDR_L                                         QSPI_XIP_CTRL_ADDR_L_Msk                                      /*!< ADDR_L[3:0] bits (Address Length) */
#define QSPI_XIP_CTRL_ADDR_L_0                                       (0x1UL << QSPI_XIP_CTRL_ADDR_L_Pos)                           /*!< 0x00000010 */
#define QSPI_XIP_CTRL_ADDR_L_1                                       (0x2UL << QSPI_XIP_CTRL_ADDR_L_Pos)                           /*!< 0x00000020 */
#define QSPI_XIP_CTRL_ADDR_L_2                                       (0x4UL << QSPI_XIP_CTRL_ADDR_L_Pos)                           /*!< 0x00000040 */
#define QSPI_XIP_CTRL_ADDR_L_3                                       (0x8UL << QSPI_XIP_CTRL_ADDR_L_Pos)                           /*!< 0x00000080 */
#define QSPI_XIP_CTRL_INST_L_Pos                                     (9U)
#define QSPI_XIP_CTRL_INST_L_Msk                                     (0x3UL << QSPI_XIP_CTRL_INST_L_Pos)                           /*!< 0x00000300 */
#define QSPI_XIP_CTRL_INST_L                                         QSPI_XIP_CTRL_INST_L_Msk                                      /*!< INST_L[1:0] bits (Instruction Length) */
#define QSPI_XIP_CTRL_INST_L_0                                       (0x1UL << QSPI_XIP_CTRL_INST_L_Pos)                           /*!< 0x00000100 */
#define QSPI_XIP_CTRL_INST_L_1                                       (0x2UL << QSPI_XIP_CTRL_INST_L_Pos)                           /*!< 0x00000200 */
#define QSPI_XIP_CTRL_WAIT_CYCLES_Pos                                (13U)
#define QSPI_XIP_CTRL_WAIT_CYCLES_Msk                                (0x1FUL << QSPI_XIP_CTRL_WAIT_CYCLES_Pos)                     /*!< 0x0000F800 */
#define QSPI_XIP_CTRL_WAIT_CYCLES                                    QSPI_XIP_CTRL_WAIT_CYCLES_Msk                                 /*!< WAIT_CYCLES[4:0] bits (Wait Cycles) */
#define QSPI_XIP_CTRL_DFS_HC_Pos                                     (18U)
#define QSPI_XIP_CTRL_DFS_HC_Msk                                     (0x1UL << QSPI_XIP_CTRL_DFS_HC_Pos)                           /*!< 0x00080000 */
#define QSPI_XIP_CTRL_DFS_HC                                         QSPI_XIP_CTRL_DFS_HC_Msk                                      /*!< DFS_HC bit (Data Frame Size */
#define QSPI_XIP_CTRL_INST_EN_Pos                                    (22U)
#define QSPI_XIP_CTRL_INST_EN_Msk                                    (0x1UL << QSPI_XIP_CTRL_INST_EN_Pos)                          /*!< 0x00800000 */
#define QSPI_XIP_CTRL_INST_EN                                        QSPI_XIP_CTRL_INST_EN_Msk                                     /*!< INST_EN bit (Instruction Enable) */
#define QSPI_XIP_CTRL_CONT_XFER_EN_Pos                               (23U)
#define QSPI_XIP_CTRL_CONT_XFER_EN_Msk                               (0x1UL << QSPI_XIP_CTRL_CONT_XFER_EN_Pos)                     /*!< 0x01000000 */
#define QSPI_XIP_CTRL_CONT_XFER_EN                                   QSPI_XIP_CTRL_CONT_XFER_EN_Msk                                /*!< CONT_XFER_EN bit (Continuous Transfer Enable) */
#define QSPI_XIP_CTRL_XIP_PREFETCH_EN_Pos                            (29U)
#define QSPI_XIP_CTRL_XIP_PREFETCH_EN_Msk                            (0x1UL << QSPI_XIP_CTRL_XIP_PREFETCH_EN_Pos)                  /*!< 0x80000000 */
#define QSPI_XIP_CTRL_XIP_PREFETCH_EN                                QSPI_XIP_CTRL_XIP_PREFETCH_EN_Msk                             /*!< XIP_PREFETCH_EN bit (XIP Prefetch Enable) */

/*****************  Bit definition for QSPI_XIP_SER register  *******************/
#define QSPI_XIP_SER_SER_Pos                                        (0U)
#define QSPI_XIP_SER_SER_Msk                                        (0x1UL << QSPI_XIP_SER_SER_Pos)                                /*!< 0x00000001 */
#define QSPI_XIP_SER_SER                                            QSPI_XIP_SER_SER_Msk                                           /*!< SER[0] bit (Slave Select Enable Flag) */

/*****************  Bit definition for QSPI_SWITCH register  ********************/
#define QSPI_SWITCH_SWITCH_Pos                                      (0U)
#define QSPI_SWITCH_SWITCH_Msk                                      (0x1UL << QSPI_SWITCH_SWITCH_Pos)                              /*!< 0x00000001 */
#define QSPI_SWITCH_SWITCH                                          QSPI_SWITCH_SWITCH_Msk                                         /*!< SWITCH[0] bit (Switch) */
#define QSPI_SWITCH_LITTLE_ENDIAN_EN_Pos                            (1U)
#define QSPI_SWITCH_LITTLE_ENDIAN_EN_Msk                            (0x1UL << QSPI_SWITCH_LITTLE_ENDIAN_EN_Pos)                    /*!< 0x00000002 */
#define QSPI_SWITCH_LITTLE_ENDIAN_EN                                QSPI_SWITCH_LITTLE_ENDIAN_EN_Msk                               /*!< LITTLE_ENDIAN_EN[1] bit (Little Endian Enable) */

/*****************  Bit definition for QSPI_XIP_EN register  *********************/
#define QSPI_XIP_EN_XIP_EN_Pos                                      (0U)
#define QSPI_XIP_EN_XIP_EN_Msk                                      (0x1UL << QSPI_XIP_EN_XIP_EN_Pos)                              /*!< 0x00000001 */
#define QSPI_XIP_EN_XIP_EN                                          QSPI_XIP_EN_XIP_EN_Msk                                         /*!< XIP_EN[0] bit (XIP Enable) */

/******************************************************************************/
/*                                                                            */
/*                Ethernet MAC Registers bits definitions                     */
/*                                                                            */
/******************************************************************************/
/* Bit definition for Ethernet MAC Control Register register */
#define ETH_MACCFG_WDTDIS_Pos                                       (23U)
#define ETH_MACCFG_WDTDIS_Msk                                       (0x1UL << ETH_MACCFG_WDTDIS_Pos)                               /*!< 0x00800000 */
#define ETH_MACCFG_WDTDIS                                           ETH_MACCFG_WDTDIS_Msk                                          /* Watchdog disable */
#define ETH_MACCFG_JDIS_Pos                                         (22U)
#define ETH_MACCFG_JDIS_Msk                                         (0x1UL << ETH_MACCFG_JDIS_Pos)                                 /*!< 0x00400000 */
#define ETH_MACCFG_JDIS                                             ETH_MACCFG_JDIS_Msk                                            /* Jabber disable */
#define ETH_MACCFG_IFG_Pos                                          (17U)
#define ETH_MACCFG_IFG_Msk                                          (0x7UL << ETH_MACCFG_IFG_Pos)                                  /*!< 0x000E0000 */
#define ETH_MACCFG_IFG                                              ETH_MACCFG_IFG_Msk                                             /* Inter-frame gap */
#define ETH_MACCFG_IFG_96Bit                                        0x00000000U                                                    /* Minimum IFG between frames during transmission is 96Bit */
#define ETH_MACCFG_IFG_88Bit                                        0x00020000U                                                    /* Minimum IFG between frames during transmission is 88Bit */
#define ETH_MACCFG_IFG_80Bit                                        0x00040000U                                                    /* Minimum IFG between frames during transmission is 80Bit */
#define ETH_MACCFG_IFG_72Bit                                        0x00060000U                                                    /* Minimum IFG between frames during transmission is 72Bit */
#define ETH_MACCFG_IFG_64Bit                                        0x00080000U                                                    /* Minimum IFG between frames during transmission is 64Bit */
#define ETH_MACCFG_IFG_56Bit                                        0x000A0000U                                                    /* Minimum IFG between frames during transmission is 56Bit */
#define ETH_MACCFG_IFG_48Bit                                        0x000C0000U                                                    /* Minimum IFG between frames during transmission is 48Bit */
#define ETH_MACCFG_IFG_40Bit                                        0x000E0000U                                                    /* Minimum IFG between frames during transmission is 40Bit */
#define ETH_MACCFG_DISCRS_Pos                                       (16U)
#define ETH_MACCFG_DISCRS_Msk                                       (0x1UL << ETH_MACCFG_DISCRS_Pos)                               /*!< 0x00010000 */
#define ETH_MACCFG_DISCRS                                           ETH_MACCFG_DISCRS_Msk                                          /* Carrier sense disable (during transmission) */
#define ETH_MACCFG_SSEL_Pos                                         (14U)
#define ETH_MACCFG_SSEL_Msk                                         (0x1UL << ETH_MACCFG_SSEL_Pos)                                 /*!< 0x00004000 */
#define ETH_MACCFG_SSEL                                             ETH_MACCFG_SSEL_Msk                                            /* Fast ethernet speed */
#define ETH_MACCFG_DISRXO_Pos                                       (13U)
#define ETH_MACCFG_DISRXO_Msk                                       (0x1UL << ETH_MACCFG_DISRXO_Pos)                               /*!< 0x00002000 */
#define ETH_MACCFG_DISRXO                                           ETH_MACCFG_DISRXO_Msk                                          /* Receive own disable */
#define ETH_MACCFG_LBM_Pos                                          (12U)
#define ETH_MACCFG_LBM_Msk                                          (0x1UL << ETH_MACCFG_LBM_Pos)                                  /*!< 0x00001000 */
#define ETH_MACCFG_LBM                                              ETH_MACCFG_LBM_Msk                                             /* loopback mode */
#define ETH_MACCFG_DM_Pos                                           (11U)
#define ETH_MACCFG_DM_Msk                                           (0x1UL << ETH_MACCFG_DM_Pos)                                   /*!< 0x00000800 */
#define ETH_MACCFG_DM                                               ETH_MACCFG_DM_Msk                                              /* Duplex mode */
#define ETH_MACCFG_IPC_Pos                                          (10U)
#define ETH_MACCFG_IPC_Msk                                          (0x1UL << ETH_MACCFG_IPC_Pos)                                  /*!< 0x00000400 */
#define ETH_MACCFG_IPC                                              ETH_MACCFG_IPC_Msk                                             /* IP Checksum offload */
#define ETH_MACCFG_DISR_Pos                                         (9U)
#define ETH_MACCFG_DISR_Msk                                         (0x1UL << ETH_MACCFG_DISR_Pos)                                 /*!< 0x00000200 */
#define ETH_MACCFG_DISR                                             ETH_MACCFG_DISR_Msk                                            /* Retry disable */
#define ETH_MACCFG_ACS_Pos                                          (7U)
#define ETH_MACCFG_ACS_Msk                                          (0x1UL << ETH_MACCFG_ACS_Pos)                                  /*!< 0x00000080 */
#define ETH_MACCFG_ACS                                              ETH_MACCFG_ACS_Msk                                             /* Automatic Pad/CRC stripping */
#define ETH_MACCFG_BL_Pos                                           (5U)
#define ETH_MACCFG_BL_Msk                                           (0x3UL << ETH_MACCFG_BL_Pos)                                   /*!< 0x00000060 */
#define ETH_MACCFG_BL                                               ETH_MACCFG_BL_Msk                                              /* Back-off limit: random integer number (r) of slot time delays before rescheduling
                                                       a transmission attempt during retries after a collision: 0 =< r <2^k */
#define ETH_MACCFG_BL_10                                            0x00000000U                                                    /* k = min (n, 10) */
#define ETH_MACCFG_BL_8                                             0x00000020U                                                    /* k = min (n, 8) */
#define ETH_MACCFG_BL_4                                             0x00000040U                                                    /* k = min (n, 4) */
#define ETH_MACCFG_BL_1                                             0x00000060U                                                    /* k = min (n, 1) */
#define ETH_MACCFG_DC_Pos                                           (4U)
#define ETH_MACCFG_DC_Msk                                           (0x1UL << ETH_MACCFG_DC_Pos)                                   /*!< 0x00000010 */
#define ETH_MACCFG_DC                                               ETH_MACCFG_DC_Msk                                              /* Defferal check */
#define ETH_MACCFG_TXEN_Pos                                         (3U)
#define ETH_MACCFG_TXEN_Msk                                         (0x1UL << ETH_MACCFG_TXEN_Pos)                                 /*!< 0x00000008 */
#define ETH_MACCFG_TXEN                                             ETH_MACCFG_TXEN_Msk                                            /* Transmitter enable */
#define ETH_MACCFG_RXEN_Pos                                         (2U)
#define ETH_MACCFG_RXEN_Msk                                         (0x1UL << ETH_MACCFG_RXEN_Pos)                                 /*!< 0x00000004 */
#define ETH_MACCFG_RXEN                                             ETH_MACCFG_RXEN_Msk                                            /* Receiver enable */

