kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f427xx.h
/* Bit definition for Ethernet MAC Frame Filter Register */
#define ETH_MACFRAF_RXA_Pos                                         (31U)
#define ETH_MACFRAF_RXA_Msk                                         (0x1UL << ETH_MACFRAF_RXA_Pos)                                 /*!< 0x80000000 */
#define ETH_MACFRAF_RXA                                             ETH_MACFRAF_RXA_Msk                                            /* Receive all */
#define ETH_MACFRAF_HPF_Pos                                         (10U)
#define ETH_MACFRAF_HPF_Msk                                         (0x1UL << ETH_MACFRAF_HPF_Pos)                                 /*!< 0x00000400 */
#define ETH_MACFRAF_HPF                                             ETH_MACFRAF_HPF_Msk                                            /* Hash or perfect filter */
#define ETH_MACFRAF_SAFEN_Pos                                       (9U)
#define ETH_MACFRAF_SAFEN_Msk                                       (0x1UL << ETH_MACFRAF_SAFEN_Pos)                               /*!< 0x00000200 */
#define ETH_MACFRAF_SAFEN                                           ETH_MACFRAF_SAFEN_Msk                                          /* Source address filter enable */
#define ETH_MACFRAF_SAIF_Pos                                        (8U)
#define ETH_MACFRAF_SAIF_Msk                                        (0x1UL << ETH_MACFRAF_SAIF_Pos)                                /*!< 0x00000100 */
#define ETH_MACFRAF_SAIF                                            ETH_MACFRAF_SAIF_Msk                                           /* SA inverse filtering */
#define ETH_MACFRAF_PCTRLF_Pos                                      (6U)
#define ETH_MACFRAF_PCTRLF_Msk                                      (0x3UL << ETH_MACFRAF_PCTRLF_Pos)                              /*!< 0x000000C0 */
#define ETH_MACFRAF_PCTRLF                                          ETH_MACFRAF_PCTRLF_Msk                                         /* Pass control frames: 3 cases */
#define ETH_MACFRAF_PCTRLF_BlockAll_Pos                             (6U)
#define ETH_MACFRAF_PCTRLF_BlockAll_Msk                             (0x1UL << ETH_MACFRAF_PCTRLF_BlockAll_Pos)                     /*!< 0x00000040 */
#define ETH_MACFRAF_PCTRLF_BlockAll                                 ETH_MACFRAF_PCTRLF_BlockAll_Msk                                /* MAC filters all control frames from reaching the application */
#define ETH_MACFRAF_PCTRLF_ForwardAll_Pos                           (7U)
#define ETH_MACFRAF_PCTRLF_ForwardAll_Msk                           (0x1UL << ETH_MACFRAF_PCTRLF_ForwardAll_Pos)                   /*!< 0x00000080 */
#define ETH_MACFRAF_PCTRLF_ForwardAll                               ETH_MACFRAF_PCTRLF_ForwardAll_Msk                              /* MAC forwards all control frames to application even if they fail the Address Filter */
#define ETH_MACFRAF_PCTRLF_ForwardPassedAddrFilter_Pos              (6U)
#define ETH_MACFRAF_PCTRLF_ForwardPassedAddrFilter_Msk              (0x3UL << ETH_MACFRAF_PCTRLF_ForwardPassedAddrFilter_Pos)      /*!< 0x000000C0 */
#define ETH_MACFRAF_PCTRLF_ForwardPassedAddrFilter                  ETH_MACFRAF_PCTRLF_ForwardPassedAddrFilter_Msk                 /* MAC forwards control frames that pass the Address Filter. */
#define ETH_MACFRAF_DISBF_Pos                                       (5U)
#define ETH_MACFRAF_DISBF_Msk                                       (0x1UL << ETH_MACFRAF_DISBF_Pos)                               /*!< 0x00000020 */
#define ETH_MACFRAF_DISBF                                           ETH_MACFRAF_DISBF_Msk                                          /* Broadcast frame disable */
#define ETH_MACFRAF_PM_Pos                                          (4U)
#define ETH_MACFRAF_PM_Msk                                          (0x1UL << ETH_MACFRAF_PM_Pos)                                  /*!< 0x00000010 */
#define ETH_MACFRAF_PM                                              ETH_MACFRAF_PM_Msk                                             /* Pass all mutlicast */
#define ETH_MACFRAF_DAIF_Pos                                        (3U)
#define ETH_MACFRAF_DAIF_Msk                                        (0x1UL << ETH_MACFRAF_DAIF_Pos)                                /*!< 0x00000008 */
#define ETH_MACFRAF_DAIF                                            ETH_MACFRAF_DAIF_Msk                                           /* DA Inverse filtering */
#define ETH_MACFRAF_HMC_Pos                                         (2U)
#define ETH_MACFRAF_HMC_Msk                                         (0x1UL << ETH_MACFRAF_HMC_Pos)                                 /*!< 0x00000004 */
#define ETH_MACFRAF_HMC                                             ETH_MACFRAF_HMC_Msk                                            /* Hash multicast */
#define ETH_MACFRAF_HUC_Pos                                         (1U)
#define ETH_MACFRAF_HUC_Msk                                         (0x1UL << ETH_MACFRAF_HUC_Pos)                                 /*!< 0x00000002 */
#define ETH_MACFRAF_HUC                                             ETH_MACFRAF_HUC_Msk                                            /* Hash unicast */
#define ETH_MACFRAF_PR_Pos                                          (0U)
#define ETH_MACFRAF_PR_Msk                                          (0x1UL << ETH_MACFRAF_PR_Pos)                                  /*!< 0x00000001 */
#define ETH_MACFRAF_PR                                              ETH_MACFRAF_PR_Msk                                             /* Promiscuous mode */

/* Bit definition for Ethernet MAC Hash Table High Register */
#define ETH_MACHTH_HTH_Pos                                          (0U)
#define ETH_MACHTH_HTH_Msk                                          (0xFFFFFFFFUL << ETH_MACHTH_HTH_Pos)                           /*!< 0xFFFFFFFF */
#define ETH_MACHTH_HTH                                              ETH_MACHTH_HTH_Msk                                             /* Hash table high */

/* Bit definition for Ethernet MAC Hash Table Low Register */
#define ETH_MACHTL_HTL_Pos                                          (0U)
#define ETH_MACHTL_HTL_Msk                                          (0xFFFFFFFFUL << ETH_MACHTL_HTL_Pos)                           /*!< 0xFFFFFFFF */
#define ETH_MACHTL_HTL                                              ETH_MACHTL_HTL_Msk                                             /* Hash table low */

/* Bit definition for Ethernet MAC MII Address Register */
#define ETH_MACADDR_PA_Pos                                          (11U)
#define ETH_MACADDR_PA_Msk                                          (0x1FUL << ETH_MACADDR_PA_Pos)                                 /*!< 0x0000F800 */
#define ETH_MACADDR_PA                                              ETH_MACADDR_PA_Msk                                             /* Physical layer address */
#define ETH_MACADDR_MR_Pos                                          (6U)
#define ETH_MACADDR_MR_Msk                                          (0x1FUL << ETH_MACADDR_MR_Pos)                                 /*!< 0x000007C0 */
#define ETH_MACADDR_MR                                              ETH_MACADDR_MR_Msk                                             /* MII register in the selected PHY */
#define ETH_MACADDR_CR_Pos                                          (2U)
#define ETH_MACADDR_CR_Msk                                          (0x7UL << ETH_MACADDR_CR_Pos)                                  /*!< 0x0000001C */
#define ETH_MACADDR_CR                                              ETH_MACADDR_CR_Msk                                             /* CR clock range: 6 cases */
#define ETH_MACADDR_CR_Div42                                        0x00000000U                                                    /* HCLK:60-100 MHz; MDC clock= HCLK/42   */
#define ETH_MACADDR_CR_Div62_Pos                                    (2U)
#define ETH_MACADDR_CR_Div62_Msk                                    (0x1UL << ETH_MACADDR_CR_Div62_Pos)                            /*!< 0x00000004 */
#define ETH_MACADDR_CR_Div62                                        ETH_MACADDR_CR_Div62_Msk                                       /* HCLK:100-150 MHz; MDC clock= HCLK/62  */
#define ETH_MACADDR_CR_Div16_Pos                                    (3U)
#define ETH_MACADDR_CR_Div16_Msk                                    (0x1UL << ETH_MACADDR_CR_Div16_Pos)                            /*!< 0x00000008 */
#define ETH_MACADDR_CR_Div16                                        ETH_MACADDR_CR_Div16_Msk                                       /* HCLK:20-35 MHz; MDC clock= HCLK/16    */
#define ETH_MACADDR_CR_Div26_Pos                                    (2U)
#define ETH_MACADDR_CR_Div26_Msk                                    (0x3UL << ETH_MACADDR_CR_Div26_Pos)                            /*!< 0x0000000C */
#define ETH_MACADDR_CR_Div26                                        ETH_MACADDR_CR_Div26_Msk                                       /* HCLK:35-60 MHz; MDC clock= HCLK/26    */
#define ETH_MACADDR_CR_Div102_Pos                                   (4U)
#define ETH_MACADDR_CR_Div102_Msk                                   (0x1UL << ETH_MACADDR_CR_Div102_Pos)                           /*!< 0x00000010 */
#define ETH_MACADDR_CR_Div102                                       ETH_MACADDR_CR_Div102_Msk                                      /* HCLK:150-168 MHz; MDC clock= HCLK/102 */
#define ETH_MACADDR_MW_Pos                                          (1U)
#define ETH_MACADDR_MW_Msk                                          (0x1UL << ETH_MACADDR_MW_Pos)                                  /*!< 0x00000002 */
#define ETH_MACADDR_MW                                              ETH_MACADDR_MW_Msk                                             /* MII write */
#define ETH_MACADDR_MB_Pos                                          (0U)
#define ETH_MACADDR_MB_Msk                                          (0x1UL << ETH_MACADDR_MB_Pos)                                  /*!< 0x00000001 */
#define ETH_MACADDR_MB                                              ETH_MACADDR_MB_Msk                                             /* MII busy  */

/* Bit definition for Ethernet MAC MII Data Register */
#define ETH_MACDATA_MD_Pos                                          (0U)
#define ETH_MACDATA_MD_Msk                                          (0xFFFFUL << ETH_MACDATA_MD_Pos)                               /*!< 0x0000FFFF */
#define ETH_MACDATA_MD                                              ETH_MACDATA_MD_Msk                                             /* MII data: read/write data from/to PHY */

/* Bit definition for Ethernet MAC Flow Control Register */
#define ETH_MACFCTRL_PT_Pos                                         (16U)
#define ETH_MACFCTRL_PT_Msk                                         (0xFFFFUL << ETH_MACFCTRL_PT_Pos)                              /*!< 0xFFFF0000 */
#define ETH_MACFCTRL_PT                                             ETH_MACFCTRL_PT_Msk                                            /* Pause time */
#define ETH_MACFCTRL_ZQPDIS_Pos                                     (7U)
#define ETH_MACFCTRL_ZQPDIS_Msk                                     (0x1UL << ETH_MACFCTRL_ZQPDIS_Pos)                             /*!< 0x00000080 */
#define ETH_MACFCTRL_ZQPDIS                                         ETH_MACFCTRL_ZQPDIS_Msk                                        /* Zero-quanta pause disable */
#define ETH_MACFCTRL_PTSEL_Pos                                      (4U)
#define ETH_MACFCTRL_PTSEL_Msk                                      (0x3UL << ETH_MACFCTRL_PTSEL_Pos)                              /*!< 0x00000030 */
#define ETH_MACFCTRL_PTSEL                                          ETH_MACFCTRL_PTSEL_Msk                                         /* Pause low threshold: 4 cases */
#define ETH_MACFCTRL_PTSEL_Minus4                                   0x00000000U                                                    /* Pause time minus 4 slot times   */
#define ETH_MACFCTRL_PTSEL_Minus28_Pos                              (4U)
#define ETH_MACFCTRL_PTSEL_Minus28_Msk                              (0x1UL << ETH_MACFCTRL_PTSEL_Minus28_Pos)                      /*!< 0x00000010 */
#define ETH_MACFCTRL_PTSEL_Minus28                                  ETH_MACFCTRL_PTSEL_Minus28_Msk                                 /* Pause time minus 28 slot times  */
#define ETH_MACFCTRL_PTSEL_Minus144_Pos                             (5U)
#define ETH_MACFCTRL_PTSEL_Minus144_Msk                             (0x1UL << ETH_MACFCTRL_PTSEL_Minus144_Pos)                     /*!< 0x00000020 */
#define ETH_MACFCTRL_PTSEL_Minus144                                 ETH_MACFCTRL_PTSEL_Minus144_Msk                                /* Pause time minus 144 slot times */
#define ETH_MACFCTRL_PTSEL_Minus256_Pos                             (4U)
#define ETH_MACFCTRL_PTSEL_Minus256_Msk                             (0x3UL << ETH_MACFCTRL_PTSEL_Minus256_Pos)                     /*!< 0x00000030 */
#define ETH_MACFCTRL_PTSEL_Minus256                                 ETH_MACFCTRL_PTSEL_Minus256_Msk                                /* Pause time minus 256 slot times */
#define ETH_MACFCTRL_UNPFDETE_Pos                                   (3U)
#define ETH_MACFCTRL_UNPFDETE_Msk                                   (0x1UL << ETH_MACFCTRL_UNPFDETE_Pos)                           /*!< 0x00000008 */
#define ETH_MACFCTRL_UNPFDETE                                       ETH_MACFCTRL_UNPFDETE_Msk                                      /* Unicast pause frame detect */
#define ETH_MACFCTRL_RXFCTRLEN_Pos                                  (2U)
#define ETH_MACFCTRL_RXFCTRLEN_Msk                                  (0x1UL << ETH_MACFCTRL_RXFCTRLEN_Pos)                          /*!< 0x00000004 */
#define ETH_MACFCTRL_RXFCTRLEN                                      ETH_MACFCTRL_RXFCTRLEN_Msk                                     /* Receive flow control enable */
#define ETH_MACFCTRL_TXFCTRLEN_Pos                                  (1U)
#define ETH_MACFCTRL_TXFCTRLEN_Msk                                  (0x1UL << ETH_MACFCTRL_TXFCTRLEN_Pos)                          /*!< 0x00000002 */
#define ETH_MACFCTRL_TXFCTRLEN                                      ETH_MACFCTRL_TXFCTRLEN_Msk                                     /* Transmit flow control enable */
#define ETH_MACFCTRL_FCTRLB_BPA_Pos                                 (0U)
#define ETH_MACFCTRL_FCTRLB_BPA_Msk                                 (0x1UL << ETH_MACFCTRL_FCTRLB_BPA_Pos)                         /*!< 0x00000001 */
#define ETH_MACFCTRL_FCTRLB_BPA                                     ETH_MACFCTRL_FCTRLB_BPA_Msk                                    /* Flow control busy/backpressure activate */

/* Bit definition for Ethernet MAC VLAN Tag Register */
#define ETH_MACVLANT_VLANTCOMP_Pos                                  (16U)
#define ETH_MACVLANT_VLANTCOMP_Msk                                  (0x1UL << ETH_MACVLANT_VLANTCOMP_Pos)                          /*!< 0x00010000 */
#define ETH_MACVLANT_VLANTCOMP                                      ETH_MACVLANT_VLANTCOMP_Msk                                     /* 12-bit VLAN tag comparison */
#define ETH_MACVLANT_VLANTID_Pos                                    (0U)
#define ETH_MACVLANT_VLANTID_Msk                                    (0xFFFFUL << ETH_MACVLANT_VLANTID_Pos)                         /*!< 0x0000FFFF */
#define ETH_MACVLANT_VLANTID                                        ETH_MACVLANT_VLANTID_Msk                                       /* VLAN tag identifier (for receive frames) */

/* Bit definition for Ethernet MAC Remote Wake-UpFrame Filter Register */
#define ETH_MACREMWKUPFFL_FLXBMASK_Pos                              (0U)
#define ETH_MACREMWKUPFFL_FLXBMASK_Msk                              (0xFFFFFFFFUL << ETH_MACREMWKUPFFL_FLXBMASK_Pos)               /*!< 0xFFFFFFFF */
#define ETH_MACREMWKUPFFL_FLXBMASK                                  ETH_MACREMWKUPFFL_FLXBMASK_Msk                                 /* Wake-up frame filter register data */
/* Eight sequential Writes to this address (offset 0x28) will write all Wake-UpFrame Filter Registers.
   Eight sequential Reads from this address (offset 0x28) will read all Wake-UpFrame Filter Registers. */
/* Wake-UpFrame Filter Reg0 : Filter 0 Byte Mask
   Wake-UpFrame Filter Reg1 : Filter 1 Byte Mask
   Wake-UpFrame Filter Reg2 : Filter 2 Byte Mask
   Wake-UpFrame Filter Reg3 : Filter 3 Byte Mask
   Wake-UpFrame Filter Reg4 : RSVD - Filter3 Command - RSVD - Filter2 Command -
                              RSVD - Filter1 Command - RSVD - Filter0 Command
   Wake-UpFrame Filter Re5 : Filter3 Offset - Filter2 Offset - Filter1 Offset - Filter0 Offset
   Wake-UpFrame Filter Re6 : Filter1 CRC16 - Filter0 CRC16
   Wake-UpFrame Filter Re7 : Filter3 CRC16 - Filter2 CRC16 */

/* Bit definition for Ethernet MAC PMT Control and Status Register */
#define ETH_MACPMTCTRLSTS_WKUPFRST_Pos                              (31U)
#define ETH_MACPMTCTRLSTS_WKUPFRST_Msk                              (0x1UL << ETH_MACPMTCTRLSTS_WKUPFRST_Pos)                      /*!< 0x80000000 */
#define ETH_MACPMTCTRLSTS_WKUPFRST                                  ETH_MACPMTCTRLSTS_WKUPFRST_Msk                                 /* Wake-Up Frame Filter Register Pointer Reset */
#define ETH_MACPMTCTRLSTS_GUN_Pos                                   (9U)
#define ETH_MACPMTCTRLSTS_GUN_Msk                                   (0x1UL << ETH_MACPMTCTRLSTS_GUN_Pos)                           /*!< 0x00000200 */
#define ETH_MACPMTCTRLSTS_GUN                                       ETH_MACPMTCTRLSTS_GUN_Msk                                      /* Global Unicast                              */
#define ETH_MACPMTCTRLSTS_WKUPFRX_Pos                               (6U)
#define ETH_MACPMTCTRLSTS_WKUPFRX_Msk                               (0x1UL << ETH_MACPMTCTRLSTS_WKUPFRX_Pos)                       /*!< 0x00000040 */
#define ETH_MACPMTCTRLSTS_WKUPFRX                                   ETH_MACPMTCTRLSTS_WKUPFRX_Msk                                  /* Wake-Up Frame Received                      */
#define ETH_MACPMTCTRLSTS_MPRX_Pos                                  (5U)
#define ETH_MACPMTCTRLSTS_MPRX_Msk                                  (0x1UL << ETH_MACPMTCTRLSTS_MPRX_Pos)                          /*!< 0x00000020 */
#define ETH_MACPMTCTRLSTS_MPRX                                      ETH_MACPMTCTRLSTS_MPRX_Msk                                     /* Magic Packet Received                       */
#define ETH_MACPMTCTRLSTS_WKUPFEN_Pos                               (2U)
#define ETH_MACPMTCTRLSTS_WKUPFEN_Msk                               (0x1UL << ETH_MACPMTCTRLSTS_WKUPFEN_Pos)                       /*!< 0x00000004 */
#define ETH_MACPMTCTRLSTS_WKUPFEN                                   ETH_MACPMTCTRLSTS_WKUPFEN_Msk                                  /* Wake-Up Frame Enable                        */
#define ETH_MACPMTCTRLSTS_MPEN_Pos                                  (1U)
#define ETH_MACPMTCTRLSTS_MPEN_Msk                                  (0x1UL << ETH_MACPMTCTRLSTS_MPEN_Pos)                          /*!< 0x00000002 */
#define ETH_MACPMTCTRLSTS_MPEN                                      ETH_MACPMTCTRLSTS_MPEN_Msk                                     /* Magic Packet Enable                         */
#define ETH_MACPMTCTRLSTS_PD_Pos                                    (0U)
#define ETH_MACPMTCTRLSTS_PD_Msk                                    (0x1UL << ETH_MACPMTCTRLSTS_PD_Pos)                            /*!< 0x00000001 */
#define ETH_MACPMTCTRLSTS_PD                                        ETH_MACPMTCTRLSTS_PD_Msk                                       /* Power Down                                  */

