kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f427xx.h
/* Bit definition for Ethernet PTP Time Stamp High Update Register */
#define ETH_PTPTSHUD_TSUDSEC_Pos                                    (0U)
#define ETH_PTPTSHUD_TSUDSEC_Msk                                    (0xFFFFFFFFUL << ETH_PTPTSHUD_TSUDSEC_Pos)                     /*!< 0xFFFFFFFF */
#define ETH_PTPTSHUD_TSUDSEC                                        ETH_PTPTSHUD_TSUDSEC_Msk                                       /* Time stamp update seconds */

/* Bit definition for Ethernet PTP Time Stamp Low Update Register */
#define ETH_PTPTSLUD_TSUDSEL_Pos                                    (31U)
#define ETH_PTPTSLUD_TSUDSEL_Msk                                    (0x1UL << ETH_PTPTSLUD_TSUDSEL_Pos)                            /*!< 0x80000000 */
#define ETH_PTPTSLUD_TSUDSEL                                        ETH_PTPTSLUD_TSUDSEL_Msk                                       /* Time stamp update Positive or negative time */
#define ETH_PTPTSLUD_TSUDSUBSEC_Pos                                 (0U)
#define ETH_PTPTSLUD_TSUDSUBSEC_Msk                                 (0x7FFFFFFFUL << ETH_PTPTSLUD_TSUDSUBSEC_Pos)                  /*!< 0x7FFFFFFF */
#define ETH_PTPTSLUD_TSUDSUBSEC                                     ETH_PTPTSLUD_TSUDSUBSEC_Msk                                    /* Time stamp update sub-seconds */

/* Bit definition for Ethernet PTP Time Stamp Addend Register */
#define ETH_PTPTSA_TSA_Pos                                          (0U)
#define ETH_PTPTSA_TSA_Msk                                          (0xFFFFFFFFUL << ETH_PTPTSA_TSA_Pos)                           /*!< 0xFFFFFFFF */
#define ETH_PTPTSA_TSA                                              ETH_PTPTSA_TSA_Msk                                             /* Time stamp addend */

/* Bit definition for Ethernet PTP Target Time High Register */
#define ETH_PTPTTSH_TTSH_Pos                                        (0U)
#define ETH_PTPTTSH_TTSH_Msk                                        (0xFFFFFFFFUL << ETH_PTPTTSH_TTSH_Pos)                         /*!< 0xFFFFFFFF */
#define ETH_PTPTTSH_TTSH                                            ETH_PTPTTSH_TTSH_Msk                                           /* Target time stamp high */

/* Bit definition for Ethernet PTP Target Time Low Register */
#define ETH_PTPTTSL_TTSL_Pos                                        (0U)
#define ETH_PTPTTSL_TTSL_Msk                                        (0xFFFFFFFFUL << ETH_PTPTTSL_TTSL_Pos)                         /*!< 0xFFFFFFFF */
#define ETH_PTPTTSL_TTSL                                            ETH_PTPTTSL_TTSL_Msk                                           /* Target time stamp low */

/* Bit definition for Ethernet PTP Time Stamp Status Register */
#define ETH_PTPTSSTS_TTSRD_Pos                                      (1U)
#define ETH_PTPTSSTS_TTSRD_Msk                                      (0x1UL << ETH_PTPTSSTS_TTSRD_Pos)                              /*!< 0x00000020 */
#define ETH_PTPTSSTS_TTSRD                                          ETH_PTPTSSTS_TTSRD_Msk                                         /* Time stamp target time reached */
#define ETH_PTPTSSTS_TSSECOVR_Pos                                   (0U)
#define ETH_PTPTSSTS_TSSECOVR_Msk                                   (0x1UL << ETH_PTPTSSTS_TSSECOVR_Pos)                           /*!< 0x00000010 */
#define ETH_PTPTSSTS_TSSECOVR                                       ETH_PTPTSSTS_TSSECOVR_Msk                                      /* Time stamp seconds overflow */

/******************************************************************************/
/*                 Ethernet DMA Registers bits definition                     */
/******************************************************************************/

/* Bit definition for Ethernet DMA Bus Mode Register */
#define ETH_DMABMOD_MB_Pos                                          (26U)
#define ETH_DMABMOD_MB_Msk                                          (0x1UL << ETH_DMABMOD_MB_Pos)                                  /*!< 0x04000000 */
#define ETH_DMABMOD_MB                                              ETH_DMABMOD_MB_Msk                                             /* Mixed Burst */
#define ETH_DMABMOD_AAL_Pos                                         (25U)
#define ETH_DMABMOD_AAL_Msk                                         (0x1UL << ETH_DMABMOD_AAL_Pos)                                 /*!< 0x02000000 */
#define ETH_DMABMOD_AAL                                             ETH_DMABMOD_AAL_Msk                                            /* Address-Aligned beats */
#define ETH_DMABMOD_PBLx4_Pos                                       (24U)
#define ETH_DMABMOD_PBLx4_Msk                                       (0x1UL << ETH_DMABMOD_PBLx4_Pos)                               /*!< 0x01000000 */
#define ETH_DMABMOD_PBLx4                                           ETH_DMABMOD_PBLx4_Msk                                          /* 4xPBL mode */
#define ETH_DMABMOD_USP_Pos                                         (23U)
#define ETH_DMABMOD_USP_Msk                                         (0x1UL << ETH_DMABMOD_USP_Pos)                                 /*!< 0x00800000 */
#define ETH_DMABMOD_USP                                             ETH_DMABMOD_USP_Msk                                            /* Use separate PBL */
#define ETH_DMABMOD_RPBL_Pos                                        (17U)
#define ETH_DMABMOD_RPBL_Msk                                        (0x3FUL << ETH_DMABMOD_RPBL_Pos)                               /*!< 0x007E0000 */
#define ETH_DMABMOD_RPBL                                            ETH_DMABMOD_RPBL_Msk                                           /* RxDMA PBL */
#define ETH_DMABMOD_RPBL_1Beat                                      0x00020000U                                                    /* maximum number of beats to be transferred in one RxDMA transaction is 1 */
#define ETH_DMABMOD_RPBL_2Beat                                      0x00040000U                                                    /* maximum number of beats to be transferred in one RxDMA transaction is 2 */
#define ETH_DMABMOD_RPBL_4Beat                                      0x00080000U                                                    /* maximum number of beats to be transferred in one RxDMA transaction is 4 */
#define ETH_DMABMOD_RPBL_8Beat                                      0x00100000U                                                    /* maximum number of beats to be transferred in one RxDMA transaction is 8 */
#define ETH_DMABMOD_RPBL_16Beat                                     0x00200000U                                                    /* maximum number of beats to be transferred in one RxDMA transaction is 16 */
#define ETH_DMABMOD_RPBL_32Beat                                     0x00400000U                                                    /* maximum number of beats to be transferred in one RxDMA transaction is 32 */
#define ETH_DMABMOD_RPBL_4xPBL_4Beat                                0x01020000U                                                    /* maximum number of beats to be transferred in one RxDMA transaction is 4 */
#define ETH_DMABMOD_RPBL_4xPBL_8Beat                                0x01040000U                                                    /* maximum number of beats to be transferred in one RxDMA transaction is 8 */
#define ETH_DMABMOD_RPBL_4xPBL_16Beat                               0x01080000U                                                    /* maximum number of beats to be transferred in one RxDMA transaction is 16 */
#define ETH_DMABMOD_RPBL_4xPBL_32Beat                               0x01100000U                                                    /* maximum number of beats to be transferred in one RxDMA transaction is 32 */
#define ETH_DMABMOD_RPBL_4xPBL_64Beat                               0x01200000U                                                    /* maximum number of beats to be transferred in one RxDMA transaction is 64 */
#define ETH_DMABMOD_RPBL_4xPBL_128Beat                              0x01400000U                                                    /* maximum number of beats to be transferred in one RxDMA transaction is 128 */
#define ETH_DMABMOD_FB_Pos                                          (16U)
#define ETH_DMABMOD_FB_Msk                                          (0x1UL << ETH_DMABMOD_FB_Pos)                                  /*!< 0x00010000 */
#define ETH_DMABMOD_FB                                              ETH_DMABMOD_FB_Msk                                             /* Fixed Burst */
#define ETH_DMABMOD_PR_Pos                                          (14U)
#define ETH_DMABMOD_PR_Msk                                          (0x3UL << ETH_DMABMOD_PR_Pos)                                  /*!< 0x0000C000 */
#define ETH_DMABMOD_PR                                              ETH_DMABMOD_PR_Msk                                             /* Rx Tx priority ratio */
#define ETH_DMABMOD_PR_1_1                                          0x00000000U                                                    /* Rx Tx priority ratio */
#define ETH_DMABMOD_PR_2_1                                          0x00004000U                                                    /* Rx Tx priority ratio */
#define ETH_DMABMOD_PR_3_1                                          0x00008000U                                                    /* Rx Tx priority ratio */
#define ETH_DMABMOD_PR_4_1                                          0x0000C000U                                                    /* Rx Tx priority ratio */
#define ETH_DMABMOD_PBL_Pos                                         (8U)
#define ETH_DMABMOD_PBL_Msk                                         (0x3FUL << ETH_DMABMOD_PBL_Pos)                                /*!< 0x00003F00 */
#define ETH_DMABMOD_PBL                                             ETH_DMABMOD_PBL_Msk                                            /* Programmable burst length */
#define ETH_DMABMOD_PBL_1Beat                                       0x00000100U                                                    /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 1 */
#define ETH_DMABMOD_PBL_2Beat                                       0x00000200U                                                    /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 2 */
#define ETH_DMABMOD_PBL_4Beat                                       0x00000400U                                                    /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 4 */
#define ETH_DMABMOD_PBL_8Beat                                       0x00000800U                                                    /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 8 */
#define ETH_DMABMOD_PBL_16Beat                                      0x00001000U                                                    /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 16 */
#define ETH_DMABMOD_PBL_32Beat                                      0x00002000U                                                    /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 32 */
#define ETH_DMABMOD_PBL_4xPBL_4Beat                                 0x01000100U                                                    /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 4 */
#define ETH_DMABMOD_PBL_4xPBL_8Beat                                 0x01000200U                                                    /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 8 */
#define ETH_DMABMOD_PBL_4xPBL_16Beat                                0x01000400U                                                    /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 16 */
#define ETH_DMABMOD_PBL_4xPBL_32Beat                                0x01000800U                                                    /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 32 */
#define ETH_DMABMOD_PBL_4xPBL_64Beat                                0x01001000U                                                    /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 64 */
#define ETH_DMABMOD_PBL_4xPBL_128Beat                               0x01002000U                                                    /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 128 */
#define ETH_DMABMOD_EDFEN_Pos                                       (7U)
#define ETH_DMABMOD_EDFEN_Msk                                       (0x1UL << ETH_DMABMOD_EDFEN_Pos)                               /*!< 0x00000080 */
#define ETH_DMABMOD_EDFEN                                           ETH_DMABMOD_EDFEN_Msk                                          /* Enhanced Descriptor Enable */
#define ETH_DMABMOD_DSL_Pos                                         (2U)
#define ETH_DMABMOD_DSL_Msk                                         (0x1FUL << ETH_DMABMOD_DSL_Pos)                                /*!< 0x0000007C */
#define ETH_DMABMOD_DSL                                             ETH_DMABMOD_DSL_Msk                                            /* Descriptor Skip Length */
#define ETH_DMABMOD_DAS_Pos                                         (1U)
#define ETH_DMABMOD_DAS_Msk                                         (0x1UL << ETH_DMABMOD_DAS_Pos)                                 /*!< 0x00000002 */
#define ETH_DMABMOD_DAS                                             ETH_DMABMOD_DAS_Msk                                            /* DMA arbitration scheme */
#define ETH_DMABMOD_SWR_Pos                                         (0U)
#define ETH_DMABMOD_SWR_Msk                                         (0x1UL << ETH_DMABMOD_SWR_Pos)                                 /*!< 0x00000001 */
#define ETH_DMABMOD_SWR                                             ETH_DMABMOD_SWR_Msk                                            /* Software reset */

