kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f427xx.h
/* Bit definition for Ethernet DMA Interrupt Enable Register */
#define ETH_DMAINTEN_NINTSEN_Pos                                    (16U)
#define ETH_DMAINTEN_NINTSEN_Msk                                    (0x1UL << ETH_DMAINTEN_NINTSEN_Pos)                            /*!< 0x00010000 */
#define ETH_DMAINTEN_NINTSEN                                        ETH_DMAINTEN_NINTSEN_Msk                                       /* Normal interrupt summary enable */
#define ETH_DMAINTEN_AINTSEN_Pos                                    (15U)
#define ETH_DMAINTEN_AINTSEN_Msk                                    (0x1UL << ETH_DMAINTEN_AINTSEN_Pos)                            /*!< 0x00008000 */
#define ETH_DMAINTEN_AINTSEN                                        ETH_DMAINTEN_AINTSEN_Msk                                       /* Abnormal interrupt summary enable */
#define ETH_DMAINTEN_ERXIEN_Pos                                     (14U)
#define ETH_DMAINTEN_ERXIEN_Msk                                     (0x1UL << ETH_DMAINTEN_ERXIEN_Pos)                             /*!< 0x00004000 */
#define ETH_DMAINTEN_ERXIEN                                         ETH_DMAINTEN_ERXIEN_Msk                                        /* Early receive interrupt enable */
#define ETH_DMAINTEN_FBERREN_Pos                                    (13U)
#define ETH_DMAINTEN_FBERREN_Msk                                    (0x1UL << ETH_DMAINTEN_FBERREN_Pos)                            /*!< 0x00002000 */
#define ETH_DMAINTEN_FBERREN                                        ETH_DMAINTEN_FBERREN_Msk                                       /* Fatal bus error interrupt enable */
#define ETH_DMAINTEN_ETXIEN_Pos                                     (10U)
#define ETH_DMAINTEN_ETXIEN_Msk                                     (0x1UL << ETH_DMAINTEN_ETXIEN_Pos)                             /*!< 0x00000400 */
#define ETH_DMAINTEN_ETXIEN                                         ETH_DMAINTEN_ETXIEN_Msk                                        /* Early transmit interrupt enable */
#define ETH_DMAINTEN_RXWTOEN_Pos                                    (9U)
#define ETH_DMAINTEN_RXWTOEN_Msk                                    (0x1UL << ETH_DMAINTEN_RXWTOEN_Pos)                            /*!< 0x00000200 */
#define ETH_DMAINTEN_RXWTOEN                                        ETH_DMAINTEN_RXWTOEN_Msk                                       /* Receive watchdog timeout interrupt enable */
#define ETH_DMAINTEN_RXSEN_Pos                                      (8U)
#define ETH_DMAINTEN_RXSEN_Msk                                      (0x1UL << ETH_DMAINTEN_RXSEN_Pos)                              /*!< 0x00000100 */
#define ETH_DMAINTEN_RXSEN                                          ETH_DMAINTEN_RXSEN_Msk                                         /* Receive process stopped interrupt enable */
#define ETH_DMAINTEN_RXBUEN_Pos                                     (7U)
#define ETH_DMAINTEN_RXBUEN_Msk                                     (0x1UL << ETH_DMAINTEN_RXBUEN_Pos)                             /*!< 0x00000080 */
#define ETH_DMAINTEN_RXBUEN                                         ETH_DMAINTEN_RXBUEN_Msk                                        /* Receive buffer unavailable interrupt enable */
#define ETH_DMAINTEN_RXIEN_Pos                                      (6U)
#define ETH_DMAINTEN_RXIEN_Msk                                      (0x1UL << ETH_DMAINTEN_RXIEN_Pos)                              /*!< 0x00000040 */
#define ETH_DMAINTEN_RXIEN                                          ETH_DMAINTEN_RXIEN_Msk                                         /* Receive interrupt enable */
#define ETH_DMAINTEN_TXUNFEN_Pos                                    (5U)
#define ETH_DMAINTEN_TXUNFEN_Msk                                    (0x1UL << ETH_DMAINTEN_TXUNFEN_Pos)                            /*!< 0x00000020 */
#define ETH_DMAINTEN_TXUNFEN                                        ETH_DMAINTEN_TXUNFEN_Msk                                       /* Transmit Underflow interrupt enable */
#define ETH_DMAINTEN_RXOVFEN_Pos                                    (4U)
#define ETH_DMAINTEN_RXOVFEN_Msk                                    (0x1UL << ETH_DMAINTEN_RXOVFEN_Pos)                            /*!< 0x00000010 */
#define ETH_DMAINTEN_RXOVFEN                                        ETH_DMAINTEN_RXOVFEN_Msk                                       /* Receive Overflow interrupt enable */
#define ETH_DMAINTEN_TXJTOEN_Pos                                    (3U)
#define ETH_DMAINTEN_TXJTOEN_Msk                                    (0x1UL << ETH_DMAINTEN_TXJTOEN_Pos)                            /*!< 0x00000008 */
#define ETH_DMAINTEN_TXJTOEN                                        ETH_DMAINTEN_TXJTOEN_Msk                                       /* Transmit jabber timeout interrupt enable */
#define ETH_DMAINTEN_TXBUEN_Pos                                     (2U)
#define ETH_DMAINTEN_TXBUEN_Msk                                     (0x1UL << ETH_DMAINTEN_TXBUEN_Pos)                             /*!< 0x00000004 */
#define ETH_DMAINTEN_TXBUEN                                         ETH_DMAINTEN_TXBUEN_Msk                                        /* Transmit buffer unavailable interrupt enable */
#define ETH_DMAINTEN_TXSEN_Pos                                      (1U)
#define ETH_DMAINTEN_TXSEN_Msk                                      (0x1UL << ETH_DMAINTEN_TXSEN_Pos)                              /*!< 0x00000002 */
#define ETH_DMAINTEN_TXSEN                                          ETH_DMAINTEN_TXSEN_Msk                                         /* Transmit process stopped interrupt enable */
#define ETH_DMAINTEN_TXIEN_Pos                                      (0U)
#define ETH_DMAINTEN_TXIEN_Msk                                      (0x1UL << ETH_DMAINTEN_TXIEN_Pos)                              /*!< 0x00000001 */
#define ETH_DMAINTEN_TXIEN                                          ETH_DMAINTEN_TXIEN_Msk                                         /* Transmit interrupt enable */

/* Bit definition for Ethernet DMA Missed Frame and Buffer Overflow Counter Register */
#define ETH_DMAMFABOCNT_OVFCNTOVF_Pos                               (28U)
#define ETH_DMAMFABOCNT_OVFCNTOVF_Msk                               (0x1UL << ETH_DMAMFABOCNT_OVFCNTOVF_Pos)                       /*!< 0x10000000 */
#define ETH_DMAMFABOCNT_OVFCNTOVF                                   ETH_DMAMFABOCNT_OVFCNTOVF_Msk                                  /* Overflow bit for FIFO overflow counter */
#define ETH_DMAMFABOCNT_AMISFCNT_Pos                                (17U)
#define ETH_DMAMFABOCNT_AMISFCNT_Msk                                (0x7FFUL << ETH_DMAMFABOCNT_AMISFCNT_Pos)                      /*!< 0x0FFE0000 */
#define ETH_DMAMFABOCNT_AMISFCNT                                    ETH_DMAMFABOCNT_AMISFCNT_Msk                                   /* Number of frames missed by the application */
#define ETH_DMAMFABOCNT_MISFCNTOVF_Pos                              (16U)
#define ETH_DMAMFABOCNT_MISFCNTOVF_Msk                              (0x1UL << ETH_DMAMFABOCNT_MISFCNTOVF_Pos)                      /*!< 0x00010000 */
#define ETH_DMAMFABOCNT_MISFCNTOVF                                  ETH_DMAMFABOCNT_MISFCNTOVF_Msk                                 /* Overflow bit for missed frame counter */
#define ETH_DMAMFABOCNT_MISFCNT_Pos                                 (0U)
#define ETH_DMAMFABOCNT_MISFCNT_Msk                                 (0xFFFFUL << ETH_DMAMFABOCNT_MISFCNT_Pos)                      /*!< 0x0000FFFF */
#define ETH_DMAMFABOCNT_MISFCNT                                     ETH_DMAMFABOCNT_MISFCNT_Msk                                    /* Number of frames missed by the controller */

/* Bit definition for Ethernet DMA Current Host Transmit Descriptor Register */
#define ETH_DMAHTXD_HTXDADDRP_Pos                                   (0U)
#define ETH_DMAHTXD_HTXDADDRP_Msk                                   (0xFFFFFFFFUL << ETH_DMAHTXD_HTXDADDRP_Pos)                    /*!< 0xFFFFFFFF */
#define ETH_DMAHTXD_HTXDADDRP                                       ETH_DMAHTXD_HTXDADDRP_Msk                                      /* Host transmit descriptor address pointer */

