kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f427xx.h
/********************  Bit definition for USB_OTG_GRSTCTRL register  ********************/
#define USB_OTG_GRSTCTRL_CSRST_Pos                                  (0U)
#define USB_OTG_GRSTCTRL_CSRST_Msk                                  (0x1UL << USB_OTG_GRSTCTRL_CSRST_Pos)                          /*!< 0x00000001 */
#define USB_OTG_GRSTCTRL_CSRST                                      USB_OTG_GRSTCTRL_CSRST_Msk                                     /*!< Core soft reset          */
#define USB_OTG_GRSTCTRL_HSRST_Pos                                  (1U)
#define USB_OTG_GRSTCTRL_HSRST_Msk                                  (0x1UL << USB_OTG_GRSTCTRL_HSRST_Pos)                          /*!< 0x00000002 */
#define USB_OTG_GRSTCTRL_HSRST                                      USB_OTG_GRSTCTRL_HSRST_Msk                                     /*!< HCLK soft reset          */
#define USB_OTG_GRSTCTRL_HFCNTRST_Pos                               (2U)
#define USB_OTG_GRSTCTRL_HFCNTRST_Msk                               (0x1UL << USB_OTG_GRSTCTRL_HFCNTRST_Pos)                       /*!< 0x00000004 */
#define USB_OTG_GRSTCTRL_HFCNTRST                                   USB_OTG_GRSTCTRL_HFCNTRST_Msk                                  /*!< Host frame counter reset */
#define USB_OTG_GRSTCTRL_RXFFLU_Pos                                 (4U)
#define USB_OTG_GRSTCTRL_RXFFLU_Msk                                 (0x1UL << USB_OTG_GRSTCTRL_RXFFLU_Pos)                         /*!< 0x00000010 */
#define USB_OTG_GRSTCTRL_RXFFLU                                     USB_OTG_GRSTCTRL_RXFFLU_Msk                                    /*!< RxFIFO flush             */
#define USB_OTG_GRSTCTRL_TXFFLU_Pos                                 (5U)
#define USB_OTG_GRSTCTRL_TXFFLU_Msk                                 (0x1UL << USB_OTG_GRSTCTRL_TXFFLU_Pos)                         /*!< 0x00000020 */
#define USB_OTG_GRSTCTRL_TXFFLU                                     USB_OTG_GRSTCTRL_TXFFLU_Msk                                    /*!< TxFIFO flush             */


#define USB_OTG_GRSTCTRL_TXFNUM_Pos                                 (6U)
#define USB_OTG_GRSTCTRL_TXFNUM_Msk                                 (0x1FUL << USB_OTG_GRSTCTRL_TXFNUM_Pos)                        /*!< 0x000007C0 */
#define USB_OTG_GRSTCTRL_TXFNUM                                     USB_OTG_GRSTCTRL_TXFNUM_Msk                                    /*!< TxFIFO number */
#define USB_OTG_GRSTCTRL_TXFNUM_0                                   (0x01UL << USB_OTG_GRSTCTRL_TXFNUM_Pos)                        /*!< 0x00000040 */
#define USB_OTG_GRSTCTRL_TXFNUM_1                                   (0x02UL << USB_OTG_GRSTCTRL_TXFNUM_Pos)                        /*!< 0x00000080 */
#define USB_OTG_GRSTCTRL_TXFNUM_2                                   (0x04UL << USB_OTG_GRSTCTRL_TXFNUM_Pos)                        /*!< 0x00000100 */
#define USB_OTG_GRSTCTRL_TXFNUM_3                                   (0x08UL << USB_OTG_GRSTCTRL_TXFNUM_Pos)                        /*!< 0x00000200 */
#define USB_OTG_GRSTCTRL_TXFNUM_4                                   (0x10UL << USB_OTG_GRSTCTRL_TXFNUM_Pos)                        /*!< 0x00000400 */
#define USB_OTG_GRSTCTRL_DMAREQ_Pos                                 (30U)
#define USB_OTG_GRSTCTRL_DMAREQ_Msk                                 (0x1UL << USB_OTG_GRSTCTRL_DMAREQ_Pos)                         /*!< 0x40000000 */
#define USB_OTG_GRSTCTRL_DMAREQ                                     USB_OTG_GRSTCTRL_DMAREQ_Msk                                    /*!< DMA request signal */
#define USB_OTG_GRSTCTRL_AHBMIDL_Pos                                (31U)
#define USB_OTG_GRSTCTRL_AHBMIDL_Msk                                (0x1UL << USB_OTG_GRSTCTRL_AHBMIDL_Pos)                        /*!< 0x80000000 */
#define USB_OTG_GRSTCTRL_AHBMIDL                                    USB_OTG_GRSTCTRL_AHBMIDL_Msk                                   /*!< AHB master idle */

/********************  Bit definition for USB_OTG_DINIMASK register  ********************/
#define USB_OTG_DINIMASK_TSFCMPM_Pos                                (0U)
#define USB_OTG_DINIMASK_TSFCMPM_Msk                                (0x1UL << USB_OTG_DINIMASK_TSFCMPM_Pos)                        /*!< 0x00000001 */
#define USB_OTG_DINIMASK_TSFCMPM                                    USB_OTG_DINIMASK_TSFCMPM_Msk                                   /*!< Transfer completed interrupt mask                 */
#define USB_OTG_DINIMASK_EPDISM_Pos                                 (1U)
#define USB_OTG_DINIMASK_EPDISM_Msk                                 (0x1UL << USB_OTG_DINIMASK_EPDISM_Pos)                         /*!< 0x00000002 */
#define USB_OTG_DINIMASK_EPDISM                                     USB_OTG_DINIMASK_EPDISM_Msk                                    /*!< Endpoint disabled interrupt mask                  */
#define USB_OTG_DINIMASK_TOM_Pos                                    (3U)
#define USB_OTG_DINIMASK_TOM_Msk                                    (0x1UL << USB_OTG_DINIMASK_TOM_Pos)                            /*!< 0x00000008 */
#define USB_OTG_DINIMASK_TOM                                        USB_OTG_DINIMASK_TOM_Msk                                       /*!< Timeout condition mask (nonisochronous endpoints) */
#define USB_OTG_DINIMASK_ITXEMPM_Pos                                (4U)
#define USB_OTG_DINIMASK_ITXEMPM_Msk                                (0x1UL << USB_OTG_DINIMASK_ITXEMPM_Pos)                        /*!< 0x00000010 */
#define USB_OTG_DINIMASK_ITXEMPM                                    USB_OTG_DINIMASK_ITXEMPM_Msk                                   /*!< IN token received when TxFIFO empty mask          */
#define USB_OTG_DINIMASK_IEPMMM_Pos                                 (5U)
#define USB_OTG_DINIMASK_IEPMMM_Msk                                 (0x1UL << USB_OTG_DINIMASK_IEPMMM_Pos)                         /*!< 0x00000020 */
#define USB_OTG_DINIMASK_IEPMMM                                     USB_OTG_DINIMASK_IEPMMM_Msk                                    /*!< IN token received with EP mismatch mask           */
#define USB_OTG_DINIMASK_IEPNAKEM_Pos                               (6U)
#define USB_OTG_DINIMASK_IEPNAKEM_Msk                               (0x1UL << USB_OTG_DINIMASK_IEPNAKEM_Pos)                       /*!< 0x00000040 */
#define USB_OTG_DINIMASK_IEPNAKEM                                   USB_OTG_DINIMASK_IEPNAKEM_Msk                                  /*!< IN endpoint NAK effective mask                    */
#define USB_OTG_DINIMASK_FUDRM_Pos                                  (8U)
#define USB_OTG_DINIMASK_FUDRM_Msk                                  (0x1UL << USB_OTG_DINIMASK_FUDRM_Pos)                          /*!< 0x00000100 */
#define USB_OTG_DINIMASK_FUDRM                                      USB_OTG_DINIMASK_FUDRM_Msk                                     /*!< FIFO underrun mask                                */
#define USB_OTG_DINIMASK_BNAM_Pos                                   (9U)
#define USB_OTG_DINIMASK_BNAM_Msk                                   (0x1UL << USB_OTG_DINIMASK_BNAM_Pos)                           /*!< 0x00000200 */
#define USB_OTG_DINIMASK_BNAM                                       USB_OTG_DINIMASK_BNAM_Msk                                      /*!< BNA interrupt mask                                */

/********************  Bit definition for USB_OTG_HPTXSTS register  ********************/
#define USB_OTG_HPTXSTS_FSPACE_Pos                                  (0U)
#define USB_OTG_HPTXSTS_FSPACE_Msk                                  (0xFFFFUL << USB_OTG_HPTXSTS_FSPACE_Pos)                       /*!< 0x0000FFFF */
#define USB_OTG_HPTXSTS_FSPACE                                      USB_OTG_HPTXSTS_FSPACE_Msk                                     /*!< Periodic transmit data FIFO space available     */
#define USB_OTG_HPTXSTS_QSPACE_Pos                                  (16U)
#define USB_OTG_HPTXSTS_QSPACE_Msk                                  (0xFFUL << USB_OTG_HPTXSTS_QSPACE_Pos)                         /*!< 0x00FF0000 */
#define USB_OTG_HPTXSTS_QSPACE                                      USB_OTG_HPTXSTS_QSPACE_Msk                                     /*!< Periodic transmit request queue space available */
#define USB_OTG_HPTXSTS_QSPACE_0                                    (0x01UL << USB_OTG_HPTXSTS_QSPACE_Pos)                         /*!< 0x00010000 */
#define USB_OTG_HPTXSTS_QSPACE_1                                    (0x02UL << USB_OTG_HPTXSTS_QSPACE_Pos)                         /*!< 0x00020000 */
#define USB_OTG_HPTXSTS_QSPACE_2                                    (0x04UL << USB_OTG_HPTXSTS_QSPACE_Pos)                         /*!< 0x00040000 */
#define USB_OTG_HPTXSTS_QSPACE_3                                    (0x08UL << USB_OTG_HPTXSTS_QSPACE_Pos)                         /*!< 0x00080000 */
#define USB_OTG_HPTXSTS_QSPACE_4                                    (0x10UL << USB_OTG_HPTXSTS_QSPACE_Pos)                         /*!< 0x00100000 */
#define USB_OTG_HPTXSTS_QSPACE_5                                    (0x20UL << USB_OTG_HPTXSTS_QSPACE_Pos)                         /*!< 0x00200000 */
#define USB_OTG_HPTXSTS_QSPACE_6                                    (0x40UL << USB_OTG_HPTXSTS_QSPACE_Pos)                         /*!< 0x00400000 */
#define USB_OTG_HPTXSTS_QSPACE_7                                    (0x80UL << USB_OTG_HPTXSTS_QSPACE_Pos)                         /*!< 0x00800000 */

