kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f427xx.h
#define USB_OTG_DIEPCTRL_TXFNUM_Pos                                 (22U)
#define USB_OTG_DIEPCTRL_TXFNUM_Msk                                 (0xFUL << USB_OTG_DIEPCTRL_TXFNUM_Pos)                         /*!< 0x03C00000 */
#define USB_OTG_DIEPCTRL_TXFNUM                                     USB_OTG_DIEPCTRL_TXFNUM_Msk                                    /*!< TxFIFO number                    */
#define USB_OTG_DIEPCTRL_TXFNUM_0                                   (0x1UL << USB_OTG_DIEPCTRL_TXFNUM_Pos)                         /*!< 0x00400000 */
#define USB_OTG_DIEPCTRL_TXFNUM_1                                   (0x2UL << USB_OTG_DIEPCTRL_TXFNUM_Pos)                         /*!< 0x00800000 */
#define USB_OTG_DIEPCTRL_TXFNUM_2                                   (0x4UL << USB_OTG_DIEPCTRL_TXFNUM_Pos)                         /*!< 0x01000000 */
#define USB_OTG_DIEPCTRL_TXFNUM_3                                   (0x8UL << USB_OTG_DIEPCTRL_TXFNUM_Pos)                         /*!< 0x02000000 */
#define USB_OTG_DIEPCTRL_NAKCLR_Pos                                 (26U)
#define USB_OTG_DIEPCTRL_NAKCLR_Msk                                 (0x1UL << USB_OTG_DIEPCTRL_NAKCLR_Pos)                         /*!< 0x04000000 */
#define USB_OTG_DIEPCTRL_NAKCLR                                     USB_OTG_DIEPCTRL_NAKCLR_Msk                                    /*!< Clear NAK                        */
#define USB_OTG_DIEPCTRL_NAKSET_Pos                                 (27U)
#define USB_OTG_DIEPCTRL_NAKSET_Msk                                 (0x1UL << USB_OTG_DIEPCTRL_NAKSET_Pos)                         /*!< 0x08000000 */
#define USB_OTG_DIEPCTRL_NAKSET                                     USB_OTG_DIEPCTRL_NAKSET_Msk                                    /*!< Set NAK */
#define USB_OTG_DIEPCTRL_DPIDSET_Pos                                (28U)
#define USB_OTG_DIEPCTRL_DPIDSET_Msk                                (0x1UL << USB_OTG_DIEPCTRL_DPIDSET_Pos)                        /*!< 0x10000000 */
#define USB_OTG_DIEPCTRL_DPIDSET                                    USB_OTG_DIEPCTRL_DPIDSET_Msk                                   /*!< Set DATA0 PID                    */
#define USB_OTG_DIEPCTRL_OFSET_Pos                                  (29U)
#define USB_OTG_DIEPCTRL_OFSET_Msk                                  (0x1UL << USB_OTG_DIEPCTRL_OFSET_Pos)                          /*!< 0x20000000 */
#define USB_OTG_DIEPCTRL_OFSET                                      USB_OTG_DIEPCTRL_OFSET_Msk                                     /*!< Set odd frame                    */
#define USB_OTG_DIEPCTRL_EPDIS_Pos                                  (30U)
#define USB_OTG_DIEPCTRL_EPDIS_Msk                                  (0x1UL << USB_OTG_DIEPCTRL_EPDIS_Pos)                          /*!< 0x40000000 */
#define USB_OTG_DIEPCTRL_EPDIS                                      USB_OTG_DIEPCTRL_EPDIS_Msk                                     /*!< Endpoint disable                 */
#define USB_OTG_DIEPCTRL_EPEN_Pos                                   (31U)
#define USB_OTG_DIEPCTRL_EPEN_Msk                                   (0x1UL << USB_OTG_DIEPCTRL_EPEN_Pos)                           /*!< 0x80000000 */
#define USB_OTG_DIEPCTRL_EPEN                                       USB_OTG_DIEPCTRL_EPEN_Msk                                      /*!< Endpoint enable                  */

/********************  Bit definition for USB_OTG_HCH register  ********************/
#define USB_OTG_HCH_MAXPSIZE_Pos                                    (0U)
#define USB_OTG_HCH_MAXPSIZE_Msk                                    (0x7FFUL << USB_OTG_HCH_MAXPSIZE_Pos)                          /*!< 0x000007FF */
#define USB_OTG_HCH_MAXPSIZE                                        USB_OTG_HCH_MAXPSIZE_Msk                                       /*!< Maximum packet size */

#define USB_OTG_HCH_EDPNUM_Pos                                      (11U)
#define USB_OTG_HCH_EDPNUM_Msk                                      (0xFUL << USB_OTG_HCH_EDPNUM_Pos)                              /*!< 0x00007800 */
#define USB_OTG_HCH_EDPNUM                                          USB_OTG_HCH_EDPNUM_Msk                                         /*!< Endpoint number */
#define USB_OTG_HCH_EDPNUM_0                                        (0x1UL << USB_OTG_HCH_EDPNUM_Pos)                              /*!< 0x00000800 */
#define USB_OTG_HCH_EDPNUM_1                                        (0x2UL << USB_OTG_HCH_EDPNUM_Pos)                              /*!< 0x00001000 */
#define USB_OTG_HCH_EDPNUM_2                                        (0x4UL << USB_OTG_HCH_EDPNUM_Pos)                              /*!< 0x00002000 */
#define USB_OTG_HCH_EDPNUM_3                                        (0x8UL << USB_OTG_HCH_EDPNUM_Pos)                              /*!< 0x00004000 */
#define USB_OTG_HCH_EDPDRT_Pos                                      (15U)
#define USB_OTG_HCH_EDPDRT_Msk                                      (0x1UL << USB_OTG_HCH_EDPDRT_Pos)                              /*!< 0x00008000 */
#define USB_OTG_HCH_EDPDRT                                          USB_OTG_HCH_EDPDRT_Msk                                         /*!< Endpoint direction */
#define USB_OTG_HCH_LSDV_Pos                                        (17U)
#define USB_OTG_HCH_LSDV_Msk                                        (0x1UL << USB_OTG_HCH_LSDV_Pos)                                /*!< 0x00020000 */
#define USB_OTG_HCH_LSDV                                            USB_OTG_HCH_LSDV_Msk                                           /*!< Low-speed device */

#define USB_OTG_HCH_EDPTYP_Pos                                      (18U)
#define USB_OTG_HCH_EDPTYP_Msk                                      (0x3UL << USB_OTG_HCH_EDPTYP_Pos)                              /*!< 0x000C0000 */
#define USB_OTG_HCH_EDPTYP                                          USB_OTG_HCH_EDPTYP_Msk                                         /*!< Endpoint type */
#define USB_OTG_HCH_EDPTYP_0                                        (0x1UL << USB_OTG_HCH_EDPTYP_Pos)                              /*!< 0x00040000 */
#define USB_OTG_HCH_EDPTYP_1                                        (0x2UL << USB_OTG_HCH_EDPTYP_Pos)                              /*!< 0x00080000 */

