kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f427xx.h
/********************  Bit definition for USB_OTG_HCHDMA register  ********************/
#define USB_OTG_HCHDMA_ADDR_Pos                                     (0U)
#define USB_OTG_HCHDMA_ADDR_Msk                                     (0xFFFFFFFFUL << USB_OTG_HCHDMA_ADDR_Pos)                      /*!< 0xFFFFFFFF */
#define USB_OTG_HCHDMA_ADDR                                         USB_OTG_HCHDMA_ADDR_Msk                                        /*!< DMA address */

/********************  Bit definition for USB_OTG_DITXFSTS register  ********************/
#define USB_OTG_DITXFSTS_INEPTXFSA_Pos                              (0U)
#define USB_OTG_DITXFSTS_INEPTXFSA_Msk                              (0xFFFFUL << USB_OTG_DITXFSTS_INEPTXFSA_Pos)                   /*!< 0x0000FFFF */
#define USB_OTG_DITXFSTS_INEPTXFSA                                  USB_OTG_DITXFSTS_INEPTXFSA_Msk                                 /*!< IN endpoint TxFIFO space available */

/********************  Bit definition for USB_OTG_DTXFIFO register  ********************/
#define USB_OTG_DTXFIFO_INEPTXFRSA_Pos                              (0U)
#define USB_OTG_DTXFIFO_INEPTXFRSA_Msk                              (0xFFFFUL << USB_OTG_DTXFIFO_INEPTXFRSA_Pos)                   /*!< 0x0000FFFF */
#define USB_OTG_DTXFIFO_INEPTXFRSA                                  USB_OTG_DTXFIFO_INEPTXFRSA_Msk                                 /*!< IN endpoint FIFOx transmit RAM start address */
#define USB_OTG_DTXFIFO_INEPTXFDEP_Pos                              (16U)
#define USB_OTG_DTXFIFO_INEPTXFDEP_Msk                              (0xFFFFUL << USB_OTG_DTXFIFO_INEPTXFDEP_Pos)                   /*!< 0xFFFF0000 */
#define USB_OTG_DTXFIFO_INEPTXFDEP                                  USB_OTG_DTXFIFO_INEPTXFDEP_Msk                                 /*!< IN endpoint TxFIFO depth */

/********************  Bit definition for USB_OTG_DOEPCTRL register  ********************/

#define USB_OTG_DOEPCTRL_MAXPS_Pos                                  (0U)
#define USB_OTG_DOEPCTRL_MAXPS_Msk                                  (0x7FFUL << USB_OTG_DOEPCTRL_MAXPS_Pos)                        /*!< 0x000007FF */
#define USB_OTG_DOEPCTRL_MAXPS                                      USB_OTG_DOEPCTRL_MAXPS_Msk                                     /*!< Maximum packet size */          /*!<Bit 1 */
#define USB_OTG_DOEPCTRL_USBAEP_Pos                                 (15U)
#define USB_OTG_DOEPCTRL_USBAEP_Msk                                 (0x1UL << USB_OTG_DOEPCTRL_USBAEP_Pos)                         /*!< 0x00008000 */
#define USB_OTG_DOEPCTRL_USBAEP                                     USB_OTG_DOEPCTRL_USBAEP_Msk                                    /*!< USB active endpoint */
#define USB_OTG_DOEPCTRL_NAKSTS_Pos                                 (17U)
#define USB_OTG_DOEPCTRL_NAKSTS_Msk                                 (0x1UL << USB_OTG_DOEPCTRL_NAKSTS_Pos)                         /*!< 0x00020000 */
#define USB_OTG_DOEPCTRL_NAKSTS                                     USB_OTG_DOEPCTRL_NAKSTS_Msk                                    /*!< NAK status */
#define USB_OTG_DOEPCTRL_DPIDSET_Pos                                (28U)
#define USB_OTG_DOEPCTRL_DPIDSET_Msk                                (0x1UL << USB_OTG_DOEPCTRL_DPIDSET_Pos)                        /*!< 0x10000000 */
#define USB_OTG_DOEPCTRL_DPIDSET                                    USB_OTG_DOEPCTRL_DPIDSET_Msk                                   /*!< Set DATA0 PID */
#define USB_OTG_DOEPCTRL_OFSET_Pos                                  (29U)
#define USB_OTG_DOEPCTRL_OFSET_Msk                                  (0x1UL << USB_OTG_DOEPCTRL_OFSET_Pos)                          /*!< 0x20000000 */
#define USB_OTG_DOEPCTRL_OFSET                                      USB_OTG_DOEPCTRL_OFSET_Msk                                     /*!< Set odd frame */
#define USB_OTG_DOEPCTRL_EPTYPE_Pos                                 (18U)
#define USB_OTG_DOEPCTRL_EPTYPE_Msk                                 (0x3UL << USB_OTG_DOEPCTRL_EPTYPE_Pos)                         /*!< 0x000C0000 */
#define USB_OTG_DOEPCTRL_EPTYPE                                     USB_OTG_DOEPCTRL_EPTYPE_Msk                                    /*!< Endpoint type */
#define USB_OTG_DOEPCTRL_EPTYPE_0                                   (0x1UL << USB_OTG_DOEPCTRL_EPTYPE_Pos)                         /*!< 0x00040000 */
#define USB_OTG_DOEPCTRL_EPTYPE_1                                   (0x2UL << USB_OTG_DOEPCTRL_EPTYPE_Pos)                         /*!< 0x00080000 */
#define USB_OTG_DOEPCTRL_SNMEN_Pos                                  (20U)
#define USB_OTG_DOEPCTRL_SNMEN_Msk                                  (0x1UL << USB_OTG_DOEPCTRL_SNMEN_Pos)                          /*!< 0x00100000 */
#define USB_OTG_DOEPCTRL_SNMEN                                      USB_OTG_DOEPCTRL_SNMEN_Msk                                     /*!< Snoop mode */
#define USB_OTG_DOEPCTRL_STALLH_Pos                                 (21U)
#define USB_OTG_DOEPCTRL_STALLH_Msk                                 (0x1UL << USB_OTG_DOEPCTRL_STALLH_Pos)                         /*!< 0x00200000 */
#define USB_OTG_DOEPCTRL_STALLH                                     USB_OTG_DOEPCTRL_STALLH_Msk                                    /*!< STALL handshake */
#define USB_OTG_DOEPCTRL_NAKCLR_Pos                                 (26U)
#define USB_OTG_DOEPCTRL_NAKCLR_Msk                                 (0x1UL << USB_OTG_DOEPCTRL_NAKCLR_Pos)                         /*!< 0x04000000 */
#define USB_OTG_DOEPCTRL_NAKCLR                                     USB_OTG_DOEPCTRL_NAKCLR_Msk                                    /*!< Clear NAK */
#define USB_OTG_DOEPCTRL_NAKSET_Pos                                 (27U)
#define USB_OTG_DOEPCTRL_NAKSET_Msk                                 (0x1UL << USB_OTG_DOEPCTRL_NAKSET_Pos)                         /*!< 0x08000000 */
#define USB_OTG_DOEPCTRL_NAKSET                                     USB_OTG_DOEPCTRL_NAKSET_Msk                                    /*!< Set NAK */
#define USB_OTG_DOEPCTRL_EPDIS_Pos                                  (30U)
#define USB_OTG_DOEPCTRL_EPDIS_Msk                                  (0x1UL << USB_OTG_DOEPCTRL_EPDIS_Pos)                          /*!< 0x40000000 */
#define USB_OTG_DOEPCTRL_EPDIS                                      USB_OTG_DOEPCTRL_EPDIS_Msk                                     /*!< Endpoint disable */
#define USB_OTG_DOEPCTRL_EPEN_Pos                                   (31U)
#define USB_OTG_DOEPCTRL_EPEN_Msk                                   (0x1UL << USB_OTG_DOEPCTRL_EPEN_Pos)                           /*!< 0x80000000 */
#define USB_OTG_DOEPCTRL_EPEN                                       USB_OTG_DOEPCTRL_EPEN_Msk                                      /*!< Endpoint enable */

