kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f427xx.h
/********************  Bit definition for USB_OTG_DOEPINT register  ********************/
#define USB_OTG_DOEPINT_TSFCMP_Pos                                  (0U)
#define USB_OTG_DOEPINT_TSFCMP_Msk                                  (0x1UL << USB_OTG_DOEPINT_TSFCMP_Pos)                          /*!< 0x00000001 */
#define USB_OTG_DOEPINT_TSFCMP                                      USB_OTG_DOEPINT_TSFCMP_Msk                                     /*!< Transfer completed interrupt */
#define USB_OTG_DOEPINT_EPDIS_Pos                                   (1U)
#define USB_OTG_DOEPINT_EPDIS_Msk                                   (0x1UL << USB_OTG_DOEPINT_EPDIS_Pos)                           /*!< 0x00000002 */
#define USB_OTG_DOEPINT_EPDIS                                       USB_OTG_DOEPINT_EPDIS_Msk                                      /*!< Endpoint disabled interrupt */
#define USB_OTG_DOEPINT_AHBERR_Pos                                  (2U)
#define USB_OTG_DOEPINT_AHBERR_Msk                                  (0x1UL << USB_OTG_DOEPINT_AHBERR_Pos)                          /*!< 0x00000004 */
#define USB_OTG_DOEPINT_AHBERR                                      USB_OTG_DOEPINT_AHBERR_Msk                                     /*!< AHB Error (AHBErr) during an OUT transaction */
#define USB_OTG_DOEPINT_SETPCMP_Pos                                 (3U)
#define USB_OTG_DOEPINT_SETPCMP_Msk                                 (0x1UL << USB_OTG_DOEPINT_SETPCMP_Pos)                         /*!< 0x00000008 */
#define USB_OTG_DOEPINT_SETPCMP                                     USB_OTG_DOEPINT_SETPCMP_Msk                                    /*!< SETUP phase done */
#define USB_OTG_DOEPINT_RXOTDIS_Pos                                 (4U)
#define USB_OTG_DOEPINT_RXOTDIS_Msk                                 (0x1UL << USB_OTG_DOEPINT_RXOTDIS_Pos)                         /*!< 0x00000010 */
#define USB_OTG_DOEPINT_RXOTDIS                                     USB_OTG_DOEPINT_RXOTDIS_Msk                                    /*!< OUT token received when endpoint disabled */
#define USB_OTG_DOEPINT_OTEPSPR_Pos                                 (5U)
#define USB_OTG_DOEPINT_OTEPSPR_Msk                                 (0x1UL << USB_OTG_DOEPINT_OTEPSPR_Pos)                         /*!< 0x00000020 */
#define USB_OTG_DOEPINT_OTEPSPR                                     USB_OTG_DOEPINT_OTEPSPR_Msk                                    /*!< Status Phase Received For Control Write */
#define USB_OTG_DOEPINT_RXBSP_Pos                                   (6U)
#define USB_OTG_DOEPINT_RXBSP_Msk                                   (0x1UL << USB_OTG_DOEPINT_RXBSP_Pos)                           /*!< 0x00000040 */
#define USB_OTG_DOEPINT_RXBSP                                       USB_OTG_DOEPINT_RXBSP_Msk                                      /*!< Back-to-back SETUP packets received */
#define USB_OTG_DOEPINT_OUTPKTERR_Pos                               (8U)
#define USB_OTG_DOEPINT_OUTPKTERR_Msk                               (0x1UL << USB_OTG_DOEPINT_OUTPKTERR_Pos)                       /*!< 0x00000100 */
#define USB_OTG_DOEPINT_OUTPKTERR                                   USB_OTG_DOEPINT_OUTPKTERR_Msk                                  /*!< OUT packet error */
#define USB_OTG_DOEPINT_NAK_Pos                                     (13U)
#define USB_OTG_DOEPINT_NAK_Msk                                     (0x1UL << USB_OTG_DOEPINT_NAK_Pos)                             /*!< 0x00002000 */
#define USB_OTG_DOEPINT_NAK                                         USB_OTG_DOEPINT_NAK_Msk                                        /*!< NAK Packet is transmitted by the device */
#define USB_OTG_DOEPINT_NYET_Pos                                    (14U)
#define USB_OTG_DOEPINT_NYET_Msk                                    (0x1UL << USB_OTG_DOEPINT_NYET_Pos)                            /*!< 0x00004000 */
#define USB_OTG_DOEPINT_NYET                                        USB_OTG_DOEPINT_NYET_Msk                                       /*!< NYET interrupt */
#define USB_OTG_DOEPINT_STPKTRX_Pos                                 (15U)
#define USB_OTG_DOEPINT_STPKTRX_Msk                                 (0x1UL << USB_OTG_DOEPINT_STPKTRX_Pos)                         /*!< 0x00008000 */
#define USB_OTG_DOEPINT_STPKTRX                                     USB_OTG_DOEPINT_STPKTRX_Msk                                    /*!< Setup Packet Received */
/********************  Bit definition for USB_OTG_DOEPTRS register  ********************/

#define USB_OTG_DOEPTRS_EPTRS_Pos                                   (0U)
#define USB_OTG_DOEPTRS_EPTRS_Msk                                   (0x7FFFFUL << USB_OTG_DOEPTRS_EPTRS_Pos)                       /*!< 0x0007FFFF */
#define USB_OTG_DOEPTRS_EPTRS                                       USB_OTG_DOEPTRS_EPTRS_Msk                                      /*!< Transfer size */
#define USB_OTG_DOEPTRS_EPPCNT_Pos                                  (19U)
#define USB_OTG_DOEPTRS_EPPCNT_Msk                                  (0x3FFUL << USB_OTG_DOEPTRS_EPPCNT_Pos)                        /*!< 0x1FF80000 */
#define USB_OTG_DOEPTRS_EPPCNT                                      USB_OTG_DOEPTRS_EPPCNT_Msk                                     /*!< Packet count */

#define USB_OTG_DOEPTRS_SPCNT_Pos                                   (29U)
#define USB_OTG_DOEPTRS_SPCNT_Msk                                   (0x3UL << USB_OTG_DOEPTRS_SPCNT_Pos)                           /*!< 0x60000000 */
#define USB_OTG_DOEPTRS_SPCNT                                       USB_OTG_DOEPTRS_SPCNT_Msk                                      /*!< SETUP packet count */
#define USB_OTG_DOEPTRS_SPCNT_0                                     (0x1UL << USB_OTG_DOEPTRS_SPCNT_Pos)                           /*!< 0x20000000 */
#define USB_OTG_DOEPTRS_SPCNT_1                                     (0x2UL << USB_OTG_DOEPTRS_SPCNT_Pos)                           /*!< 0x40000000 */

/********************  Bit definition for USB_OTG_DOEPDMA register  ********************/
#define USB_OTG_DOEPDMA_DMAADDR_Pos                                 (0U)
#define USB_OTG_DOEPDMA_DMAADDR_Msk                                 (0xFFFFFFFFUL << USB_OTG_DOEPDMA_DMAADDR_Pos)                  /*!< 0xFFFFFFFF */
#define USB_OTG_DOEPDMA_DMAADDR                                     USB_OTG_DOEPDMA_DMAADDR_Msk                                    /*!< DMA address */


/********************  Bit definition for PCGCCTL register  ********************/
#define USB_OTG_PCGCCTL_STOPCLK_Pos                                 (0U)
#define USB_OTG_PCGCCTL_STOPCLK_Msk                                 (0x1UL << USB_OTG_PCGCCTL_STOPCLK_Pos)                         /*!< 0x00000001 */
#define USB_OTG_PCGCCTL_STOPCLK                                     USB_OTG_PCGCCTL_STOPCLK_Msk                                    /*!< SETUP packet count */
#define USB_OTG_PCGCCTL_GATECLK_Pos                                 (1U)
#define USB_OTG_PCGCCTL_GATECLK_Msk                                 (0x1UL << USB_OTG_PCGCCTL_GATECLK_Pos)                         /*!< 0x00000002 */
#define USB_OTG_PCGCCTL_GATECLK                                     USB_OTG_PCGCCTL_GATECLK_Msk                                    /*!<Bit 0 */
#define USB_OTG_PCGCCTL_PHYSUSP_Pos                                 (4U)
#define USB_OTG_PCGCCTL_PHYSUSP_Msk                                 (0x1UL << USB_OTG_PCGCCTL_PHYSUSP_Pos)                         /*!< 0x00000010 */
#define USB_OTG_PCGCCTL_PHYSUSP                                     USB_OTG_PCGCCTL_PHYSUSP_Msk                                    /*!<Bit 1 */

