kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f427xx.h
/******************************* GPIO Instances *******************************/
#define IS_GPIO_ALL_INSTANCE(INSTANCE) (((INSTANCE) == GPIOA) || \
                                        ((INSTANCE) == GPIOB) || \
                                        ((INSTANCE) == GPIOC) || \
                                        ((INSTANCE) == GPIOD) || \
                                        ((INSTANCE) == GPIOE) || \
                                        ((INSTANCE) == GPIOF) || \
                                        ((INSTANCE) == GPIOG) || \
                                        ((INSTANCE) == GPIOH))

/******************************** I2C Instances *******************************/
#define IS_I2C_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1) || \
                                       ((INSTANCE) == I2C2) || \
                                       ((INSTANCE) == I2C3))

/******************************* SMBUS Instances ******************************/
#define IS_SMBUS_ALL_INSTANCE         IS_I2C_ALL_INSTANCE

/******************************* RNG Instances ********************************/
#define IS_RNG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == RNG)

/****************************** RTC Instances *********************************/
#define IS_RTC_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == RTC)


/******************************** SPI Instances *******************************/
#define IS_SPI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SPI1) || \
                                       ((INSTANCE) == SPI2) || \
                                       ((INSTANCE) == SPI3))


/****************** TMR Instances : All supported instances *******************/
#define IS_TMR_INSTANCE(INSTANCE) (((INSTANCE) == TMR1)  || \
                                    ((INSTANCE) == TMR2) || \
                                    ((INSTANCE) == TMR3) || \
                                    ((INSTANCE) == TMR4) || \
                                    ((INSTANCE) == TMR5) || \
                                    ((INSTANCE) == TMR6) || \
                                    ((INSTANCE) == TMR7) || \
                                    ((INSTANCE) == TMR8) || \
                                    ((INSTANCE) == TMR9) || \
                                    ((INSTANCE) == TMR10)|| \
                                    ((INSTANCE) == TMR11)|| \
                                    ((INSTANCE) == TMR12)|| \
                                    ((INSTANCE) == TMR13)|| \
                                    ((INSTANCE) == TMR14))

/************* TMR Instances : at least 1 capture/compare channel *************/
#define IS_TMR_CC1_INSTANCE(INSTANCE)   (((INSTANCE) == TMR1)  || \
                                         ((INSTANCE) == TMR2)  || \
                                         ((INSTANCE) == TMR3)  || \
                                         ((INSTANCE) == TMR4)  || \
                                         ((INSTANCE) == TMR5)  || \
                                         ((INSTANCE) == TMR8)  || \
                                         ((INSTANCE) == TMR9)  || \
                                         ((INSTANCE) == TMR10) || \
                                         ((INSTANCE) == TMR11) || \
                                         ((INSTANCE) == TMR12) || \
                                         ((INSTANCE) == TMR13) || \
                                         ((INSTANCE) == TMR14))

/************ TMR Instances : at least 2 capture/compare channels *************/
#define IS_TMR_CC2_INSTANCE(INSTANCE) (((INSTANCE) == TMR1) || \
                                       ((INSTANCE) == TMR2) || \
                                       ((INSTANCE) == TMR3) || \
                                       ((INSTANCE) == TMR4) || \
                                       ((INSTANCE) == TMR5) || \
                                       ((INSTANCE) == TMR8) || \
                                       ((INSTANCE) == TMR9) || \
                                       ((INSTANCE) == TMR12))

/************ TMR Instances : at least 3 capture/compare channels *************/
#define IS_TMR_CC3_INSTANCE(INSTANCE)   (((INSTANCE) == TMR1) || \
                                         ((INSTANCE) == TMR2) || \
                                         ((INSTANCE) == TMR3) || \
                                         ((INSTANCE) == TMR4) || \
                                         ((INSTANCE) == TMR5) || \
                                         ((INSTANCE) == TMR8))

/************ TMR Instances : at least 4 capture/compare channels *************/
#define IS_TMR_CC4_INSTANCE(INSTANCE) (((INSTANCE) == TMR1) || \
                                       ((INSTANCE) == TMR2) || \
                                       ((INSTANCE) == TMR3) || \
                                       ((INSTANCE) == TMR4) || \
                                       ((INSTANCE) == TMR5) || \
                                       ((INSTANCE) == TMR8))

/******************** TMR Instances : Advanced-control timers *****************/
#define IS_TMR_ADVANCED_INSTANCE(INSTANCE) (((INSTANCE) == TMR1) || \
                                           ((INSTANCE) == TMR8))

/******************* TMR Instances : Timer input XOR function *****************/
#define IS_TMR_XOR_INSTANCE(INSTANCE)   (((INSTANCE) == TMR1) || \
                                         ((INSTANCE) == TMR2) || \
                                         ((INSTANCE) == TMR3) || \
                                         ((INSTANCE) == TMR4) || \
                                         ((INSTANCE) == TMR5) || \
                                         ((INSTANCE) == TMR8))

/****************** TMR Instances : DMA requests generation (UDE) *************/
#define IS_TMR_DMA_INSTANCE(INSTANCE) (((INSTANCE) == TMR1) || \
                                       ((INSTANCE) == TMR2) || \
                                       ((INSTANCE) == TMR3) || \
                                       ((INSTANCE) == TMR4) || \
                                       ((INSTANCE) == TMR5) || \
                                       ((INSTANCE) == TMR6) || \
                                       ((INSTANCE) == TMR7) || \
                                       ((INSTANCE) == TMR8))

